{
    "407/4953": {
        "remotekey": [
            "407/4953"
        ],
        "item_category": [
            "Aznu is a new way of buying that premium branded phone you always wanted, but at a much more pocket-friendly price. With Aznu, you get a refurbished phone with the same camera, features and processor, plus a brand-new screen and a 12-month warranty. You also have the knowledge that buying Aznu helps reduce landfill and waste. We include a Sim tool so it's easy to pop your old card in, a year's worth of Norton 360 VPN Virus and Spam protection, and a cable and charger so it's ready to go! If it looks like new, it must be Aznu. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "6 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "21 April 2021",
            "14 April 2021",
            "31 March 2021",
            "24 February 2021",
            "23 February 2021",
            "2 December 2020"
        ],
        "review_title": [
            "Amazing phone for an AZNU product",
            "Good phone",
            "Refurbished but looks new.",
            "Looks like new",
            "Phone",
            "Still a brilliant phone"
        ],
        "review_text": [
            "I was unsure about buying an AZNU product but I have to say I am thrilled with it. I had a Samsung J3 6 and having bought the Samsung S9 plus I find that there is so much more that I can do with it. It has been challenging working out the new apps but I am just loving it. It arrived quickly and was boxed as if brand new. The screen protector had bubbled but not too much of a problem as once the screen is on you don't notice it. Well pleased with my purchase.",
            "The phone is very good and very fast, there is a charger and the phone is fast at charging",
            "Didn't realise Argos sold refurbished goods but love my new phone. Looks new. Easy to use. Great photos - lovely colours and has additional feature where you can zoom in. Battery lasts all day and can use it to watch films etc",
            "Phone looks like new works perfectly but Too bit expensive",
            "Phone is perfect for me just the battery didn't hold for long",
            "I found the colour and spec I want at a great price. It was delivered very quick and a welcomed step up from my previous Samsung mobile. I have had it bow for over a month and it is smooth and has everything I need from a top.end smartphone."
        ]
    }
}