{
    "869/8005": {
        "remotekey": [
            "869/8005"
        ],
        "item_category": [
            "The Find X2 Neo is a super slim super lightweight 5G smartphone. With a quad rear camera set up with Ultra Steady Video 2.0 for incredibly smooth videos. 5G connectivity and a 90Hz refresh rate display with pin sharp FHD+ resolution for truly immersive entertainment. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "18 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "26 July 2021",
            "25 July 2021",
            "24 July 2021",
            "8 June 2021",
            "31 May 2021",
            "31 May 2021",
            "5 May 2021",
            "10 March 2021",
            "28 January 2021",
            "27 January 2021",
            "19 January 2021",
            "11 October 2020",
            "11 October 2020",
            "30 September 2020",
            "30 September 2020",
            "30 September 2020",
            "30 September 2020"
        ],
        "review_title": [
            "Great",
            "Mobile phone oppo neo 2",
            "Brilliant phone at low price",
            "Very good purchase",
            "Excellent product",
            "Actually the best",
            "",
            "Great phone with a quality spec",
            "Stunning value",
            "Very nice and fast phone",
            "Phone looks and feels great!",
            "Is an excellent phone",
            "Pleasantly surprised!!",
            "Love how light it is",
            "I have always been an iPhone user and quite honestly I was apprehensive to even change",
            "Always had Samsung phones up until this, but this blows them away!",
            "X2 Neo",
            "Find X2 Neo"
        ],
        "review_text": [
            "I bought this a month ago and evrything a was great about it",
            "Brilliant phone very pleased great value for money",
            "Great phone amazing low price. The only issue I have is that the app market and theme store not pre loaded. I had to download the app market but still can't download theme store",
            "Very please with phone, one of the best mid range phones with flagship features at a good price. The specs are good, everyday function is good, the camera and screen are amazing for the price. Would recommend",
            "Best ever. The camera is great, calling is great and general feature sounds great. The phone is light weighted.",
            "I'll admit I was skeptical...I had never heard of Oppo and I had no expectations but I have been pleasantly surprised! The colours are amazing, the phone is excellent to use and the customer service is outstanding. I'm an Oppo convert.",
            "",
            "I compared specs and found this to be a very good competitor to the more well known brands but at a fraction of the cost.\n\nIt's very responsive, quick and easy to use. The camera is very good quality and when you turn on the Dolby Atmos sound the speakers are brilliant. \n\nThe best thing about this phone is the charging capability. If the battery runs dead or you turn off the phone, it reaches full charge on around 35 mins.\n\nGet one.",
            "Really good phone, originally over £500, great Sony sensor in camera with wide and 2x zoom, fast enough for me, plus 5g when it finally arrives\nFeels and looks premium with glass and metal\nNo expandable storage but with 256gb built in who cares\nIt's got NFC for Google pay\nNo headphone jack, and no IP rating are the only complaints.\nCompact light slim . \nComes with a case and screen protector so ready to go \nBear in mind it's NOT the Find X2 as website originally states.",
            "Note 1st that this is the 'OPPO Find X2 Neo' not the 'OPPO Find X2' although this can be determined by the quoted model no CPH2009. (x2 is (CPH2023)) it has a snapdraggon 764 (score 133) vs the snapdragon 865 (score 149) of the Find X2 however it is still a pretty nippy phone. Has plenty of ram and storage too, and despite having lots of apps open at the same time has never slowed down and has always had a lot of memory still free. The cameras are pretty cool too.",
            "I've only recently learned of Oppo phones and I'm so glad I did! The display is amazing, the feel of the phone is sleek and it runs so smooth. Everything is fast and gaming is great on it too! It cames with a screen protector already attached which is a sweet bonus and I hate putting this things on! I had a Sony Xperia Xz3 and this is 10 times better all round!",
            "I was never expected to be such a good phone.",
            "A was given this handset by my employer to replace our I Phones and must say I wasn't happy. I have always been an I Phone user and wasn't looking forward to learning a new system. \\\nHow shocked was I, when I  found it easier than expected to get on with? The size is great, what first looked like a big phone fits surprisingly well in the hand. The battery great and the charging is so fast. It has an amazing Camera set up, very easy to use, and when I looked at the price? well, I was pretty blown away. My upgrade is due on my own phone and I have been looking at the Reno 4 Pro. My only disappointment is the color options and case choices. However, you have a convert",
            "I always choose my phone on design, I like having a big screen because I can see the keyboard better but this often comes with a heavier phone. Not in the case of the X2 Neo, its so light and fits in my pocket! I had a small problem understanding Android as I'm an Apple user for everything else but I used the live chat on the OPPO website and they ironed out my thinking. So much easier!",
            "I have always been an iPhone user and quite honestly I was apprehensive to even change. However, after a recommendation from a family member I was introduced to OPPO and I certainly won’t look back. The camera is simply amazing but my favourite is the super-fast charging (which is just the best when you are always on the go!). We as a family are now all OPPO users! \\",
            "Always had Samsung phones up until this, but this blows them away! Took a photo in low light and it genuinely looked like I took it in the day. Storage is really generous, design is super premium (love the orange leather) and the charging time is truly impressive, it’s so fast! Really handy for that quick charge every couple of days.\\\nCouldn’t recommend this handset highly enough!\\\nDefinitely will get an OPPO device in the future.\\",
            "I had a Nokia phone which I had for years so this was quite the upgrade I love it simple to use, looks really amazing too charges really quick too.",
            "Love my brand new Find X2 Neo. Looks good, great store space and really clear camera. Upgraded from Samsung S8+ and the difference in camera quality and overall speed of the phone is impressive. However I’d say my favourite feature is the fast charger, I plug my phone in for half a hour and I’ve plenty of battery for the rest of the day."
        ]
    }
}