{
    "886/9425": {
        "remotekey": [
            "886/9425"
        ],
        "item_category": [
            "The Alcatel 20.53 allows you to have communication on-the-go with calls, texts and have essential multimedia on-hand. With the 1.3MP flash camera you'll never miss a thing couple that with a 2.4 inch display allowing you to comfortably read messages, check calendar appointments and set alarms. Plus add in extendable memory up to 32GB making this a powerful feature phone. "
        ],
        "summary_star_rating": [
            "4.1"
        ],
        "no_reviews": [
            "78 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "82%"
        ],
        "review_rating": [
            "5",
            "4",
            "4",
            "5",
            "5",
            "2",
            "2",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "3",
            "3",
            "2",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "2",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "21 July 2021",
            "9 May 2021",
            "6 May 2021",
            "5 May 2021",
            "29 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "13 April 2021",
            "7 April 2021",
            "30 March 2021",
            "17 March 2021",
            "16 March 2021",
            "12 February 2021",
            "10 February 2021",
            "3 February 2021",
            "2 February 2021",
            "20 January 2021",
            "19 January 2021",
            "5 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "2 December 2020",
            "1 December 2020",
            "25 November 2020",
            "24 November 2020",
            "18 November 2020",
            "18 November 2020",
            "12 November 2020",
            "21 October 2020",
            "21 October 2020",
            "20 October 2020",
            "5 August 2020",
            "29 July 2020",
            "10 June 2020",
            "27 May 2020",
            "27 May 2020",
            "20 May 2020",
            "20 May 2020",
            "20 May 2020",
            "20 May 2020",
            "19 May 2020",
            "29 April 2020",
            "29 April 2020",
            "22 April 2020",
            "7 April 2020",
            "24 March 2020",
            "19 February 2020",
            "18 February 2020",
            "4 February 2020",
            "29 January 2020",
            "14 January 2020",
            "14 January 2020",
            "11 January 2020",
            "8 January 2020",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "20 November 2019",
            "6 November 2019",
            "26 September 2019",
            "17 September 2019",
            "11 September 2019",
            "5 September 2019",
            "30 July 2019",
            "25 June 2019",
            "6 June 2019",
            "15 May 2019",
            "26 March 2019",
            "20 March 2019",
            "19 March 2019",
            "16 February 2019",
            "5 February 2019"
        ],
        "review_title": [
            "Compact and easy to use",
            "Mobile phone",
            "Well made phone",
            "Just what I need",
            "Ideal",
            "Not good doesn't charge, not good.",
            "Semi-blind Camera Phone",
            "Great first phone",
            "Fairly simple to use lightweight phone for elderly",
            "Fab phone for older generation",
            "It is cert easy to use",
            "Unfortunately doesn't work with the three",
            "JUST WHAT I WANTED",
            "Lovely phone. Large buttons and easy to use.",
            "Bought as a replacement",
            "Poor",
            "Mobile",
            "good basic phone",
            "Does the job, ideal if you just want calls & texts",
            "Good basic phone",
            "Alcatel Flip Phone",
            "Cheap and nasty",
            "Looks good",
            "Easy to use phone",
            "I’m happy with my products which I purchased in ar",
            "good spare phone",
            "Telephone OK but no manual with it!!!",
            "Bought for my mother.  She loves it.easy to use",
            "VERY dated phone",
            "Fit for purpose",
            "Good basic phone",
            "Got for my elderly dad a'd he loves it",
            "Good simple phone",
            "rubbish",
            "Good",
            "Works well.",
            "Fabulous Phone",
            "My phone not only looks great it also works  great",
            "Never",
            "My phone is just what i wanted for my daughter",
            "Would. not buy  this again",
            "It was a real letdown, not as good as the Doro",
            "Not what was wanted",
            "Great purchase",
            "neat",
            "Very easy to use",
            "chosen by my wife and it is ideal for her needs",
            "Mobile light weight",
            "A 'GREAT' Little Phone",
            "Mum loves it - it’s a flip phone!",
            "Good phone",
            "",
            "A basic easy to use phone.",
            "The phone is so  simple to use",
            "My phone",
            "It works great and a good ringtone it’s loud enoug",
            "excellent product & service",
            "Nice phone",
            "Simple to use",
            "Its just what my 82 year mum wanted",
            "Good small phone",
            "Perfect for the less tech needed user.",
            "Simple little phone does basics text & calls",
            "Easy to use",
            "New mobile phone",
            "Low ring tone spoils it all!",
            "Its a good phone",
            "Nice basic mobile phone",
            "Basic Mobile",
            "Easy to use phone for calls and texts",
            "Phone perfect for older people",
            "Ideal basic phone",
            "Looks like designed for the elderly",
            "Alcatel phone",
            "Good phone for price",
            "Great phone for the price.",
            "My phone is brilliant.",
            "Looks good"
        ],
        "review_text": [
            "this was update of a previous model purchased from argos which i have gotten used to.",
            "Bought this phone for my elderly Mother, easy to use & the buttons are large and easy to use.",
            "A sturdy little phone",
            "Easy to use great little phone",
            "Wife, loves it.\nJust, the right size. Happy .",
            "Poor quality  returned to sender.",
            "Extremely poor quality camera for a modern camera phone. Very fuzzy photos and video quality when uploaded to laptop.",
            "Basic and easy to use , great first phone for my son",
            "Small,  very lightweight, phone. Numbers easy for older person to use. As folding doesn't ring numbers when in bag or pockets.",
            "Great phone for older generation bigger buttons good all round",
            "Easy to use for an elderly person,  quite loud speaker.",
            "Bought as a replacement for elderly mothers phone she poured water over. Unfortunately although unlocked doesn't work on the three network and unable to return once I opened the box.",
            "I ordered on line a Sim Free Alcetel 20.53 mobile.  Ordering was simple and collecting the mobile in the shop was easy.  The mobile is exactly what I wanted - I can make and receive both texts and calls.",
            "Bought as gift for my pensioner brother. Large buttons and easy to use and he is over the moon with it. Also the flip-top means he doesn’t accidentally call people when it’s in his pocket.",
            "Bought this as a replacement. Very easy to use. A basic phone was all that was required and did exactly what it was needed for.\n\nSuitable for an older person who needs a phone but doesn't want anything technical",
            "Poor quality. Primitive functions. Will have to return as has a constant buzzing sound.",
            "Got this phone for my dad who’s 80. Easy to use and big numbers. Must better than his previous mobile.",
            "purchased this for my mother and have to say its a good value for the price. the speaker is mediocre but for a flip phone at the price isn't a bad phone.",
            "Does exactly what it says it does and good battery life.",
            "Easy to use basic mobile phone",
            "Unfortunately returned item as I felt it was very flimsy. More like a child’s toy phone. Ended up still getting a Alcatel phone, just a better quality.",
            "This is a flimsy plastic phone and is pretty awful to use. The navigation button has no markings and its 50/50 whether you press it as intended. To get a capital in texting you have to go into a menu, scroll around, select, enter, then repeat it all in reverse again to get back to lower case. Nothing is intuitive, many options just don't seem to exist, and the manual is often of little use. I'll never buy another Alcatel if this is the standard they are happy to make and sell.",
            "This is an easy phone to use navagation around home screen is simple to follow",
            "Bought for an elderly person who needed a simple to use phone does exactly as it says on the tin works well decent quality for the price, be aware this a phone that uses 2g network only so not suitable for some providers",
            "I’m satisfied with my oroducts",
            "good phone to just keep in the car",
            "No manual. How do you expect someone to guess how the unit is set up and worked!",
            "Just the job. Compact and simple to use",
            "I bought this for my mother, she had a similar model for over 5 years, but the battery was barely lasting half a day.\nWhat was REALLY annoying was she kept getting a 'messages full' notification and she has to continually delete old messages to receive new ones as it has a 50 message limit....yeah, seriously.\nWHY there is such a limit is beyond me, this is the most USELESS phone EVER.\nI want to return it for her as she's getting VERY frustrated and upset about it.\nAVOID AT ALL COSTS.",
            "Fit for purpose, simple and have large buttons perfect for those with slightly larger fingers.",
            "I use this phone when I go out or on holiday and don’t want to be hassled by email or other smartphone distractions.",
            "Brought for my elderly dad he finds it really easy to use",
            "I bought this for my 90 year old father in law who found it difficult to use a smart phone. This phone was simple to use and he learned how to use it within about 20 minutes. The battery life is good and he was able to enter and retrieve telephone numbers easily.",
            "very tinny taken back",
            "A good phone for our age group",
            "Got this for my mum she is 83 years old and she finds it easy to use.",
            "This phone is great would very much reccomend it",
            "this phone works great for me because it has large number's that make it easy to see  when texting easy to use Brilliant Doro can not fault this mobile phone very pleased with it.\n                             Thank you Argos.",
            "No good for G3 Network as it only covers up to G2 !\nAppalling should be discontinued and removed from Stocks !",
            "Looks good, easy to use and is perfect for my daughter.",
            "This is the second Alcatel phone my previous one was a better design would not purchase this again.",
            "Very disappointed not as good as the Doro went and bought another Doro , will keep this as a spare that's all it's good for.",
            "Brought it to replace same make of phone it was smaller and was not used",
            "Nice wee run about phone purchased for work purposes.",
            "it is nice and small and will fit in your pocket and very easy to use",
            "Very satisfied with my new phone and so quick and easy to use, would remend to people who don't want all the internet access.",
            "because of the problems at the moment with all phone shops shut help was very difficult to obtain, we do not like bying without seeing the item so we spent quite a while taking soundings but at the end we were very happy with the phone we chose.",
            "Works great loud ring tone, super small and light",
            "This is just what I wanted from a 2G phone. Obviously there is no internet access with 2G but, that is what I like about it. The numbers are easy to read, the ringtone is loud enough, messages are easy to access, texting requires a bit of practice - to apply punctuation marks. It even played a melody on my birthday! photos are easy to export to a laptop via blue tooth pairing. No emergency button to be activated involuntary. Battery lasts for days before re-charging.",
            "Old people love flip phones, the only criticism is that a screen on the front to show the time and date would be really handy, so you don’t need to open the phone to see the time. But it does the job, and slimmer and lighter than the DORO phones so a bonus.",
            "Very good phone easy to use and reliable",
            "was bought for an elderly person and has large buttons which helps with dexterity",
            "A basic phone with fairly large  key pad making it easy to use.",
            "it is so simple to use and send texts messages and the number are simple to see",
            "Very easy phone to use, love the design of it.",
            "I just use it to ring ideal for the job I do",
            "Excellent product & service",
            "Very slim and light,easy to use",
            "Bought for an elderly relative, easy to use with big buttons. Only one ring tone and internal memory very small but we got a memory card to put in.",
            "For those needing larger numbers its ideal",
            "If your looking for a phone that  does the basics this is it .does extras but if you wanted that you would get a dearer one.  Great little phone bought for my 90 year old father and he can use it .",
            "Bought for an elderly Aunt who didn't want / need all the aspects of a smart phone. \"Just want to phone people\" were the given requirements. This fits the bill perfectly.  The larger keypad is an added bonus too.",
            "Basic phone does what it says",
            "Bought for my father who isn’t good with technology. Easy to use he is happy with it",
            "Bought for a Christmas present. It’s description shows it ought to be ok but won’t know yet.",
            "Ringtone is extremely low even when you set it to the highest level.",
            "I bought this phone just so I can use it for work, but actually this is quite a good phone.",
            "At first I had problems setting it up because I could not find how to change the language from French to English, but in the end I got there and then I had problems with my new provider for my new phone as the SIM card in these new phones are micro and my old phone had the large SIM card so I decided to change my provider, and I am very please with this phone as the whole screen and keys are now cover up compare to my old phone and it just great",
            "Reasonably priced, basic, sim free mobile. Easy to set up and use. Only issue I had was removing the cover to insert the SIM card, the back proved difficult to remove.",
            "Needed a basic mobile for my father who isn't very tech savvy. This does the job perfectly, has a loud ring that he can hear when it's in his pocket and he finds it easy to use. It's handy that the flip doesn't answer calls so you can see who's calling before you answer.",
            "Perfect for my dad who’s 64 big buttons on keypad, easy to use",
            "This is a very simple basic for those who just want to call and text",
            "Nice looking phone, looked easy to use but the ringer is so quiet my farther couldn’t hear it",
            "Bought for my  father in law as his phone broke. Quick easy to set up and use. Old style phone but works well for him nice big bottons",
            "Would recommend for value and practicalily",
            "I bought this for my great uncle who just needed something simple. He was very happy with this phone.",
            "I would highly recommend for someone who wants to make just calls and text.",
            "I bought this phone for my mum. She like it. The bad points are we can save only 1 phone number on one contact. Only one ring tone for this phone and we can’t change the ringtones. We can use only 2G signal for voice calls."
        ]
    }
}