{
    "848/3382": {
        "remotekey": [
            "848/3382"
        ],
        "item_category": [
            "iPhone 12 mini packs big features in a 5.4-inch design. Incredible low-light photography with Night mode on all cameras. Cinema-grade Dolby Vision HDR video recording, editing and playback. Powerful A14 Bionic chip. 5G capable and new MagSafe accessories for easy attach and faster wireless charging. It's big news for mini. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "72 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "27 July 2021",
            "27 July 2021",
            "22 July 2021",
            "21 July 2021",
            "16 July 2021",
            "23 June 2021",
            "9 June 2021",
            "9 June 2021",
            "8 June 2021",
            "2 June 2021",
            "6 May 2021",
            "5 May 2021",
            "4 May 2021",
            "4 May 2021",
            "4 May 2021",
            "28 April 2021",
            "27 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "20 April 2021",
            "15 April 2021",
            "15 April 2021",
            "14 April 2021",
            "14 April 2021",
            "7 April 2021",
            "16 March 2021",
            "10 March 2021",
            "10 March 2021",
            "2 March 2021",
            "2 March 2021",
            "24 February 2021",
            "20 February 2021",
            "17 February 2021",
            "3 February 2021",
            "2 February 2021",
            "2 February 2021",
            "27 January 2021",
            "24 January 2021",
            "21 January 2021",
            "20 January 2021",
            "20 January 2021",
            "19 January 2021",
            "7 January 2021",
            "5 January 2021",
            "5 January 2021",
            "3 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "3 December 2020",
            "2 December 2020",
            "2 December 2020",
            "1 December 2020",
            "1 December 2020",
            "1 December 2020",
            "27 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020"
        ],
        "review_title": [
            "Lovely little phone",
            "A good phone.",
            "Always good",
            "A wonderful product",
            "A brilliant phone",
            "Fantastic",
            "Mr",
            "Top iPhone",
            "Nice and compact",
            "Best iphone ever made.",
            "Nice",
            "Great price",
            "Great little phone",
            "A convenient upgrade",
            "Great ‘little’ phone",
            "It’s good",
            "Great looking phone and great size",
            "iPhone 12 new design",
            "Love this phone",
            "Great small phone.",
            "Loving this small device❤️",
            "Works really well and good value",
            "Nice to have a smaller phone with decent specs",
            "Love this phone!",
            "Great phone that’s ‘big’ yet small",
            "Amazing as it should be",
            "New iPhone is amazing and super quick delivery!",
            "iPhone 12 mini",
            "Great iPhone!",
            "Iphone Mini 12",
            "Great compact iPhone",
            "Amazing phone",
            "First iPhone",
            "pleased with my purchase ,and with the price.",
            "The phone is brilliant",
            "Small, fast and all round best iPhone",
            "Nice phone",
            "Best iPhone yet",
            "Lovely phone",
            "Great phone amazing camera",
            "Great phone",
            "Great Iphone",
            "Very nice and slim with smooth charm",
            "Phone looks great",
            "Excellent Phone",
            "Very good but!!",
            "",
            "Great buy",
            "Perfect Choice",
            "",
            "iPhone 12 mini",
            "I-phone12 mini",
            "Great Phone",
            "Great phone",
            "The best phone ever made by apple",
            "Great product , love it .",
            "A really good iPhone and is working well.",
            "Good phone",
            "Great I phone",
            "Great new iPhone",
            "iPhone 12 Mini, A Small Wonder",
            "Love the iPhone 13 mini",
            "",
            "",
            "Compact phone and still does everything it should",
            "Small but powerful",
            "this iphone 12mini is amazing mobile",
            "Perfect size",
            "It fits in your pocket!!",
            "Love this phone",
            "My new phone is great, love the new design.",
            "iPhone 12 Mini green amazing little phone"
        ],
        "review_text": [
            "Bought this phone to gift it to my sister and she loved it absolutely Little nice phone..",
            "I like it but it does things differently to my old Android phones and I still can't always work out why it did something. (Why does the torch turn on at random times?)",
            "I am really happy about Argos all product but I phone are expensive",
            "I bought this for my wife and it's one of my best purchases this year... Great service Argos ... Well Done.\nTransferring everything from the old I-phone was really easy. This phone fits easily into my pocket although it's a little heavier than the old original SE, but it works really well and I'll be back to Argos when I get my next one!",
            "This is one of my best purchases this year... Great service Argos ... Well Done.\nTransferring everything from the old I-phone was really easy. This phone fits easily into my pocket although it's a little heavier than the old original SE, but it works really well and I'll be back to Argos when I get my next one!",
            "Simply and beautiful phone",
            "Im happy it’s really beautiful",
            "Bought iPhone mini 3weeks, good battery life, love the Face ID, would highly recommend",
            "Love this phone great size",
            "I never think that the cheapest iPhone is going to be the best iPhone ever. Size, screen, battery and camera. Every aspect of it was great. I'm so happy with the quality of the phone.",
            "I bought this a month ago and I am so happy",
            "Excellent service from Argos",
            "I was looking for to upgrade from my 2016 SE and this phone has been perfect. Battery life is great, photo quality is excellent and it’s a very comfortable fit for my hands (compared to other models).",
            "Upgraded from the old SE. Love the colour and size. Apart from the battery life (average), it is a very convenient and lovely phone.",
            "My iPhone 5s finally died. Resisted buying a new one because of the size. iPhone 12 mini came into being, prayers answered. It is slightly bigger in overall size compared to iPhone 5 but still fits in my saddle bag easily. Screen size is bigger with no home button.\nDifferent at first but soon got used to it.\nBattery lasts me a day and half two at a push. I am a light user, no social media, but a lot of calls made for work and personal.",
            "It’s a good phone. colour is very nice green.",
            "Fast delivery. Phone was cheaper with Argos and the colour I wanted couldn’t get with any other shop. Happy customer",
            "iPhone 12 is the better phone for creatives.The higher-res HDR screen is a clear improvement, the camera is better and offers Dolby Vision recording,everything is so quick and the display is crisp and bring.",
            "Absolutely perfect to me. Nothing to fault so far.. quick, light, good battery life and amazing speed. Very happy with this purchase.",
            "I wanted a phone that was the correct size for me. This fits the bill. I love it.",
            "It’s lovely small phone.You can operate with only one .I was android user for many years this is my first IPhone .Every thing work as it should no lags. Camera is next level. Best phone I ever had. Will recommend to anyone.",
            "Very impressed with this phone, I wanted a smaller one as I had an iPhone before but was just too big to hold. This has done the job perfectly and the storage size is amazing. Looks professional yet not flashy.",
            "Grown tired of having massive phones.\nThis has all the specs of a top tier phone, gorgeous screen. 5G, WiFi 6 etc, just in a really compact package.\n\nThe red looks awesome too",
            "I have upgraded from the iPhone 5s (finally!) to this iPhone 12 mini. I chose this as I love how similar they feel, with the square sides and compact size - Easy to hold, not heavy, fits in your pocket. Love the colour. The transfer of my data and photos from iCloud from device to device went perfectly and quickly. The battery life now lasts me all day. Really easy to use and navigate around the apps. Would recommend.",
            "What a great phone, fits nicely into the hand, the 5.4 screen gives good face recognition facility with easy accessibility to all apps. The 12 mini is a great buy if you don’t want a large iPhone",
            "If you upgrading from iPhone X or 11 you won’t feel difference, me who upgraded from iPhone 5s and iPhone 7 is very happy, value for money and my best solution so far regarding phones. Good battery, wireless charging, nice camera, display is not perfect on the sun but still ok. Very good sound and micro. Recommend at least 128gb capacity not less.",
            "Much cheaper than buying through apple or any other store. I ordered on Easter Saturday evening at half 6 and was delivered on Easter Sunday at 8:00am which was super fast. Phone works amazing and there’s nothing bad to say about it. I love the size of this phone as it isn’t big and bulky like the new iPhones. Camera is crazy good just like buying a canon camera but saving money as it’s 2 in one!",
            "As with all Apple kit a great product. Very fast and responsive compared with the iPhone 8 it replaced. Good price-cheapest around. Would have thought home delivery would have been included. Had to collect from local store.",
            "Really pleased with this iPhone. Basically the same size as the iPhone 8 so even though it’s described as a ‘mini’ it’s actually not small. In fact it’s a perfect size for handbags and popping in your pocket. Really pleased with it.",
            "Nice little phone ideal for people with smaller hands",
            "Good service prompt\nPhone was ready quickly on time \nStandard price \nReputable outlet",
            "Top phone top bit of tech absolutely love it",
            "I’m really pleased with it, straightforward to set up even for an idiot!",
            "pleased with my purchase and the price have and will recommend",
            "Everything was excellent",
            "Happy with my purchase 5* product and best size phone small but with all the same power as the iPhone 12 would highly recommend",
            "Ergonomic handset. Make sure you buy the charger too so you can fast charge it.",
            "Same physical size as previous iPhone but a bigger OLED screen and much faster processor.\nOrdred on Sunday, picked up with weekly shop in Sainsbury's Tuesday. Magic!",
            "This phone was a replacement for my iPhone XR as it’s lighter,smaller & just more portable.However,the battery does need charging more often,but the pros for this phone far outweigh this issue.",
            "I was unsure whether to get an iPhone without being able to view it first as shops were shut with lockdown. However the phone is great and replaces my iPhone 8 perfectly they’re roughly the same size and the camera is a better quality. The battery also lasts a lot longer and I don’t panic about being on my phone for too long.",
            "Great phone, well priced, battery better than expected",
            "It's been a pleasure to upgrade to iPhone mini 12. Great phone. Best and newest iphone, really like the size if you are not into large tablet like phones.",
            "Very nice and slim with smooth charm",
            "Highly recommend phone , looks great and other people say so also. Nice and small for pockets and bag .",
            "Excellent 'small' phone. Tiny in comparison to standard iPhone 11 or 12 but the screen is still very usable. Actually fits in your pocket! Battery life is noticeably worse than standard iPhone 11 or 12 but still gets me through a work day. Design is nice and usual Apple quality. Apparently more durable, but the screen is showing small marks already so you'll want to put it in a case. It's very expensive but also very good.",
            "As the title of this review says, Very good but,\nThe only downside is I wish the battery could have been bigger,If you are a light user you should get a day & half use out of it.\nIf you watch videos etc then you will have to charge every day.\nThe phone itself is superb,Fast charging and super quick on 4g it should be rapid on 5g.\nI used o have an 11 pro,This phone screen is slightly smaller than that but a pocket friendly size.\nOverall worth the money.",
            "I am so happy with this product!",
            "This is the perfect size iPhone for people that don't like bricks in their pockets.. The down side is the battery life needs charging every two to three days depending on usage..",
            "This phone is fast and smooth and just the right size to use one handed.",
            "Good value for the latest model",
            "Really like this new 12 mini, like the size as fits in pocket. Taken some night photos of fireworks which have turn out good and better than I thought. Alway had iPhone and this is a good version for me.",
            "A good product as you would expect from Apple.",
            "Love the iPhone mini12.Its slightly smaller than my iphone7 but bigger screen.Was going to get iPhone se as I didnt want a large phone but glad I waited for the 12.",
            "Great phone next day delivery and took advantage of 6 months interest free. Permalloy round",
            "This phone is the perfect phone for people that don’t like bigger phones, in fact I think it’s the best mini phone out there, the camera quality is fab and not much different to the iPhone 12 pro. \nYou definitely get your money’s worth by purchasing this",
            "I do recommend this phone to everyone, great features and good size .",
            "I think I have bought myself the best phone that I have ever owned. The mini size is perfect for me. The phone has kept up to expectation with a new camera system.",
            "Good phone - fast and easy to setup",
            "Lovely phone really pleased and so was grabdson",
            "Great phone nice and compact",
            "Apple never fails to please, whilst phones continue to grow to the point you can no longer hold them in one hand, Apple have made the iPhone 12 Mini a phone big enough to cope but small enough to operate with one hand. This phone is much like it’s big brother in terms of quality and performance, if you want all the features of a premium handset then grab yourself one of these as you won’t be disappointed.",
            "Excellent phone, so easy to set up and insert my SIM card from previous phone so I can keep the number.  Don’t make the same mistake I did though ... I bought a new adapter as the charging lead plug end is not USB, but later found the lead from my previous iPhone (6) fits and charges this phone perfectly. The phone itself is a delight to use. Would highly recommend!",
            "Very good and compact phone.",
            "This is the product i’ve been waiting for long❤️❤️",
            "This phone is amazing, literally an old type of feeling with the small size yet still the decent size screen. It does everything it should do and the colour looks so good cannot stress it enough!! But the only thing I would criticise is the battery life so do keep that in mind if you can’t always charge your phone or you’re a very heavy user. Overall, would recommend.",
            "Bought to replace an iPhone XR. After moving from an iPhone 6 I just found it too large and heavy. The size of this phone is perfect, comparable to the old iPhone 4. All the features of the larger model including Face ID. Pleased that I could pick up the latest model from my local Argos. Very happy with my purchase.",
            "In my opinion you need to buy iphone 12 mini form argos because it is safe because I have ordered 2 items form argos (expensive things) I bought this mobile for my son on Diwali (festival) he was very surprised.",
            "Apple after few year understood that many people like this size of phone. Not too big, not too small, just perfect. Tried last year with iPhone 11Pro and quit after one week of use (my son is happy) and back to my old, good iPhone 7. Really happy now!\nRegards",
            "Love this phone! It has all the features of the larger models but with the size that fits nicely in your hand and in pocket.  You can use it with one hand! If you set this up correctly and your not a gamer the phones battery is great in my mind. I’ve charged the phone at 8am and can easily get to midday the next day. YouTube, WhatsApp, messenger + calls. The standby time is good. Camera takes excellent pictures and FaceTime is much clearer with front 1080p cam. Downside...a charger is required.",
            "I was worried that the mini might be too small coming from a much larger phone, and whilst it took a little while to get used to, the pros definitely outweigh the cons.\n\nThe camera is insane - almost as good as my DSLR and the video camera shooting in 4K is incredible from a phone of its size. \n\nIt’s light, fast and fun. Definitely recommend!",
            "Very pleased with my new iPhone, great features such as amazing cameras for great photos and the device is quick and responsive.",
            "I have just upgraded from an iPhone 7 to this and the difference is massive. The screen is so sharp in comparison and this phone is just so fast and responsive. The colour is so much nicer than the pictures it’s like a pastel mint green. I’m so pleased I went for this and not the bigger iPhone 12."
        ]
    }
}