{
    "753/2519": {
        "remotekey": [
            "753/2519"
        ],
        "item_category": [
            "Stand out with modern classic design that radiate with subtle nature-inspired shine as well as perfectly symmetrical details. Be fully immersed in the huge 6.53 FHD+ NXTVISION display integrated with a dedicated display chipset & wireless Super Bluetooth audio sharing. Embrace the versatility with an all-scenario 48MP AI quad-cam and low-light front cam. Enjoy effortless use supported by a powerful processor, 64GB internal memory, customizable UI features and convenient unlocking technology. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "47 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "20 April 2021",
            "16 April 2021",
            "8 April 2021",
            "31 March 2021",
            "31 March 2021",
            "23 March 2021",
            "13 March 2021",
            "4 March 2021",
            "3 March 2021",
            "23 February 2021",
            "17 February 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "2 January 2021",
            "1 January 2021",
            "2 December 2020",
            "25 November 2020",
            "17 November 2020",
            "10 November 2020",
            "4 November 2020",
            "28 October 2020",
            "20 October 2020",
            "15 September 2020",
            "1 September 2020",
            "27 August 2020",
            "26 August 2020",
            "26 August 2020",
            "25 August 2020",
            "25 August 2020",
            "24 August 2020",
            "22 August 2020",
            "18 August 2020",
            "18 August 2020",
            "17 August 2020",
            "15 August 2020",
            "5 August 2020",
            "29 July 2020",
            "28 July 2020",
            "22 July 2020",
            "21 July 2020",
            "8 July 2020",
            "1 July 2020",
            "1 July 2020",
            "30 June 2020",
            "24 June 2020",
            "23 June 2020"
        ],
        "review_title": [
            "Phone is cheap and is very upto date",
            "Outstanding device! Look no further :)",
            "Good phone",
            "Phone has great features",
            "Very good phone and access services on phone Sue",
            "Works okay for the price range",
            "Phone is great",
            "perfect phone",
            "Great display,easy navigation and good camera",
            "The phone is great",
            "Phone",
            "Great phone and screen.",
            "Nice looking phone",
            "Nice little phone",
            "Phone looks beautiful and v fast",
            "Best Smartphone ever",
            "Absolutely fantastic phone",
            "",
            "",
            "Great phone super design.",
            "Great buy lovely features,",
            "It is great value for money.",
            "Great quality for the price",
            "EXCELLENT VALUE FOR MONEY",
            "Quality item",
            "",
            "Poor Battery",
            "Awesome phone",
            "Top TCL",
            "Not many options like in other phones",
            "looks great, easy to use and takes great pics.",
            "The phone is efficient and reliable.",
            "well made and worth the price",
            "Great for the price",
            "Great",
            "",
            "New phone",
            "Nice bright screen, navigation accurate",
            "Love love love",
            "New phone",
            "Good smartphon.",
            "I am so happy",
            "Great phone for your budget",
            "excellent phone",
            "I love how sleek my phone looks",
            "Thank you",
            "TCL 10L Great budget device"
        ],
        "review_text": [
            "Works brilliant good picture quality and easy to use",
            "I'm an IT specialist by trade & am suitably impressed not only with this smartphone, but with TCL as a manufacturer in general. After extensive research I decided to purchase this 'lite' version of the TCL 10 mobile phone as it is of very high specification & 'punches well above it's weight' when compared to more expensive alternatives from the established electronics companies. I received an android 11 system update within 12 hours of activation, making the UI state of the art. buy this phone!",
            "The phone itself is great value for money, fast enough for the price and a nice screen.",
            "Really pleased with the purchase so far as I was switching from an i-phone and found the process seamless. Great that it has the latest operating system.  Would definitely recommend it for the price and features for somebody who is not a heavy user",
            "Very good phone doesn't run slow for the price it's excellent",
            "Price is a bit high for this phone. Battery is not lasting long. Good service from Argos.",
            "Really good phone \nWorth the money",
            "great phone, grwat price",
            "Great spec and easy to use.",
            "The battery life is good, the quick charge feature is really helpful. I bought this for its amazing storage and duel SIM.",
            "Great phone works brilliant love the phone",
            "This is a great budget phone for price. Storage and r excellent. TCL an upcoming brand that gives great value for your money. Screen not Smoked but very bright. Takes lovely pictures and Android system for loads of apps. Good camera build and comes with case. Dual SIM and mini DD card can be used. 5 stars as does everything well for this upcoming brand.",
            "Nice looking and nice size phone, screen quality seems very good as does camera, also bonus you get free clear case and has screen protector already applied.",
            "A really nice phone with many inbuilt features like 4K video and High Definition photography with its five lenses including close up macro and panoramic wide view all in great quality.\nIt has access to all the usual apps in store and comes with a protective gel backing and a screen protector already installed. I purchased a fau leather wallet style fau leather case very cheaply from elsewhere. It makes a great little stand when watching tv on the phone. Easily worth five stars!",
            "Very nice phone according to price.looks great.good battery",
            "The best smartphone ever, best balance between quality-price",
            "Would recommend to anyone great value",
            "Good product, I like it.",
            "the mobile i ordered is for a presant the look and design looks great and will be a great phone to use",
            "Very good specification, briliant camera.Nice design.",
            "Great product slim line lightweight, nice colour, large screen, also a protector came with it which was a nice bonus.",
            "Great phone for low price",
            "Great and affordable phone, lots of storage and good screen size. Would recommend",
            "This mobile phone ✅s all the boxes of any top of the range latest mobile phone,with pristine camera quality.Excellent amount of internal storage.Battery life which lasts for some time compared to some other mobile devices batteries.It even came with a free silicone protective case which I didn't realise was included.Prone to drop my phone and damage the screens&/or just bad experiences with short battery life.I can honestly say I'm 100% happy with this product",
            "Very premium looking for this price range recomended",
            "The price-value ratio is very good. There are two small mistakes, but they are perfect for so much money.",
            "Lovely looking phone, does everything you need, but, it's battery life is very poor.",
            "I have had Motorola phones for many years, but after reading reviews on this TCL 10L I thought I would give it a go, and blimey this is an awesome phone for the price, brilliant camera and super fast operations on the phone, and a fingerprint reader that works brilliantly, if you need a great value phone then look no further, the only downside is not a vast supply of phone cases for this phone, but I found some on Amazon. I loved this phone so much I purchased one for my wife also.",
            "Phone that is fast easy to use and ready out the box, it's only a hybrid SIM card tray\n but if you like that kind of thing it's fine",
            "Music has no other sound effects or enhancement features even when use sound go very low compare to other budget phone its not very good pretty disappointing very limited options. In regards to battery it would not last long so pretty much charge it every day even in minimum use.",
            "Easy to use mobile with easy set up and some great features/apps",
            "This phone is easy to use and has a longer lasting battery , faster and brilliant phone.",
            "honestly for the price it's great cheap and works better than more expensive phones highly recommend great amount of ram quad camera , holepunch front camera very thin edge and the top speaker is places nicely for your ear highly recommend if you want a good phone that runs well for a low price",
            "Great for the price.i was hoping for a better battery",
            "This phone is very good, camera is brilliant and enough space when it comes to memory, it also perform well.\nWould definitely recommend.",
            "Great design and finishing touches are great blend for this device. Took my heart already.",
            "Great phone..great price...great product good suport from tcl",
            "This is a nice phone bright screen, has two sim ports so personal and work kept separate, 4G on both Sims has a full range of sensors including magnetic compass Glonass and NFC, has Bluetooth 5 connects to all my Bluetooth speakers and head phones no problem regardless of make.Screen is smooth no stutter comes with protector installed and silicone cover, fast charge capability too. Battery is really good lasts all day running delivery app which is very power hungry, it's a good all rounder.",
            "I love this phone came with protecter an case it has 4 cameras an 2 flash's I would recommend the price is great to",
            "Bought this after reading reviews and glad I did because it's a great phone and good specs like smart button on side but be wary because as soon as you turn in it updates and takes this feature away.According to TCL Google wants it that way",
            "First look, wow, its amazing. For thats price the best. Batery life its akceptable, two days normali works.",
            "Price excelent\nStyle excelent\nI am so happy",
            "After using the phone for nearly two weeks now for a budget phone it is one of the best out there",
            "Was reluctant to buy this as the brand isn't well known but it turns out to be an excellent phone, really fast and battery lasts 2 days. even comes with a screen protector already on.\nVery pleased, would definitely recommend.",
            "I love the look of this phone. It's the best phone I've had I love how responsive it is. It's a lot better than my honour 10. Can see me keeping this phone for a long time and I doubt I'll have any problems with this phone love it",
            "Great product. Thank you",
            "This phone is awesome great screen fantastic battery life brilliant design you get everything you could want at a verily low price..thank you Argos."
        ]
    }
}