{
    "419/2598": {
        "remotekey": [
            "419/2598"
        ],
        "item_category": [
            "Aznu is a new way of buying that premium branded phone you always wanted, but at a much more pocket-friendly price. With Aznu, you get a refurbished phone with the same camera, features and processor, plus a brand-new screen and a 12-month warranty. You also have the knowledge that buying Aznu helps reduce landfill and waste. We include a Sim tool so it's easy to pop your old card in, a year's worth of Norton 360 VPN Virus and Spam protection, and a cable and charger so it's ready to go! If it looks like new, it must be Aznu. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "9 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "4 May 2021",
            "12 March 2021",
            "10 March 2021",
            "6 March 2021",
            "20 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 December 2020"
        ],
        "review_title": [
            "The product heats up and uncomfortable to use",
            "The phone is amazing good battery life design ect",
            "Good mobile",
            "Wife's new phone",
            "Delighted with my new phone!",
            "Brought it for my husband, for Christmas he loved",
            "Brilliant picture easy to used very fast",
            "Samsung s8 64 gb",
            "Looks great"
        ],
        "review_text": [
            "Fully charged the product before use, but heats up and becomes uncomfortable against the ear.",
            "Really good phone amazing packaging design and fast phone",
            "A good mobile purchased for someone else. They love it as its there first smart phone",
            "My wife is very happy with her mobile, it looks and feels new and is exactly as promised. The technology upgrade from her old phone is what she wanted at a price that suited us.",
            "Excellent service firstly with advice from Argos representative during phone enquiry and follow up service resulting in speedy delivery of phone.",
            "Smart looking phone, made an amazing Christmas present",
            "I recommended this phone as one of Samsung best creation, and a low budget buy this phone, excellent",
            "Great phone great price",
            "Great item, well worth the money, would highly recommend"
        ]
    }
}