{
    "869/7570": {
        "remotekey": [
            "869/7570"
        ],
        "item_category": [
            "The Reno4 Z is an affordable 5G premium smartphone with a super smooth 120Hz FHD+ display. A 48MP quad rear camera for every occasion and a dual selfie camera for flawless selfies. "
        ],
        "summary_star_rating": [
            "4.1"
        ],
        "no_reviews": [
            "20 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "70%"
        ],
        "review_rating": [
            "3",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "4",
            "3"
        ],
        "review_date": [
            "30 July 2021",
            "21 July 2021",
            "16 June 2021",
            "4 May 2021",
            "21 April 2021",
            "17 April 2021",
            "15 April 2021",
            "14 April 2021",
            "7 April 2021",
            "1 April 2021",
            "31 March 2021",
            "9 March 2021",
            "9 March 2021",
            "16 February 2021",
            "16 February 2021",
            "15 February 2021",
            "19 January 2021",
            "12 January 2021",
            "5 January 2021",
            "1 January 2021"
        ],
        "review_title": [
            "This is a good phone",
            "Good fone",
            "Definitely recommend",
            "Battery is even 45000m but doesn't give full day .",
            "Phone",
            "Smart looking phone with nice features",
            "Really excellent smartphone with 5G",
            "Value for money",
            "Great phone",
            "OPPO PHONE 5G",
            "Great phone for the price!",
            "Great looking budget phone",
            "This phone is very good and the battery life is gr",
            "Beautiful Phone that works well",
            "Lagging n freezing!!",
            "Good phone",
            "Good",
            "Very easy to use, smooth operation!  A great phone",
            "",
            "Phone keeps freezing within just days of using"
        ],
        "review_text": [
            "I love this phone good camera good internet speed . .same time got few issue.bettry don't last long . When I am use WhatsApp and same one give me this phone lost internet data .",
            "Not quite a Samsung and a few things I don't like, the calendar doesn't have enough categories/colours for appointments etc. The battery does last although not quite 2 days. Setting up was a bit tricky not everything transferred straight away as there was an update part way through.  A few Tweeks and it would be a great fone.",
            "Great camera and other features well worth the money.  Very happy with my purchase, recommend to me by a family member.",
            "Battery is even 45000m but doesn't give full day .",
            "Its very good phone very happy with it",
            "Fantastic clear camera that takes clear cut pictures. Easy to set up and good spec for the price.",
            "This is a feature packed and brilliant phone. It's got a generous 128GB storage capacity and runs very smoothly.\n\nScreen quality is top notch as it's got a 120hz refresh rate which is unique at this price point. There are devices which cost £100.00 more which don't feature this.  The device also has the all important 5G capability. I am lucky enough to be in area where 5G has been rolled out and it runs well on 5G. Call and voice quality are excellent. The audio output on this is also high .",
            "Best camera, very large internal storage, large screen, fast and value for money.",
            "Have had this phone now for a month. Works really well. Battery life is good, lasts about two days. I would recommend it to others.",
            "Hi Team, I was very much excited unboxing OPPO 5G phone, but when literally using the phone I was totally unhappy because the wasn't technically sound and considering the fact that it is a 5G phone 4000mah battery was no way good.  Pros.: 1) The storage memory good enough, 2) The processor RAM is good. Within few days I had returned this phone.",
            "I find Oppo phones great for the price. This model is probably my favourite - great battery, love the fingerprint scanner built into the power button on the side!",
            "Fantastic quality phone for the price, runs really smoothly and enjoying the 128gb of storage space. \nThe colour of the phone is so unique and the sides are slightly champagne gold in certain lights. \nThey even give you a free clear case in the box!",
            "I am very happy with this mobile phone. The Oppo phone is very similar to Samsung but what makes it better is the battery. I hardly have to charge mine.",
            "I have the white version of this phone. It is beautiful and looks almost gold under some lights. It is very fast and does everything I want it to do - make calls, send texts, check emails and surf the net. I am not into social media. I hadn't heard of this make before but had an honor previously. This phone does not come with loads of bloatware - it is simplistic and I would recommend. Bought a lovely neoprene case from elsewhere for it which is also beautiful.",
            "The phone was lagging all the time.. Probably a software issue with the phone itself or a dodgy batch.. Took it back after 3 days didn't Ave a replacement. Put me off the brand..",
            "It is a good phone that has all the features and was easy to set up. Battery isn't as good as some other phones.",
            "Good but cheap quality",
            "Very easy to use, smooth operation!  A great phone",
            "Display quality below expectation",
            "Phone takes brilliant photos but will be having to take it back as the phone screen is freezing numerous times throughout the day and ice only had it a week!"
        ]
    }
}