{
    "847/0553": {
        "remotekey": [
            "847/0553"
        ],
        "item_category": [
            "iPhone 12 pushes everything forward with superfast 5G. A14 Bionic, the fastest chip in a smartphone. A new dual-camera system. And a beautiful Super Retina XDR display, so you can see everything in vivid detail. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "135 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "99%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "5 July 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "9 June 2021",
            "9 June 2021",
            "9 June 2021",
            "9 June 2021",
            "9 June 2021",
            "8 June 2021",
            "2 June 2021",
            "2 June 2021",
            "2 June 2021",
            "2 June 2021",
            "20 May 2021",
            "20 May 2021",
            "19 May 2021",
            "19 May 2021",
            "5 May 2021",
            "5 May 2021",
            "5 May 2021",
            "4 May 2021",
            "4 May 2021",
            "4 May 2021",
            "4 May 2021",
            "28 April 2021",
            "28 April 2021",
            "27 April 2021",
            "21 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "20 April 2021",
            "20 April 2021",
            "14 April 2021",
            "13 April 2021",
            "13 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "6 April 2021",
            "31 March 2021",
            "31 March 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "17 March 2021",
            "16 March 2021",
            "10 March 2021",
            "10 March 2021",
            "9 March 2021",
            "9 March 2021",
            "4 March 2021",
            "4 March 2021",
            "2 March 2021",
            "25 February 2021",
            "24 February 2021",
            "23 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "10 February 2021",
            "9 February 2021",
            "3 February 2021",
            "2 February 2021",
            "2 February 2021",
            "27 January 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "22 January 2021",
            "20 January 2021",
            "19 January 2021",
            "14 January 2021",
            "13 January 2021",
            "13 January 2021",
            "12 January 2021",
            "12 January 2021",
            "6 January 2021",
            "6 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "4 January 2021",
            "3 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "5 December 2020",
            "3 December 2020",
            "2 December 2020",
            "2 December 2020",
            "1 December 2020",
            "1 December 2020",
            "1 December 2020",
            "25 November 2020",
            "19 November 2020",
            "18 November 2020",
            "18 November 2020",
            "18 November 2020",
            "17 November 2020",
            "17 November 2020",
            "17 November 2020",
            "17 November 2020",
            "17 November 2020",
            "11 November 2020",
            "10 November 2020",
            "10 November 2020"
        ],
        "review_title": [
            "Perfect phone",
            "Definitely worth the upgrade",
            "Amazing",
            "Great",
            "Perfect product",
            "Just what you would expect from Apple!",
            "Very happy with the purchase!",
            "iPhone 12",
            "Great phone",
            "Great Features.",
            "Great Box",
            "Amazing!",
            "iPhone 12 all good",
            "Excellent as allways",
            "No power adapter included but amazing phone",
            "Great phone!!",
            "Great phone!",
            "Great phone",
            "It fantastic product",
            "Apple and Argos - excellent",
            "Nice phone",
            "Love it",
            "Worth it",
            "Great as expected",
            "The phone is exactly what I expected",
            "Love my new iPhone 12",
            "Bought it for my daughter, it's amazing phone.",
            "This Phone Oozes Quality",
            "Great fast phone excellent camera holds its charge",
            "",
            "Fantastic iPhone",
            "The iphone I bought is very good",
            "iPhone 12",
            "This mobile very clear picture and very good netwo",
            "It’s worth it",
            "The phone is amazing",
            "It’s excellent",
            "Well pleased",
            "Nice phone",
            "Amazing!",
            "The best",
            "Lovely phone",
            "My daughter loves her new phone",
            "My phone, badly needed, perfect for what I wanted!",
            "Great phone",
            "Really happy with the phone",
            "Fantastic",
            "Good phone v quick",
            "Fabulous",
            "My new iPhone is gives nice pictures .",
            "My I phone 12 is excellent.",
            "Good photo quality, long lasting battery",
            "",
            "I like it and excellent for my work",
            "Wicked upgrade.",
            "This iPhone looks great and has a good camera",
            "Excellent service",
            "10/10",
            "iPhone",
            "Excellent iphone",
            "Nice and sleek and perfect for your hands",
            "Great phone",
            "iPhone 12",
            "Excellent iPhone",
            "authentic and excellent quality!",
            "Fantastic product",
            "Easy like Saturday morning",
            "great",
            "most beautiful phone",
            "Excellent phone",
            "Terrible customer service to be honest",
            "Great new phone",
            "New phone is class love it",
            "Iphone 12",
            "iPhone",
            "The screen is amazing",
            "Best iPhone Yet",
            "The phone is perfect",
            "My phone is very good. Would definitely recommend.",
            "Great phone love the colourer",
            "I have brought lots of house all items executive",
            "Great phone",
            "iPhone 11",
            "Amazing same day delivery i loved it awesome",
            "Great phone",
            "",
            "iPhone 12 Blue",
            "",
            "Mobile phone is exactly what it says and great",
            "Nice design",
            "It’s so beautiful",
            "Great but to expensive",
            "Great Xmas present",
            "",
            "Fantastic",
            "Excellent but come on",
            "It's looks nice and works good.",
            "It’s perfect",
            "The phone is great what I wanted",
            "Great product",
            "Iphone12 64 GB",
            "Excellent",
            "Easy to buy with click and collect.",
            "My new phone is amazing",
            "Great",
            "Fab phone",
            "Very smart phone",
            "Brilliant iPhone 12",
            "My new iPhone 12 is a perfect upgrade !",
            "Another great Apple phone!",
            "Wow love my new phone",
            "I am happy to buy this",
            "",
            "iphone 12 is so much faster",
            "My phone works perfectly",
            "The blue colour looks different and nice",
            "Excellent",
            "Beautiful new design iPhone",
            "It’s an iPhone",
            "Present",
            "iPhone 12",
            "Excellent",
            "Love this product",
            "Superb",
            "Great phone",
            "Love the colour as well as features",
            "Perfect",
            "My iPhone is tej best",
            "Iphone 12 as with all Apple products great.",
            "products is great, but nectar points are not loade",
            "Iphone 12",
            "Looks fab gorg colour",
            "It’s perfect",
            "iPhone 12 is all hype I’m afraid.",
            "Latest iPhone with higher specs"
        ],
        "review_text": [
            "As well now IPhone are one of the best products on market I would recommend to anyone who needs a new phone",
            "Got this last month, been long overdue an upgrade for the last 2 years and so glad I got it!",
            "My daughter bought this phone 2-3 weeks ago, I’d purchased the same phone in blue 2 days before the purple came out I was gutted. Great features, easy to use & set up. Wouldn’t purchase anything different then an iPhone. Recommend to everyone.",
            "I bought it recently and it’s great but doesn’t have a charger",
            "I can for sure recomend to buy from Argos, the phone works perfectly, thank you so much!",
            "I bought this iPhone 6 weeks ago and it took a while to get used to not having a back button like I did on my iPhone 8 Plus. I’m still finding my way round the camera. The only thing I have noticed so far is that the zoom is less than the iPhone 8 Plus.I like the Face ID feature and longer screen.I haven’t noticed any difference in the battery performance from the iPhone 8 plus.",
            "Love the quality of camera, plus 5G, the speed is great, very happy with what I brought",
            "I bought this product a month ago due to my last phone breaking and so far I know this product was a great option from myself due to the high quality state it is in and everything is in working order. I am so happy with my purchase I definitely recommend anybody to buy this product from Argos",
            "Does everything an Apple phone should, seemless  change from previous phone and justvas easy to use.",
            "I am over the moon with my \niPhone 12. It didn't take long to get it set up and I was using it the same night.",
            "Will be getting this for my birthday in July so the box isn’t open yet … but so far so good !",
            "I am glad that I was able to buy an IPhone 12 from Argos as the price was a bit better than in Apple Store! Moreover, I received a lot of Nectar points. Overall, great phone and great price. Thank you Argos!",
            "I reserved online and collected same day. All very straight forward with no problems. The phone is great, all working perfectly. Not much to say really as anyone that owns an iPhone will know they don’t really change massively between the models when you’re moving up to the next one that comes out as I did",
            "Just upgraded from my 6SE love the camera",
            "No power adapter included but amazing phone",
            "Always buy iPhones. .",
            "A great upgrade from my iphone xs max, fast and great camera",
            "An excellent upgrade over the iPhone XR, camera is great and the purple is fantastic!",
            "I bought two weeks ago I am happy with my iPhone 12 and thanks Argos great costumer service",
            "Hi great product and excellent service from Argos.",
            "My favourite phone love is",
            "Ordered it and few hours later it arrived. Very happy",
            "Excellent product bought for my daughter no complaints perfect working order... all components there nothing missing or tampered with brand new you can't be too careful..  excellent service overall real satisfied with the experience",
            "Bought this for my husband and he loves it! It’s definitely better than it’s predecessors!",
            "The purchase of the item was simple, quick and  organised.",
            "I love my new iPhone",
            "Great product, good price, I'm very happy with the phone.",
            "What a Great Phone, Typical Apple Quality with a screen just the right size.\nYou know what you’re getting with this Phone.",
            "What you expect from Apple - brilliant!",
            "Very good Argos shop",
            "Great iPhone after switching from a Samsung. Would deffo recommend",
            "Its a great phone and i enjoy using it .",
            "Fantastic phone So glad I went for the iPhone 12",
            "Very excellent phone, clearly taken pictures and vedios",
            "I love this phone, I can do loads with specially since my laptop isn’t working. Very professional phone!\n\nBuy it don’t hesitate, I just found it difficult to choose a colour, I ended up choosing blue however I reckon go for something you don’t usually go for!",
            "Excellent phone. My third iPhone already and cant be more pleased with the purchase.",
            "The best and fast service I loved my first experience with Argos.",
            "Absolutely love it! Best phone I’ve had camera is amazing!",
            "Good phone , easy to use with face recognition. Easy to move from screen to screen with swipe up . Takes good photos.",
            "I love this phone. It’s smart, a decent size (without being too big) and is certainly an upgrade from my previous iPhone. I have the blue colour which I think looks really smart. \n\nThe only bad thing about it is the lack of charger. This phone comes with a USB-C cable which I didn’t have a brick for. It’s a shame because you’d expect it to be included given the price tag for the phone!",
            "Great build quality, camera and battery life. IOS 14 is a dream. Faultless. Best iPhone I’ve ever used. Highly recommend.",
            "I’m very happy with my new phone it’s excellent",
            "My daughter has no faults really with it except that it doesn't come with a charger so before you buy it make sure you have a charger that fits it before hand. The camera is amazing and sound quality is great worth buying I would say and my daughter would say",
            "Comes exactly as pictured and described! Perfect!",
            "Great phone but too expensive",
            "Very happy with my new phone. It was very easy to set up and has loads of great features.",
            "Changed from iPhone 7plus what a difference this phone is brilliant just need to get used to all the new stuff on it pictures are great colour blue very nice will recommend this phone to anyone bought from Argos with 6 months to pay on my Argos card",
            "Fast phone. Good upgrade from my old one",
            "So easy to get up and running.",
            "I’m definitely happy with this new phone.",
            "Ordered from my local Argos store and phone arrived following day exactly on the time stated, easy collection well set up and organised and made you feel very safe. Well done Argos 10/10. The I phone 12 is absolutely brilliant running rings around my old I Phone 8. I would recommend this excellent phone to anyone.",
            "Very good battery life lasts up to 2/3 days, amazing photo quality",
            "Very good purchase,  im love it",
            "I bought from Argos and it was good and quick   Within 24 hours I got  no it. Easy to use",
            "If you've owned an IPhone before then like me you'll love it. All the usual features with a few upgrades. The camera is amazing. If you've never owned an iPhone. You will lose it over how good this phone really is. One bad thing they don't supply a plug for the charging cable, bit strange but will use your old one so all good.",
            "This iPhone is better than any phone I have had before and definitely recommend it to others. As it has great camera quality as well as it’s really fast and good looking. This is a really great product!!!",
            "Excellent phone would recommend",
            "10/10 amazing phone. Really quick service from Argos so so happy. Glad i didn’t go to network providers or other phone retailers. Can’t recommend enough! Amazing!!!",
            "It does exactly what it say on the description and a hole lot more.",
            "Easy to use very fast great photos",
            "The price of the iphone12 is not bad for a free sim phone,the only down fall is the iphone12 doesnt come with apple plug",
            "It is a great phone good battery life and the design looks good. Would recommend",
            "Just great phone quick easy click and collect service",
            "This latest model has many improvements, including camera and battery life.",
            "The product was 100% authentic and it was exactly as it was advertised! Very good qualityz",
            "I highly recommend this product.",
            "Easy phone purchase without any of the usual‘up selling’ associated with the High Street Phone Shops.. thanks",
            "great price and fast",
            "best phone on the market",
            "Great size, not too big. Screen size is perfect for watching films on.",
            "Good phone but there was an issue so needed to return. Argos customer service is terrible. \n\nWas unable to return the phone for an obvious safety fault, and they did not want to accept the device even though it was 1 day. \n\nThere was no complaints telephone to call, and the store was not covid safe at all.",
            "Apple I phone as expected. Still getting to grips with everything. Pleased so far.",
            "Very quick and easy to place my order. It was available for collection same day . Very very happy",
            "Very good phone, happy with it",
            "Love the iPhone 12, bigger screen and better security such as Face ID, very light and love the camera, and it’s really easy to use.",
            "Moved up from a XS to the 12, instantly you can see the screen has a greater look tonit",
            "The iPhone 12 is by far the best iPhone ever released. It is much nicer to use than the iPhone 11 Pro I previously had. My only complaint would the lack of included headphones or a power socket as the included Lightning Cable has a USB-C connector and most people do not have the compatible power adapter. \n\nBuild quality seems to be better than any previous iPhone.",
            "I was so pleased with the purchased and I recommended to use argos online and also to use the pick up delivery from your nearest store it was quick and well managed",
            "This is the best phone I have ever used. It wasn’t cheap but very good. I would 100% recommend.",
            "Can not fault the phone friends like it to does as it says brilliant phone",
            "Price and great service...",
            "I love my new iPhone it’s got a big screen and is easy to use",
            "Beautiful iphone 11 works perfect",
            "Amazing same day delivery i loved it awesome service",
            "iPhone 12 is a great phone, especially coming from a 1st gen SE. Recommend.",
            "High Quality and superfast",
            "Another amazing product from Apple, and with Argos click and collect amazing service! Always have good things to say about Argos especially their same day delivery! Can’t go wrong.",
            "Lovely phone good battery",
            "excellent and awesome",
            "Fantastic, durable \nThe service was great \nThe delivery was on time \nYour website is easy to use",
            "We love this product and thanks to Argos",
            "Got this for my Daughter and nothing else will do. I prefer Samsung but that is me. Previous iPhone have been great but concern about the glass.",
            "Great Xmas present for my girlfriend which absolutely loves the colour and the way the phone operates which is very fast",
            "Argos built my confidence after this purchase",
            "Lovly phones pleased with it",
            "My son loves it. My downgraded star is the fact u have to buy a plug and earphones. You would have thought for the price they would be included",
            "It's looks very nice & worth of money.",
            "I’m so happy with my purchase",
            "Great what I wanted just ordered online collected next day so easy",
            "This phone is superb, it is so fast compared to my 6s. Every app that you use opens fast and there is no buffering when using any app. Will be even better when 5G is available in my area. Really love the blue colour.",
            "Great phone and delivered on time by Argos",
            "Excellent it's a good case",
            "So easy, picked it up from Sainsbury’s within 24hrs, love it !",
            "My new phone is exactly what I was looking for, the designs is similar with iPhone 5 but his iPhone 12 is fab with his camera. I love to do pictures with this iPhone",
            "As you would expect from the latest iPhone",
            "Fab phone . Nice upgrade . Would recommend",
            "Bought for my daughter for christmas very happy with it",
            "This is the first blue iPhone I have had . It’s a lovely colour. \nPhotos are amazing compared to the iPhone 8. Faster response time.",
            "I am very pleased with my new iPhone 12 . It is the perfect upgrade from my previous phone and it completely satisfies all my needs .",
            "Lovely phone. Looks and feels great. Camera is amazing compared to older models. Another superb Apple device!",
            "I got this iPhone 12 for Christmas from my lovely family I used to have a iPhone X but now I have 12 I am happy with the quality and the photo quality definitely would recommend to anyone looking to upgrade really good iPhone",
            "I m happy to buy this phone \nLong battery life \nVery fast charging",
            "Bought for Granson he loves it it does lots of different things then is old one did",
            "phone is amazing would recommend",
            "The price of the phone is affordable \nThe phone is working perfectly \nI can re buy for my mum.",
            "Looking very beautiful and nice",
            "Not a huge upgrade from the iPhone 11 but gets 5g , much powerful processor and ios14. Very happy with the phone",
            "Apple new iPhone design is fantastic they needed to give their phone a fresh new look and the have done it well as always, great powerful phone",
            "It’s an iPhone and it’s green. Not much more to say really.",
            "I bought this for my daughters Christmas so not opened yet but I'm sure she will love it .",
            "Great upgrade from my iPhone 6 only had it 2 weeks but seems good",
            "Excellent payed online and picked up same day",
            "This is an amazing product, really satisfied",
            "Upgraded from an iPhone 7 and haven’t looked back. Battery life is amazing, I can get 2 days out of it with quite frequent use. Camera and display are great.",
            "Great new phone. Excellent battery life.",
            "Prompt & efficient order & delivery.",
            "Does everything and works perfectly couldnt ask for any better",
            "Perfect camera, long life battery",
            "Iphone 12 as with all Apple products great. \nDesign is great. Choice of colours is good.\nPrice i think is set by apple as it was same price with several suppliers",
            "great product and quick delivery, but my nectar points are not issued yet, can you please release the points?",
            "Excellent phone learning how to work it, first iphone user",
            "Beautiful phone daughter loves it",
            "Camera is great features are great size is grest",
            "Not very impressed with the iPhone 12. It seems like you are getting a lot less in materials and physical substance for the money.\n I’ve already sold it to someone else.\nI’m happy sticking with my sturdy XR until someone makes a more robust device.",
            "Better specs than last years model. Amazing screen and features."
        ]
    }
}