{
    "944/8285": {
        "remotekey": [
            "944/8285"
        ],
        "item_category": [
            "Superfast 5G and Full HD+ screen lets you power through your work. Nokia X10's 48MP quad camera with ZEISS Optics will capture all that's important to you and the pro colour-grading tools will help you present your ideas with serious oomph. The 100% compostable case, designed to be hard on the ground and soft on the Earth, is included for additional protection. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "7 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "2 August 2021",
            "1 August 2021",
            "1 August 2021",
            "30 July 2021",
            "30 July 2021",
            "29 July 2021",
            "27 July 2021"
        ],
        "review_title": [
            "Great phone for a great price",
            "Great product from Nokia",
            "Great Smart phone",
            "Great phone!!!",
            "Solid phone",
            "Nokia X10 gives outstanding Value",
            "Outstanding Nokia Smartphone"
        ],
        "review_text": [
            "The Nokia X10 is a nice size phone, it's big enough that I don't need to reach for my tablet all the time and has a big clear screen. I got it in a lovely dark green colour which I love. The camera is very good with nice features to make my photos even better. It's pretty fast for normal internet use and has enough storage for all that I need. It comes with a cable to charge but not the plug. The case that it comes with is compostable as is the packaging which I think is an added bonus. I haven't had a Nokia phone since the late 90's but I'm converted. Great phone for a great price.",
            "Nice weight phone to hold.  Has all the latest features including 5G.\nCamera lays flat on back of phone and takes fantastic photos which look great on the large screen.\nDual sim or 1 sim and Sd card facility.  Also comes with 3 years of Android Updates.\nHas compostable case and glass screen protector fitted, no\ncharger plug, to be environmentally friendly.\nFavourite feature, very easy to change fontsize.",
            "Easy to use smart phone with a good size screen.  It doesn't come with a plug which is sensible as most people have loads of plugs. It also comes with an e case. The battery is very long lasting which is a massive benefit. There is no actual proper manual but it is straightforward to work out how to use it. However you can download a manual from the internet if needed.  This is my first Nokia and although i was initially worried about the lack of a physical home button I have quickly adapted to it. All in all I am very happy with the phone and would highly recommend it.",
            "Bought phone few weeks ago and it's a brilliant phone",
            "Reliable,does what it says on the tin,great battery,can't complain",
            "What a Phone, very easy and intuitive to operate. Feels good to hold in hand, Great 6.67\" screen is easy on the eye, with clear and sharp colours. Amazing camera with several photo settings to provide you with excellent pics. The phone does not come with a charger block and comes with a compostable case, this is in line with Nokia's policy to protect the environment. Enclosed with the phone is a USB -C cable to charge the phone using many USB charging facilities around the home. Memory should be no problem but can be added to using a Micro SD card.",
            "Very happy with this Nokia X10 Smartphone, With it's latest Android 11 OS, The best feature I like is the main rear Zeiss optical camera with the various \n photo settings and it's superb 6.67\" screen display. Pin or fingerprint can be used to open the phone and feels very light in the hand, No charger supplied which helps the environment as most people have several charger's lying around, With plenty of memory and you can add an micro SD card should you require more space. Overall an outstanding mobile phone for personal or business use."
        ]
    }
}