{
    "930/3148": {
        "remotekey": [
            "930/3148"
        ],
        "item_category": [
            "With its nearly borderless design, the phone can retain the same body size as a 5.5-inch phone, making for an easier grip. The 19.5:9 aspect ratio and enhanced visual quality show more details and offer a better cinematic experience. The 48MP main camera let's you capture every last detail. You can even take expressive portraits with beautiful bokeh aesthetic thanks to its 2MP depth-assist camera. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "96 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "98%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "4"
        ],
        "review_date": [
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "12 February 2021",
            "9 February 2021",
            "9 February 2021",
            "3 February 2021",
            "3 February 2021",
            "2 February 2021",
            "2 February 2021",
            "2 February 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "21 January 2021",
            "21 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "18 January 2021",
            "14 January 2021",
            "14 January 2021",
            "13 January 2021",
            "13 January 2021",
            "13 January 2021",
            "13 January 2021",
            "13 January 2021",
            "12 January 2021",
            "6 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "2 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "6 December 2020",
            "2 December 2020",
            "1 December 2020",
            "1 December 2020",
            "1 December 2020",
            "1 December 2020",
            "1 December 2020",
            "26 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "21 November 2020",
            "18 November 2020",
            "17 November 2020",
            "17 November 2020",
            "10 November 2020",
            "4 November 2020",
            "29 October 2020",
            "27 October 2020",
            "23 October 2020",
            "21 October 2020",
            "21 October 2020",
            "14 October 2020",
            "7 October 2020",
            "7 October 2020",
            "7 October 2020",
            "3 October 2020",
            "23 September 2020",
            "23 September 2020",
            "17 September 2020",
            "17 September 2020",
            "16 September 2020",
            "9 September 2020",
            "9 September 2020",
            "3 September 2020",
            "2 September 2020",
            "1 September 2020",
            "25 August 2020",
            "19 August 2020",
            "17 August 2020",
            "12 August 2020"
        ],
        "review_title": [
            "Perfect phone",
            "excellent Smart Phono - great camera for the price",
            "Great phone",
            "My Honor 9x lite",
            "Very good value for money.",
            "",
            "Not very wow.",
            "",
            "",
            "This is nice and simple for this cost",
            "The price is fine",
            "my daughters 18th Birthday present",
            "My phone looks brilliant and works amazing",
            "Loving the new phone. Camera is superb.",
            "Wonderful stuff",
            "Fabulous for the price",
            "Good value",
            "Absolute great phone",
            "Easy to use",
            "Phone brilliant for the price does everything u co",
            "",
            "It's fantastic,great camera",
            "Excellent!!",
            "Great phone for the money",
            "Great phone.",
            "Easy to set up and use",
            "Good value dual SIM phone",
            "My phone is sleek and performance is superb",
            "Very good",
            "HONOR 9X",
            "The phone is cheap and the quality is good.",
            "Perfect",
            "Great looking phone.",
            "",
            "",
            "Was very good",
            "xmas presents for daughter and grandaughter",
            "Nice Product",
            "honor 9x lite",
            "It was s gift for my friend",
            "Does everything I wanted it to and more",
            "Excellent",
            "It is real value for the money",
            "Phone is so good and the size",
            "Very good phone",
            "Brilliant Phone Well Worth The Price",
            "My phone is really good and looks good!",
            "Nice phone, perfect size",
            "It's good price and smart as well",
            "Good phone",
            "Great phone with excellent camera",
            "Brilliant phone for the money",
            "The phone is everything as expected my partner it.",
            "Fab budget phone",
            "Amazing phone with an amazing colour",
            "Honor phone",
            "",
            "Budget Blower",
            "Works well good battery life",
            "",
            "",
            "Great budget smart phone",
            "Looks good and works well",
            "My new phone is brilliant",
            "Fab phone love the big screen battery life is fant",
            "I am very happy with the phone",
            "great phone",
            "Great design and a perfect Christmas gift",
            "Nice looking phone",
            "Brilliant performance. High quality camera.",
            "brill phone",
            "Great Phone",
            "A nice phone",
            "Excellent phone",
            "the phone look great",
            "Great phone has no faults what so ever",
            "Fab phone",
            "Great Phone, Looks great ! Battery Life is superb,",
            "Excellent value for money",
            "Works Great",
            "Lovely Phone",
            "Brilliant",
            "",
            "Smart Phone",
            "Love it",
            "Nice phone",
            "Seems a great phone so far for the price",
            "It better than my I phone",
            "Excellent",
            "Great phone for the money.",
            "My kettle looks fab and boils fast",
            "Good little cheap phone",
            "Good phone for the money",
            "Good phone great price",
            "The charger is way to slow for the phone to charge",
            "It's a good phone and it's very easy to use"
        ],
        "review_text": [
            "Getting on well with this Honor phone & finding it easy to use",
            "I pay on line ,,made it simple for going to your shop for correction, the system for correction \nchanges when you do it this way,,, you avoid waiting to pay in store,,.\nAt the moment the system for correction as change with COVID 19",
            "It's fast and does everything I need it to do!",
            "Great service as usual. Love our Honor and Huawei phones. We have about 10 in the family. Found to be great value for money with high specs, why buy anything else. Easy to set up with phone clone and am able to do anything and everything that you can do on any other android phone. Just maje sure it is an Android phone and it has Google play store, some of the new one's have Huawei's own operating system.",
            "Also, battery charge seems to last for nearly 3 days, depending on usage of course. I am quite happy with my purchase.",
            "Good phone for the money",
            "Good standard phone, but saying 48mp camera and after taking pic on 48mp you laugh \nThis is my secondary phone for business use, you can take a pic make calls answer calls and pretty much do everything with this phone. \nDual sim is great  and simple to use.\nP.s Battery life is good too considering on long calls its best.",
            "This phone is good quilty",
            "I am happy with my purchase, it's a great item. Thank you.",
            "Cost effective, reliable and nice design",
            "This working very well and I am happy",
            "Purchases for our daughters 18th Birthday, She absolutely loves it, enough phone memory to last for a few years too.",
            "This phone is brilliant and dose exactly what it says it dose. it looks great! so happy with it. Worth every penni.",
            "Bigger than my last Honor phone. Has a much sharper Camera image and four times the storage. Also has a speak / type capability making messaging much easier.",
            "Worth the price large 128 GB",
            "Very good for the price",
            "Good value for money. Works quicker than my partners iPhone. Good camera and quick system. Screen is big which is good for movies etc. Really happy with my purchase.",
            "Absolute great phone this is would definitely recommend to anyone",
            "Was a great phone until it completely went wrong after 6 days. Had a bit of an issue with the product going up in price since it was bought(within the 30 days) to replace with same product without paying the extra, got round this eventually.",
            "Nice phone does everything u need good size and looking phone",
            "Wonderful phone, super easy to use for anybody in a different age group, you don’t have to be smart to use this phone the phone it self will make you smarter, that’s how easy the phone to catch up with the technology. Big screen and bright colour, the camera is real deal. Take my advice “go for it” and don’t blink it might despair.",
            "Its a stylish phone with great camera would recommend this phone to anyone .",
            "Excellent phone for the value.\n\nWould certainly recommend this over any Samsung or iPhone! \n\nAlso comes with screen protector on and a case too. \n\nVery happy.",
            "Needed a replacement for my aging Samsung s6. I Picked this up on special offer. I can only compare this phone to the last phone I had so on that it's great, lovely big vibrant screen, great battery life. Only thing I will say is USB type C charging port shouldn't be a luxury, it should be the standard, I would have liked that but couldn't get it on most devices under a certain price range. Overall a nice phone but then I'm easy to please, do your research.",
            "Best phone I have owned. I'm not a tech wizard and this easily ticks many more boxes than I will probably ever utilise. Would definitely recommend.",
            "Great handset which set up easy. Happy with everything as delivered on all levels",
            "I was looking for a good value dual SIM + SD phone whose battery lasts all day, has a decent camera and is nice & loud on phone calls. A fellow dog walker recommended this and I'm happy with it as it does what I needs. Yes it's an older version of Android and uses the older USB but then again I don't need to replace any cables.\nI wish it was a little smaller it's 1cm longer than my last phone which was bigger than the previous and I have small hands. Otherwise I'd have given it 5*",
            "A great piece of gadget. Has superb functionalities and user friendly",
            "Very good phone for the price.\nLots of features. \nWell pleased with it.",
            "Good phone and value",
            "I like the phone, because I have use the same before. Easy to understand, bright, photo quality good, durable. I will buy it again because is too good for the price",
            "I bought this for my teenager, she loved it completely! She made a lot of pictures and videos. She adds a memory card, then it's a lot of room for her music, photo, notes, etc.\nAnd this color is beautiful. This smartphone comes with a silicon cover and already a simple foil to protect the screen. Cable with recharge. If you don't have your headphones you should bay. She used her Bluetooth headphones purchased from another company and it is ok.",
            "Great looking phone. Easy to use. Wife loves it.",
            "Beautiful design phone I love it .",
            "I bought for my mom last month is very good & battery life is good",
            "Am happy with my purchase",
            "Family really pleased with their presents. Got both the same so grandaughter could help with the set up, but even my daughter found it easy. Pictures are clear and all functions are straight foreward.  I am very happy with this product.",
            "Nice phone easy to set up and use",
            "Brilliant phone good screen and battery life.\nExcellent price for this quality.",
            "She love it... She call it my machine",
            "Great price and great product thank you argos!",
            "Def recommend this phone. Brought for family member want one myself. Good size. Smooth. Stream line. The camera is fantastic & so many options.",
            "The phone is super right for my daughter.\nShe's enjoying it",
            "My daughter is so fussy with phones, but she loved this one do much",
            "Got it for my husband for Christmas and he really loves it.good picture quality .",
            "This phone is cheaper here than anywhere else. It comes with a screen protector and a case too. The best budget phone I've ever bought. Will definitely recommend it.",
            "This is a great phone good memory and easy to use.",
            "Bought this phone as a replacement for a phone my dog decided to chew. It's got all the bangs and whistles I expected, easy to set up, easy to use and a good battery life.  Decent camera on board also. Would definitely recommend.",
            "I like it and very good.",
            "Bought for my son he loves it easy to use takes fantastic photos",
            "Great service, ordered the phone from home , within a short time i got a message that my order was ready for collection. Happy with my phone , its a great phone for the price paid for with a good camera.",
            "Great price and quality battery life brilliant \n\nCan't find any faults",
            "Thanks soo much Argos this is a early Xmas present for my partner he said it is up to his standards as everything he had expected it to be.",
            "A fab phone, slightly larger than what I'm used to and texting one handed isn't impossible, just different. The camera is brilliant clean and crisp, photos perhaps a little bright for my liking on the default setting but superb photos none the less. The audio on the video is very good out of the box. Tonnes of storage space which I lacked before. 2 sim card holders and a memory card holder in one tray. Nice design to the rear of it, I'd recommend this phone.",
            "Very satisfied. Definitely recommend. Amazing phone for an amazing price!!",
            "It's amazing to use and has brilliant features.",
            "Great product, very pleased value for money. I am very happy.",
            "Great phone if bought on sale as it's a fantastic budget or second phone",
            "Fair price good design easy to use like the colour all in all a good mobile phone",
            "Nice design, worth the money",
            "Took a while to get set up, but now working very well. A bit different to the Samsung galaxy I had before, like the memory size and speed of operation. Overall well pleased.",
            "I bought this for my mum, its easy to use, huge memory. Looks good, great petrol green colour. Its also very responsive.",
            "I went from an iPhone 7 to this and its been a good so far. Colour is metallic and nice. Large screen. Good camera and space for apps",
            "I will be letting my family and friends now wot to buy next this phone",
            "Excellent phone very happy with phone",
            "This phone is ok very easily setup doesn't take long before you get used to it I'm enjoying it very much",
            "This will be the second Huawei purchase over the years ,I've found the phones to be reliable, and great value for your money .the phone is easy to navigate and has some very good features ,the camera is very good, and takes some great photos, the phone also has a good internal storage space .but you can add more if needed ,you can also have two sim card in this phone. Inside the box everything you need charger ,plastic back cover ,pin for removing sims and memory card .overall fantastic phone .",
            "I bought this phone for my brother as an early Christmas Gift and its been a while he is using it and he really likes it.",
            "Good phone. Does everything you want. Would buy again",
            "Bought this for Wife's birthday she loved it. The phone has everything you need from latest iPhone. A lot cheaper  than expensive iPhone and another smart phones and more valuable with far longer battery life. Good. With blue tooth. Nfc. My wife love it so much that she now replace the old Samsung and BlackView phone with just this phone that have dual sim. Facility and micros card 259gb storage\nI will definitely buy again.",
            "easy to use and set up - dose everything I need",
            "Great product. Worthwhile buy.",
            "The phone looks nice and I love the colour.\nDose good pictures and it's easy to use. \nThe battery life is quite good. \nHas a good sound quality. \nThe phone came with a plastic case which is a great idea. I definitely recommend it",
            "Very good value for money",
            "The product is honelstly great",
            "Great working phone has no faults to it and to be fair couldn't ask for anything better",
            "Son bought this phone last month with his birthday money. He absolutely loves it! We love this brand of phone. Fab camera, great storage, and fab design! Highly recommend it",
            "Battery Life is superb, it lasts for days without another charge, its quick and easy to get used to and you forget its in your pocket as its relatively light, it also comes with a case in the box and screen protector so great value for Money !",
            "Loved the camera, the screen, the memory, the battery life. Also comes with a protective back cover. What else could I possibly ask for at this price? Totally recommended.",
            "Excellent large storage capacity. Battery lasts for a few days of constant use without another charge. Large screen. Resposice fingerprint scanner. All round great phone",
            "Bought this after my Samsung stopped working. This phone is just as good. Has lovely large screen. The photo quality is amazing, battery life excellent, features not bad either.\nOnly negative is the speaker is not as loud as my other phone.  As an android I would give this phone 9/10",
            "This honor 9x lite is definitely worth the money no issues with it fast working and efficient",
            "Very good smartfon and dessing is amezing",
            "Excellent delivery service for this modern and reasonable priced mobile phone that does exactly what I want, first class.",
            "Great phone does everything... Great screen and fab photos",
            "It states that the phone is green but it is blue which was a bit disapointinng",
            "A great phone does exactly what you need and really smooth and fast for the price",
            "Awesome phone value for money heavy duty and long lasting battery\nPitchers quality is fabulous",
            "An excellent phone at an excellent price",
            "Purchased this phone for my husband who was dubious about it, as he usually has Samsung. He's really impressed with it. You get a lot of features and a really nice size screen for the price.",
            "A phone which is worth the price",
            "Good product no problems yet",
            "Good phone, looks good has great battery life, all the apps and features you could want, if i had to have a negative it would be it's a large phone certainly larger than I'm used to but makes pics look brilliant",
            "A good phone well specced and easy to set up. Recommended",
            "Phone is overall very good and nice to use for this price, however it is not type C and has very slow charging. No fast charging with it. But has a good feel and look to the phone.",
            "I've just resently bought the phone and I have not been able to go through all the apps but so far it's good"
        ]
    }
}