{
    "746/0777": {
        "remotekey": [
            "746/0777"
        ],
        "item_category": [
            "With the Doro 6620 you'll enjoy an ever better sound experience thanks to HD voice, technology that makes it easier for you to hear and to be heard. Calling, messaging and taking pictures are all made easier thanks to the widely separated, high contrast keys and a large 2.8 screen. Other features include assistance button, HAC (Hearing Aid Compatibility) and convenient shortcut keys to both camera and messages. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "50 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "6 May 2021",
            "14 April 2021",
            "7 April 2021",
            "30 March 2021",
            "10 March 2021",
            "24 February 2021",
            "23 February 2021",
            "17 February 2021",
            "10 February 2021",
            "10 February 2021",
            "27 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "2 December 2020",
            "26 November 2020",
            "26 November 2020",
            "25 November 2020",
            "24 November 2020",
            "20 November 2020",
            "11 November 2020",
            "4 November 2020",
            "28 October 2020",
            "21 October 2020",
            "15 October 2020",
            "7 October 2020",
            "6 October 2020",
            "6 October 2020",
            "30 September 2020",
            "30 September 2020",
            "2 September 2020",
            "26 August 2020",
            "18 August 2020",
            "6 August 2020",
            "29 July 2020",
            "22 July 2020",
            "21 July 2020",
            "8 July 2020",
            "8 July 2020",
            "1 July 2020",
            "24 June 2020",
            "23 June 2020",
            "3 June 2020",
            "14 May 2020",
            "6 May 2020",
            "6 May 2020",
            "22 April 2020",
            "11 February 2020"
        ],
        "review_title": [
            "Excellent simple phone",
            "Great",
            "perfect for my mum",
            "Ideal.",
            "Easy mobile phone",
            "Good for the non-tecchies",
            "Great phone for those with impaired vision.",
            "Easy to use",
            "Doro Phone",
            "Easy use phone",
            "It’s clear monochrome keypad make it easy to see",
            "Looks brilliant and is fab and very easy to use.",
            "Great for 90yr old neighbour",
            "Doro Phone",
            "Fantastic phone really good very easy to u",
            "Contact",
            "Phone is compact and easy to use.",
            "My husband just wanted a basic phone and this is j",
            "Gift",
            "Very basic for the price",
            "Great phone key pad greatly improved !!!!",
            "Does what it says, and does it well!",
            "",
            "The phone is perfect for my husband",
            "Battery not as efficient as previous non clam desi",
            "",
            "The Doro mobile phone",
            "Easy to use and comfortable",
            "It was bought for mum she loves or",
            "Very very good and very nice",
            "Easy to use",
            "It’s ideal as a phone.",
            "Bought for friend and they thought it was lovely",
            "Great for older people",
            "Great easy to use phone",
            "Love this phone!",
            "excellent phone for ease of use",
            "Improved version",
            "Brilliant Phone",
            "Great Little Mobile",
            "It was very easy to set up and use.It is also comp",
            "My phone is exactly what I expected",
            "Good phone for the elderly",
            "Brill",
            "My mobile phone is so easy to use, I love it!",
            "Excellent phone for older people",
            "Smart and Functional",
            "Phone",
            "Good phone for seniors",
            "Very fast ."
        ],
        "review_text": [
            "I bought this to replace a phone of a different make which only lasted just over a year and I find this phone so much better and easier to use.  Sending a text message is so easy with clear and well-spaced keys and the screen has a large clear display and calls are easy to make and hear. Everything is designed for ease of use.  Very pleased with it.",
            "Bought for an 89 year old relative and she loves it.",
            "Purchased for my 82 year old mum after her last Doro needed replacing. Her needs were a clearer tone and higher volume and this phone has met her needs. Please note that you will need a micro sim to use in this phone (which was very quickly supplied and fitted by our local O2 shop). We also ensured that the data was turned off, which was very easy to do. My mum finds this phone very easy to use.\nThis phone comes complete with a charger.",
            "Ideal phone for my wife, easy to use and set up was so straight forward for my wife who has no technical ability whatever. Perfect phone for her.",
            "The easiest mobile phone to set up and to use.",
            "Bought for elderly non-tech savvy relative - it does the job very well. Works on the 3G network, large screen with large numerals on the display, perfect for those with not-so-good vision, and comparatively few extra buttons apart from dialing keypad.  Ability to program a couple of dedicated \"speed dial\" buttons is very useful.  User manual supplied has fairly small print; I wrote out in longhand basic instructions.  Phone can be set to answer calls when opened, and hang up when it is closed.",
            "Easy to use, large numbers, very tactile, folds easily to fit into small pockets. This is the second Doro phone I’ve purchased for my Mum, the larger numbers are easier for her fingers to operate and her impaired vision. Highly recommended.",
            "Generally a good quality phone and very easy to set up and use. Good quality sound.",
            "Easy to set up, clear large display, loud and clear sound. \nWhat I was pleased about was that it came with a charging stand aswell. This was a bonus as my brother who I purchased the phone for has poor eyesight and it is easier for him to just stand the phone in the port when it needs charging rather than struggle to put the lead in and out of the phone, minimising the risk of damaging the port...which is what he did with his previous Doro phone.\nAll in all very pleased with this purchase.",
            "Bought this for an elderly relative, easy to set up and use. Has a handy stand/charger to sit the phone on.  Quite happy with the purchase only negative is that the battery doesn’t last that long, needs charged every 2 to 3 days, and that’s with light use, one  short call a day. So could be better, but if you are looking for a easy to use basic phone, then you won’t go far wrong with this one.",
            "It’s clear monochrome key pad makes it easy to use - very pleased with the pictures on the camera and audible quality sound.",
            "Again it’s a good phone and very easy to use",
            "I bought this mobile phone for my 90yr old neighbour she loves it so easy to use for her",
            "Bought it for my elderly mother as replacement for her old phone , she is 98 and has no problem using it",
            "Very clear and easy to use.",
            "Great phone, definitely recommend it , well priced as well",
            "The product is ideal if your eye sight is not perfect, my partner finds it so easy to use.",
            "Most people want a smart phone these days but for us oldies just want a phone to make and receive calls. Also for someone who wears hearing aids the speaker is a bonus",
            "Gift for 83 year Mum Easy to use buttons nice size Replacement for her old Dora,, Good phone simple and does the job Nice improvement Thanks",
            "I had to buy a replacement phone at short notice & wish I had allowed more time to choose. This phone is definitely designed for poor-sighted people as the details on the screen are very large, even using the smaller option. Also, the other devices on the phone are not user-friendly & definitely not as efficient or versatile as my previous Samsung phone.",
            "Excellent all round service for me",
            "Does what it says, and does it well!",
            "Very simple to setup and has a very loud ringtone. \nAs a basic phone that lets you stay in touch with family it cannot be beaten.",
            "This phone has all the features my husband needs and it is simple and straight forward to operate. It also has an alarm on the back which is extremely useful for elderly users. The camera is good and unlike the last Doro phone my husband had, emails are possible. It’s a compact great little phone.",
            "Battery not as efficient as previous non clam design phone",
            "I was worried about buying a new mobile phone on my own but wanted what I want specifically not too complicated and predominantly a phone with a camera.   I read the reviews which were very encouraging and they are all true.   This phone is easy to use, simply to do everything and excellent audio.   I can now use my mobile as I can hear everyone clearly and it is easy to text as well.",
            "The Doro mobile phone is easy to use and setup, large numbers and very clear audio,with lots of stuff included.",
            "Its easy to use. Features are fabulous",
            "Good price\nDoes exactly what you want\nEasy to use \nEasy to set up",
            "Lovely and very very good and very nice",
            "Easy to use only down side you can only set one alarm.",
            "Wanted an easy to use phone and found this one fits the bill.",
            "Good price and next day was in store to collect.   Was unavailable in local shops",
            "Bought for my 74 year old dad who’s useless with everything, he loves it as he can work it and finds easy to use",
            "Excellent phone. Purchased for partners mum in her 80s. Easy to set up for her. Easy to use. \nLots of facilities to make it easy for her such as hearing aid compatible and can pick large font to make easier to read texts. She is so pleased with it.",
            "Simple to use and great reception.",
            "This phone is the best for people who can't handle the tiny buttons on a smart phone. It is easy to operate. Receives calls and sends texts. All that is needed",
            "I got this as a replacement for an earlier version. There are some nice added touches and the clarity of sound from the  speaker is a better. Very easy to use.",
            "Highly recommend to anyone looking for an easy, simple to use mobile phone.  Easy to see, instant response to commands, no complicated features like a lot of the new phones.  If you want a phone to work on the press of a button instead of all this swiping and tapping malarkey I would 100% recommend this for a stress free life!",
            "Bought for my Sister who doesn't do technology. She wanted an easy to use mobile for texting and talking, and one that takes photos, and this is perfect for her. She loves it, and my 80 year old Mum now wants one too!",
            "I found it was exactly what I needed.After using a smart phone for few years,phosphorus a lot simpler to use.It is also compact and easy to carry.",
            "I am glad I bought this item as it is exactly what I needed",
            "Bought this phone for my 87 year old father in law ,simple for him to use ,works great",
            "Its works as it should and easy to use.",
            "The mobile phone is ideal for me to use with my disabilities. It’s larger keys and larger print on the screen makes it such a joy to use. It was easy to set up and and it didn’t take long to fathom out how it works. It’s the best mobile phone that I’ve ever had and I would recommend it to anyone who has problems with their sight or using their hands. It’s a great option for anyone who isn’t that good with technology.",
            "I bought this phone to replace another cheaper Doro model and it is so much better than my previous phone.  It is so easy to use and the symbols are much easier to access.  I am really pleased with this phone and would recommend it to anyone who isn’t very good with technology.",
            "I wanted a replacement phone that looked good was simple to operate with easy to use functions and long battery life. The Doro has fulfilled all my requirements.",
            "Easy to use , no problems settings it up, so far all good",
            "Bought as a replacement for an older person.  Easy functions, simple to understand for non-technical people",
            "Great phone very good clear screen, would recommend to anyone."
        ]
    }
}