{
    "869/7484": {
        "remotekey": [
            "869/7484"
        ],
        "item_category": [
            "The Reno4 Z is an affordable 5G premium smartphone with a super smooth 120Hz FHD+ display. A 48MP quad rear camera for every occasion and a dual selfie camera for flawless selfies. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "31 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "84%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "16 June 2021",
            "19 May 2021",
            "30 April 2021",
            "28 April 2021",
            "28 April 2021",
            "27 April 2021",
            "20 April 2021",
            "8 April 2021",
            "7 April 2021",
            "7 April 2021",
            "22 March 2021",
            "17 March 2021",
            "17 March 2021",
            "10 March 2021",
            "10 March 2021",
            "9 March 2021",
            "9 March 2021",
            "4 March 2021",
            "3 March 2021",
            "2 March 2021",
            "3 February 2021",
            "2 February 2021",
            "27 January 2021",
            "26 January 2021",
            "19 January 2021",
            "6 January 2021",
            "5 January 2021",
            "5 January 2021"
        ],
        "review_title": [
            "Super battery and features",
            "Amazing phone",
            "Great feature and quickly available from Argos",
            "Definitely recommend",
            "Great for the price",
            "Is not as good as i expected",
            "It is a good pfone",
            "Seems to be doing the job",
            "OPPO Reno4 Z",
            "Excellent camera, gorgeous colour",
            "Great ohone",
            "Extremely slow",
            "Fab phone",
            "The phone is very fast",
            "The best cheap phone",
            "Switching to Oppo phone from Samsung 8+",
            "Amazing phone! Love it",
            "Good price with excellent features",
            "",
            "Excellent phone faster phone",
            "Stunning phone at reasonable price",
            "Oppo Reno4 Z",
            "The phone is sleek and works well",
            "Oppo Reno4 z",
            "Very good value for money !!!",
            "worth all the money",
            "Password",
            "Phone looks amazing",
            "looks fab and working perfectly",
            "no bad with is money you can buy something better",
            "OPPO Reno4 Z 128 GB 5G"
        ],
        "review_text": [
            "I bought it a month ago and I'm glad I did it has a great camera and it's very fast",
            "Brought the Oppo Reno4 z some time ago and it's a brilliant phone for the price beats paying over the odds for a phone",
            "I bought this phone, and it's running smoothly. Nice phone and quickly available from Argos.",
            "Great camera and other features well worth the money.  Very happy with my purchase, recommend to me by a family member.",
            "Bought phone a week ago and it's been great. Battery life is great or charge time. Screen is LCD and 120hz so draining battery quick. Android 11 once updated. Nice coloros features. Big screen very smooth action and speed of flow with browsing and interaction within is. Good memory and storage size for the currency.",
            "It's not as good as I expected",
            "I am happy with my new phone",
            "Obviously haven't had the handset that long to know if it's going to last. Coming from a s7 edge which lasted over 4 years and didn't come problem free. Phone seems to be coping well, just had the Android 11 update and I'm happy with my oppo Reno z4",
            "Good smartphone.All OPPO very easy to use .",
            "It’s more Pearl blue than black. Really nice colour. Camera is excellent and no issues with the phone so far.",
            "Great features, camera is brilliant, cloned my old Android phone and job done.",
            "Day 1.extremely happy with the device.smooth and fast. did have a weird boot menu when first turning the phone on. But hey can happen. \nDay 2. After playing a few games (games I used on a phone with 6gb of ram and same processor) started to notice the phone getting laggy\nDay 3. Phone was struggling with everything. Even recent call list was laggy\nPhone was returned and seems its normal for this make",
            "I would absolutely recommend this phone. \n\nAbsolute bargain for the money. Not had the phone for very long but so far I have zero complaints.",
            "Good phone for playing games or working.",
            "This is the best cheapest phone I've ever used. The boxing is great. The box includes chargers USB c, earphones and FREE cover. The phone covers 5g coverage. I would definitely recommend this to anyone.",
            "Was relatively painless - missed quite a few things on my Samsung, but I can live with it. Especially since some things were better\n\nJust reserve quite a few hours to organise/transfer files across and getting used to new features\n\nI also switched to giffgaff from EE. Again allow time for the handover. Much much cheaper and a few facilities missing. But happy to accept, seeing as it copes well with 5G",
            "This phone is great, it is sleek and looks really good. It also charges extremely quickly, so there is no waiting around for it to charge. It is really easy to navigate and the system allows for customisable settings so you can make the phone work in a way which suits you best. Couldn't recommend this enough. Already convinced 4 of my family members to get one.",
            "Awesome phone with good storage in excellent price \nIf you looking for a budget phone with great features and best quality camera phone so this is for you guys.\nAlso very good in games with no heating at all \nGreat experience in gaming in high resolution.",
            "Now you have any questions please feel welcome and thanks",
            "Nice phone easy to work easy to use and fast phone I like this phone better the Samsung",
            "Fast, easy to use and the resolution of pics and videos are absolutely amazing!\nNothing less than something that cost double money!!!!!\nHighly recommended",
            "Perfect for price of 260",
            "It was quick and easy. Delivery was on time",
            "I may be wrong but to update this phone to December's sercurity update you have to use a computer to do so. That's bonkers.",
            "Good balance for what you pay and what you get, big display, (not amoled), fast charge with charger in the box, case in the box, very pleased with overall experience to be honest.Very good to see alternatives for Samsung and Apple on the market.\nWell done Oppo",
            "competitive price, looks great, worth it.",
            "Just because the Phone has a lot of security functions, do also create a password as the machine will ask for it - without it you can never get it unlocked.",
            "Really love the phone got it from my brothers birthday has a lot in of features like 5G and the memory is 128gb  Feels amazing to hold and the phone looks fantastic really happy with this purchase",
            "easy to operate ,big screen ,amazing phone for very good price",
            "no bad with is money you can buy something better",
            "A really cool phone works fast and well for the price"
        ]
    }
}