{
    "943/6864": {
        "remotekey": [
            "943/6864"
        ],
        "item_category": [
            "Capture the world the way you want to see it with a 64MP Rear Quad Camera and a 32MP Front Camera integrated with automated optimisation software to intelligently enhance focus, colours, exposure and more. Keep your creativity flowing for longer, with OPPO's 65W SuperVOOC 2.0, which can achieve a full charge from 0% in as little as 35-minutes. Vividly stunning OLED 6.4-inch display with a silky smooth 90Hz refresh rate offer you a seamlessly immersive gaming and video playback. With ultra-slimline body, it combines performance with a design. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "16 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "28 July 2021",
            "27 July 2021",
            "23 June 2021",
            "8 June 2021",
            "4 June 2021",
            "2 June 2021",
            "1 June 2021",
            "1 June 2021",
            "29 May 2021",
            "28 May 2021",
            "28 May 2021",
            "27 May 2021",
            "26 May 2021",
            "26 May 2021",
            "26 May 2021"
        ],
        "review_title": [
            "Excellent value for Money for a Dual SIM phone",
            "This phone offers all you'll ever need",
            "Convenient and easy to use with a great camera but reservations about battery life",
            "Great phone",
            "Best phone I've ever had",
            "Stylish phone, with great camera features",
            "Fantastic",
            "Incredible!",
            "Very impressive performance",
            "Amazing Phone!",
            "Really nice phone, and some amazing features!",
            "Great",
            "Amazing phone",
            "OPPO Find X3 Lite 5G",
            "Great phone",
            "This mobile is Awesome!"
        ],
        "review_text": [
            "I have now had this phone for more than a month now and I am still finding new and interesting technology for an individual who has only ever had a basic Flip Phone. The smart phone has been excellent and the ability to clone some data from my old flip phone has been excellent for transferring contact details and saved messages have been excellent",
            "I upgraded from my much loved OnePlus 5 as no longer supported. Good priced phone and included free Enco X headphones. The phone is excellent, good screen quality, excellent cameras. Also is good size phone as is slightly narrower making it easier for one handed use.",
            "The Oppo Find X3 Lite is a convenient size and has an excellent camera system. There is very little bloatware. I find ColorOS easy to use but the Quick Start guide could give more information on initial setup. Charging is quick but the battery drains faster than the one on my old phone does after four years of use.",
            "I m glad I chose this phone from Argos it’s perfect",
            "Great phone with an amazing battery life. Currently charging it every other day. Brilliant camera features and every each to use.I've been a Samsung phone user for years and thought I'd never change. Now Ive got an Oppo I'm never going back.",
            "[This review was collected as part of a promotion.] It is worth noting that this is lowest spec option in the Oppo Find X3 range, however it is still a stylish looking smartphone with some good features. The phone comes packaged with a hardwearing protection case, charging paraphernalia and some headphones. I got the starry black design, which I really like but perhaps your preference would be a different colour and there are others available. I found the broader navigation around the phone OS to be quite complex and a bit confusing, but over time you get used to it. The screen/display is really good with rich colours from the full HD screen. The audio is decent as well and does the job. The biggest plus for me on phone is the camera, which I felt had lots of options to create some excellent photos.",
            "[This review was collected as part of a promotion.] I have replaced my old phone with the oppo X3. The phone charges so fast and holds the charge really well. I tend to be on my phone a lot so I usually have to charge my phone a couple of times a day but I’ve found that by the end of the day I still have plenty of charge. The camera is really sharp and the photos and videos are high quality. The instructions are easy to follow and the phone is so easy to use! The design is lovely and not too heavy either. I’ve managed to get all my usual apps onto the phone without using a massive amount of storage. Absolutely in love with this phone!",
            "[This review was collected as part of a promotion.] I’ve been using my oppo for the last few weeks and it hasn’t disappointed. I’ve used iPhones practically all of my adult life and never really wanted to venture away, I’m so pleased I have! The phone is simple and easy to use but that’s not even the best part. The phone looks smart and sophisticated but the camera is ridiculously good. It looks as if you took the photo with your eyes! Not only that, the gaming alongside it makes the oppo a great choice. Anyone who has been thinking about moving away from an iPhone or Samsung would be silly not to go for one of these- cracking product!",
            "[This review was collected as part of a promotion.] Really pleased with this phone. It has a fantastic camera with so many features, I especially like the wide angle and macro modes. It's so easy to use with the Android operating system and the screen is crystal clear. Would definitely recommend if you're looking for a cheaper phone but still want the performance of a more expensive model.",
            "[This review was collected as part of a promotion.] Had a Samsung phone but the switch to a OPPO was such a god decision. Great value and well built. Camera has an amazing resolution and the macro option gives very professional shots. Case is nice and slim and they actually supply a clear jelly case in the box. Keeps it protected until the new case arrived. Touch screen has superb response and resolution of the screen in full 4K is stunning. For value for money and features I dont think you can beat it for the price. Very happy owner. !",
            "[This review was collected as part of a promotion.] So I’m used to other phone manufactures but honestly they might have converted me! The features of their high end phones are available on this much lower cost phone and they work amazingly! Fingerprint and Face ID work great and so so fast! The screen size is amazing too, actually filling the whole phone and the camera… what can I say… it’s like a professional camera! If nothing else, I would buy this phone just for it’s camera specs, they’re truly great! \n\nIt’s so responsive, loads of storage with the addition of being able to add more with a micro SD card so you’ll never have “no storage” which is a lifesaver! It’s super skinny, and pretty lightweight for the phone size. \n\nAnd I love how you get a phone case with her, and it’s such good quality. Completely with the purchase and 5/5***** \n\nIf you’re looking for a phone with all the top features, but not such a high price, THIS IS THE PHONE FOR YOU!",
            "Great Product and Very budget friendly good screen ratio good battery good camera",
            "[This review was collected as part of a promotion.] I'd never heard of this brand of phone before so wasn't sure what it would be like, the camera is incredible, the phone runs very fast, it fully charged in about 30 minutes. After using it for about a week it's my new favourite phone, much better than my previous Samsung and I have nothing but good things to say about it. Love it",
            "[This review was collected as part of a promotion.] What an amazing phone by OPPO. It’s really eye opening some of the features included in this phone which blows away phones from other manufacturers in similar price range. It features a solid design with a lovely textured finish at the back that provides a great grip and keeps the phone looking clean from fingerprints, scuffs etc. Even with all of the great specs included, it manages to stay light which makes it perfect for long periods of use.\n\nIt comes with the latest Android 11 along with ColorOS. Combined together they allow a wide range of customisations and make the experience super smooth. I love the edge lighting feature for notifications and the under screen fingerprint - very handy!\n\nColours are rich and vivid on the screen, Ive loved watching Netflix on it. HDR10+ is fully supported on the phone which is great and 90Hz refresh rate makes the screen buttery smooth. The colours really pop out which makes a huge difference when gaming and watching movies. It makes the experience so much more enjoyable. The audio is also impressive with Dolby Atmos support. \n\nThe phone comes with an 8GB ram which is impressive considering the price. Ive literally had 0 freezing even while multitasking and gaming. Talking about heavy use, the included 65watt charger is a literal godsend. Its super fast to charge and even from an empty battery, I don’t think I’ve seen it take more then 30 minutes to fully charge up. Amazing really. There’s so many great features in this phone which I could sit down and talk about all day, from the highly optimised OS to small details like game mode etc.\n\nIt was my plan to use this as my backup phone, however the more Ive used it, the more Ive enjoyed it. I ended up transferring all my data to it and don’t regret it one bit. Amazing phone and highly recommended",
            "[This review was collected as part of a promotion.] I got this phone a month ago it is really easy to set up has great features takes amazing photos and is do easy to use I love the face recognition to unlock phone it's good that eyes need to be open to use this feature for added protection comes with a screen protector and case too. The super fast charging is brilliant 30 minutes for a full charge and lasts all-day really easy to use and navigate I would recommend highly.",
            "[This review was collected as part of a promotion.] Receiving new oppo mobile changed my perception for having only a few names linked with the performance of certain mobile phones. \nSuch a beautiful and unique construction, amazingly fast working, light weight with impressive camera and picture quality, 64 MP Rear Quad camera and 32MP front camera with intelligent enhanced focus, face & finger print recognition, great touch screen and the best of all fast charging which I never had before in any of my mobiles. \nAlready comes with the screen protector and the protective shell, dual sim card compatibility and 128 GB storage what else can I wish for.\nAll in all its a unique modern and future proof mobile which looks stylish, performs amazingly fast, and awesome in features.\nBelieve me if you don't know the meaning of fast charging you are going to give it a try. Will definitely impress friends and colleagues with its fast charging feature."
        ]
    }
}