{
    "848/1638": {
        "remotekey": [
            "848/1638"
        ],
        "item_category": [
            "iPhone 12 Pro Max. Superfast 5G. A14 Bionic, the fastest chip in a smartphone. Pro camera system for unbelievable low-light photography. And a larger Super Retina XDR display. It's a huge leap forward. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "78 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "99%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "9 June 2021",
            "9 June 2021",
            "9 June 2021",
            "20 May 2021",
            "19 May 2021",
            "5 May 2021",
            "5 May 2021",
            "5 May 2021",
            "4 May 2021",
            "4 May 2021",
            "29 April 2021",
            "28 April 2021",
            "28 April 2021",
            "23 April 2021",
            "21 April 2021",
            "21 April 2021",
            "21 April 2021",
            "15 April 2021",
            "13 April 2021",
            "10 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "3 April 2021",
            "1 April 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "30 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "16 March 2021",
            "12 March 2021",
            "10 March 2021",
            "10 March 2021",
            "5 March 2021",
            "4 March 2021",
            "4 March 2021",
            "3 March 2021",
            "3 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "2 March 2021",
            "26 February 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021",
            "2 February 2021",
            "27 January 2021",
            "20 January 2021",
            "20 January 2021",
            "19 January 2021",
            "13 January 2021",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020"
        ],
        "review_title": [
            "Nice iphone 12 pro max",
            "Great phone",
            "It’s amazing i love it",
            "Great buy",
            "Great",
            "Great",
            "Fantastic Phone!",
            "great features",
            "iPhone 12 pro",
            "My phone looks amazing and it’s working very good",
            "Nice iPhone",
            "iPhone 12 Pro Max",
            "My phone is perfect",
            "Looks fabulous!",
            "My iPhone 12 max pro  excellent purchase",
            "It looks fab and cool phone",
            "Very good purcahse",
            "Smart Phone",
            "Iphone 12 is the best",
            "Looks fabulous",
            "Decent phone",
            "Iphone yay",
            "Yes",
            "Great phone",
            "My iPhone is amazing",
            "Very good",
            "",
            "Saida Saydi",
            "My phonee is awesomeeeee",
            "Just I can say beautiful phone",
            "Beautiful colours of iphone",
            "Brilliant",
            "My phone fest then BMW",
            "Very likely",
            "The phone is excellent I love it",
            "Stunning",
            "My phone is perfect for me",
            "Its fabulous phone",
            "My iPhone 12 is absolutely fabulous",
            "Best phone ever",
            "The phone looks nice",
            "Fabulous",
            "Everything you need",
            "I love this phone",
            "My phone looks incredible and so fun to use.",
            "I’m impressed with my new iPhone 12 Pro Max",
            "It is very good",
            "Lovely phone",
            "iPhone 12 Pro Max",
            "",
            "Good",
            "I love it!",
            "Excellent mobile.Worth to buy",
            "Fast delivery.. love Argos!",
            "It was delivered safe and timely. Excellent",
            "My iPhone 12 Pro Max is very fab and the battery l",
            "It’s looks great and fabulous phone",
            "My phone is so good and fast",
            "Its very good its smooth and looks very nice",
            "Working good",
            "It's good",
            "Love my phone",
            "My phone is good",
            "This is the phone.",
            "Good",
            "It is very slow",
            "I phone 12 pro max",
            "Amazing phone everything you need",
            "My iphone is perfect",
            "Brilliant",
            "Fab phone",
            "My phone is fantastic",
            "Amazing",
            "Best iphone i’ve ever had",
            "Love this phone",
            "Very nice,",
            "Gold!",
            "Very smart"
        ],
        "review_text": [
            "I bought this phone last month and im bery happy about my purchase. Quick delivery and on time. The phone was very well packed and secure. Many thanks",
            "I bout this month a go and I'm so happy with it.",
            "I bought it a month ago and it’s working well",
            "the best phone I've had, I've been using it for almost a month and I'm very happy  The system works smoothly, quickly and does not jam.  Somehow the quality of the photos is incredibly great.  I recommend this phone to everyone, I will definitely not buy another one.",
            "Very good as described worthy",
            "I bought this I phone 12 pro max two weeks ago I’m so happy to have this phone I like it",
            "Great phone, excellent camera and all round fantastic update. The phone is stylish and sophisticated and works like a dream, constantly updating and introducing new features which fulfill your every need.",
            "i bought this a few week ago and i’m so happy i did , it’s amazing",
            "I love it and good service",
            "It’s very easy to buy from Argos I’m really happy cause I have a account with this company they always are very careful with delivery the products in good condition\n I recommend Argos to everyone brilliant company with a very good team \n Thank you ARGOS",
            "Good Phone fast delivery all good",
            "I am very satisfied with Argus Products. Easy to order and deliver to your home place. The iPhone works perfectly well and was well delivered.",
            "Wow love the colour features  camera takes wicked photos. Would recommend",
            "Screen is much bigger then my old one so it’s plus for my new phone. Very fast and gold colour in my opinion it’s the best one.",
            "I absolutely love it ! it is so much better than iphone 7 plus. Above all it was so easy to purchase via Argos and the delivery was efficient !\nThank you!",
            "I like the phone put poor quality packaging.  Iphone should contain the charger set .",
            "I really recommend to buy from Argos \nVery good and quick delivery",
            "Ordered online - Best price around, quick and easy to purchase, delivery very quick and nectar points as well",
            "The phone is more than what I belived.",
            "I recommend it for every one",
            "The phone is decent it lasts for a day and it’s really fast, however the is nothing special about the camera.",
            "Great size and camera quality",
            "I liked phone so nice  everything profct I'm happy iphone 12pro max",
            "Super happy with my new phone.",
            "My new iphone is amazing \nGreat pictures \nGreat sounding would recommend this iphone to anyone who obviously can afford it .\nI LOVE MY I PHONE 12",
            "Arrived next day and is very good.\nStill slightly annoyed that I had to buy a plug separately but it is what it is",
            "wonderful phone, I am very happy, I recommend it to everyone ... thanks also for the professional service from Argos!",
            "Is really good I recommend for family and friends",
            "i am really happy about the dilivwry coming too fastt same day but its coming too late around about 9:00pm",
            "Nice phone I had ever",
            "IPhone 12 Pro Max blue.excellent look,beautiful colour.",
            "So happy with customer service \nPhone delivered on time",
            "Easy service thank u",
            "Very satisfied\nVery helpful \nBrilliant",
            "I am highly recommend this phone because  it’s very beautiful the picture quality is fantastic sounds quality is the best.",
            "The pictures taken with this phone are just unreal, sick performance and worth the money. \n\nHaven’t had any issues with the delivey, was just in time! Thank you, Argos :)",
            "Nice shape good quality and long battery time perfect for my needs.",
            "Its a new model iphone. Its features are excellent.",
            "My iPhone 12 is absolutely fabulous and I love it very much. I will recommend my friend",
            "The best phone I’ve ever used so fast so smooth and the feel is great and by far the best smart phone camera of 2021 definitely recommend!",
            "I would recommend someone to buy from argos",
            "No charger or hands free, nothing wrong with quality but shocking as no hands free or charger",
            "The best phone on the market",
            "I like this phone and my price and dill was great",
            "The phone is wroth the price and Apple has definitely improved the battery life and the camera quality is awesome.",
            "Happy with new iPhone",
            "I love this phone colour. Sound is very good.",
            "The iPhone 12 Pro Max has a brilliant camera & will defo recommend. Excellent phone but shame the front is all black & no white available",
            "Camera quality is good . Battery life is excellent",
            "Great phone, love the camera",
            "Looking very  beautiful and easy to uses",
            "I love my present! My husband ordered the phone on the Friday evening and the Saturday morning arrived.",
            "Worth for the price.",
            "Always reliable and excellent service",
            "Same price as to apple store but very fast delivery",
            "My iPhone 12 Pro Max is the best phone I ever had, with the biggest screen, the best speaker, the best camera and it's very beautiful with long last battery.",
            "It’s right size perfect shape and great phone",
            "Excellent it works fast and is just really good",
            "Its the way it moves i can easily get to different apps in a second and the buttons and everything else is really smooth no lag at all it also looks really good and i am not scared of it braking because it looks very dense i love it a lot",
            "Good with sounds and camera",
            "It's good just like my last phone",
            "Apple don’t need reviews. Bit expensive but best  Product on the planet. Loved it.",
            "My phone fantastic and d fast arrived and good sarvis",
            "You must just buy it.",
            "Good service very good phone",
            "This phone is very slow and very poor connection",
            "Fantastic \nDefinitely I recommend this I phone.\nThanks apple \nThanks Argos\nX",
            "Could not find in stock anywhere but Argos came to the rescue for my sons 17th birthday. He loves the phone and it was delivered just in time.",
            "Everything is wonderful.  There is nothing wrong with that",
            "Good camera, overall very good",
            "Really great phone and I’m extremely happy with it. Delivery was perfect too. Great communication with the driver!",
            "Beautiful and lovely iPhone",
            "Amazing phone, camera is absolutely brilliant. \nExpensive but worth it.",
            "Really good phone, love the colour and the battery life is amazing, really nice screen size also",
            "Always had an iphone and this is a fantastic phone.  Delivered on time.  Haven’t used all the new features but in general the internet is quicker.  Love the new design.  No complaints from me.  As usual transferring data from old phone was simple and straightforward.  Would recommend.",
            "I’ve only had this 12 Pro Max for a few days . The  best phone ever",
            "Big screen, nice vibrant colours and a battery life for an entire day. Not too bad",
            "Gone for a bigger phone this time round very pleased with it so far and love the different colour"
        ]
    }
}