{
    "940/8421": {
        "remotekey": [
            "940/8421"
        ],
        "item_category": [
            "Discover hyper-fast connection and captivating visuals with the TCL 20 5G. Its NXTVISION-enhanced display and Hi-Res Audio merge with the power of 5G speeds to give you the ultimate viewing experience. Its buffer-free connection with cooling technology lets you instantly stream your favourite content, including Netflix, in full HDR10. NXTVISION visual technology provides your media next-level colour accuracy that's calibrated piece by piece for colours bursting with life, while its visual enhancement amplifies your colour, clarity and contrast. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "25 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "92%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "26 July 2021",
            "22 July 2021",
            "21 July 2021",
            "21 July 2021",
            "24 June 2021",
            "23 June 2021",
            "7 June 2021",
            "6 June 2021",
            "5 June 2021",
            "4 June 2021",
            "2 June 2021",
            "2 June 2021",
            "2 June 2021",
            "29 May 2021",
            "28 May 2021",
            "19 May 2021",
            "5 May 2021",
            "4 May 2021",
            "28 April 2021",
            "20 April 2021",
            "20 April 2021"
        ],
        "review_title": [
            "Great phone for the price",
            "Excellent buy",
            "Great value phone",
            "Great screen, quick phone.",
            "Very excellent mobile phone",
            "5g phone",
            "Mr",
            "Great phone",
            "Very nice phone",
            "Bargain for the price",
            "Very smart look",
            "Fantastic Smartphone",
            "Absolutely brilliant",
            "From Snappers too movie makers",
            "Smart looking smart phone",
            "Superb phone",
            "Fantastic TCL 20 256GB 5G Mobile Phone",
            "Outstanding features and storage",
            "Striking TCL 20 5G Phone 6.67” FHD+ screen",
            "So far, so good!",
            "Great specifications for a budget price.",
            "I am very happy with my mobile, a lot of features",
            "TCL 20 5g 256gb",
            "Great phone. Lack of accessories",
            "It does everything that you need in a phone."
        ],
        "review_text": [
            "I've had this phone over a month now, I'm very happy with it, battery life, screen display, speed and the weight and size ,",
            "Ok, so you’re reading this because you know, you want a new phone ... obviously... duh!\n\nWell, now that that’s out of the way and you’re still reading this ... STOP, what’re you doing ... buy, buy, buy!\n\n....\n\nHave you bought it yet?\n\nGood ... breathe!\n\nNow, let me tell you about what you’ve just invested into.\n\nThis phone is on another level, the price is low, the tech is high and the average is above average...\n\n... this device has it all ‐well almost! You won’t be getting any water resistance or wireless charging... but who cares about them? If you ain’t planning on having a bath with it and can manage to put it down for 5 minutes every so often ... you don’t need water resistance or wireless charging! Just don’t drop it down the toilet and charge it overnight, battery lasts for hours, so if you can spare a few hours for you know eating, getting washed and generally looking where you’re walking ... you can spend the other 8 hours glued to this device.\n\nYou want sleek design ... bam ... you got it\nYou want Google pay ... you got it\nStorage ... it’s there ... 256 gig\nGood processor ... snapdragon 690\n5g ... geewizz ...bam ... it’s there!\nGreat photos  ... 48 mega pixels enough?\n\nThis phone has your wide-screen camera, your normal camera and your macro cam for them close ups that drop your jaw ... it’s got slow motion, stop-motion and many more features besides ... it takes night-time shots, light tracing shots and professional short videos ... edited as you film, perfect for quick professional uploads to your social media accounts, with transitions and music done for you in less than a second!\n\nThis phone is also equipped with awesome software. It has one handed mode, which lets you minimise the screen just by scrolling across navigation bar. It has split‐screen, and even has desktop style floating app mode when viewing apps in navigation instead of swiping up to cancel app, just swipe diagonally to get windowed app.\n\nThe other apps that come with this phone also give it a boost, as this phone is made by TCL its screens pretty neat to, it’s not an Oled but it’s crisp and the colours are utilising there own inbuilt software for image enhancement so that’s a plus.\nThis phone has it’s own built in screen recorder so no need to download apps for that either ... honestly for the money this phone is more than worth it ... it doesn’t have the big brand name, but it definitely packs the tech that big brands have become.\n\nI strongly recommend whoever reads this, to give this phone a chance ... it’s a 10/10 from me.",
            "I bought it 2 months ago and I'm more than happy with it",
            "I bought it a month ago. All okay, I noticed sometimes screen on left side not responding to touch at all. Not sure why is this, otherwise phone is great for the price, camera is good, photos crystal clear in natural light, having issues with artificial light. Slow mo video is good, bunch of different options as well. Battery is good, really fast charging, can charge from zero to 50% in 15-20 mins. Fingerprint scanner works quick and efficient.",
            "I bought it a month ago for myself",
            "Great phone very fast on 5g",
            "I bought it less done a month, it’s very excellent mobile phone",
            "I am happy I brought this phone it has enough storage and it is fast",
            "I received this phone to test.  Not seen this phone on sale anywhere so am assuming it is a brand new model.\nLooks very modern and similar to iPhone and Samsung phones.\nVery easy to set up and seems to hold its charge for a long time.\nI think it is an ideal first phone for a teenager as looks very nice and easy to operate. Have tried it with a SIM card and calls are really clear and don’t drop out.\nInternet searches are also good. All in all would be happy with this phone. I think one of my grandchildren are hoping I’ll pass it over to them. Lots of apps available also. Takes very clear photos.",
            "Great looking phone, fast and ample storage. Great battery life, lasts me all day easily even when heavily used.",
            "First of all it has very stylish look, beautiful blue back, the best thing it comes with screen protector and clear cover (which save £15/ 20 if you buy it separately), rear camera is 48 mega pixels with beautiful design and great look, I must say this mobile look amazing I was not expecting this, now comes to setup this mobile which is very easy, takes only few minutes and also give option to copy apps from your other mobile which is very handy. it’s has very large screen with powerful processor. It has unique finger print sensor on right hand side I love it, it has face recognition option, I must say it’s not less than any other popular mobile in any aspect. I like it’s Home Screen with many options. Battery life is very reasonable with this big screen. Camera result is amazing. It has good sound quality. It has duel sim which is also handy instead of having two mobiles. In short I am big fan of this mobile and would definitely recommend others. I will give it 5 out of 5. So far I couldn’t find any bad thing about this mobile..",
            "I can highly recommend this smartphone which has a beautiful sleek design in a beautiful shade of blue and light enough to fit in a pocket.\nIt's highly capable and so easy to set up and transfer data from your old mobile complete using Android Qual Comms Snapdragon 750 G chipset internal storage 256GB.\nCharges takes 1-2 hours.\nThis phone is highly versatile with APS that will please most people.  I particularly like the layout of the screen for ease of use which is well thought out.\nCamera specs 48mp primary camera, ultra wide 16mp, macro 5mp, depth 2mp and a great video camera.\nThese are examples of macro for the flowers, landscape plus depth of colour that you can achieve.  These a panoramic feature and great effect you can get which will be fun to experiment with.  This has incredible camera and I still have to discover the full capabilities. All the features of the Tcl 20 are so cleverly incorporated that it's a fun to explore and I certainly look forward to using the TCLs many features in the future",
            "Love the phone the fingerprint Id on the side is so much better than on the screen\nCrystal clear display\nLove it so easy to use and android so a plus better than my iPhone 11\nWould definitely recommend it",
            "From someone who is an avid apple fan I was dubious about this phone but I have given it a good road test. Having a duel sim is very useful if you have a business phone, saves you carrying the two. The screen is very bright and vibrant and a very good size of 6.7 inch  which makes watching video and viewing photo content very pleasurable. The standard android features are all there. I found the camera very good too, has the google gadget to identify, a good feature for gardeners. I used the camera to film the wildlife in my garden and from the video i have uploaded the quality is very good. I like this product and would recommend to anyone who is after a new android phone.",
            "This is a really stylish good size phone, well balanced and very comfortable to hold. The phone comes 5G enabled and has brilliant clarity. A host of features with smart manager and support centre assists navigating through the set up procedures. Fast response when going between apps is impressive.",
            "Phone comes with pre installed screen protector and transparent rubber case included which shows off the fabulous blue casing. It is a perfect hand size and feels solid but not clunky.\nThe quick start guide looked alarmingly sparse but it is incredibly easy to set up and transferred all the apps and images from my old phone without any hassle.\nIt has a bright, clear resolution and all the features you would expect from a high quality smartphone.\nAudio is excellent. Video calling is clear and I have had no issues playing games on the phone.\nThe camera is great and the Supernight setting takes cracking pictures in the dark beating hands down all my previous mobiles.\nThe battery is about average compared to what I am used to.  \nAll in all an excellent phone and for the cost it's an absolute bargain.",
            "TCL 20 5G Placid blue Android smart phone   Review.\n\nLet me be clear, this is just an honest assessment from a non-smart phone expert and this review is aimed at persons such as myself.\n  The first thing that struck me was this phones sheer elegance and beauty. It not only looks so good but feels so nice in the hand.\nOn the outside there is a conveniently placed power button which also serves for rapid fingerprint unlocking.\nMy phone did not come with written instructions, but the phone will get you started by following the onscreen prompts However, unless you already have a high level of android knowledge, I recommend you download the manual from Support Center.\n(all 70 sections)\n\nThe 6.7-inch phone’s screen display is outstanding. You scroll rapidly between apps.\nThe headphones plug at the top will facilitate your high-quality headphones, producing really fine audio.\n\nBluetooth Also the Bluetooth chip allows you to connect wirelessly to your compatible Bluetooth Earphones. Bluetooth pairing is straight forward through settings.   (see the manual. Section 50.)\n\nCamera\nThree different rear facing camera lenses, include ultrawide and super-macro.(allows camera to focus close up about 4 cm. recommended. ) select more for additional functions . All capable of even good lowlight operation. Colours are clear and bright. .                                         (You do have the option of a manual control for those more expert than myself.)\nThe most useful front facing camera will, for instance, give you a really good selfie, should you wish - and pick up the background very clearly.\n I really recommend referring to the manual in order to understand and fully appreciate the camera’s capability.)( Much more than I can show here). section 18.\nI took some fantastic photos with this device but had a technical problem and  couldn't add them. \n\n\nGoogle Assistant\n\nThe button on the left side opens the Assistant.  This is a brilliant feature  .\n  Once your phone is unlocked, you simply speak or type your requirements. For instant  “Open my emails,” or “Open phone contacts” or” Open camera “or Open Google’ or download Skype “ .or “Find me Energy suppliers,” or Find me local pubs and restaurants.” ; together with a myriad other information.” It instantly looks on the net and Bingo the information is there.  \n\n\n\nThis is a 5G device; and 5G, with all its potential advantages should soon have much greater coverage and this will  become the preferred choice for many people .This feature alone will go a long way towards maintaining the phone value.\n\nThis is a sim free unlocked mobile - allowing you to obtain or transfer an existing sim card, from the network provider of your choice. Make sure that they provide 5g. and you have the correct size sim card and do not lose the rather small tool (included)that unlocks the sim tray.)\n\nApparently, something called FOTA upgrades will update your phone’s software as required. Section 59.\n\n\nDisadvantages\nTCL phones are not really well known in my area, but their popularity as being good value seems to be gaining strength. I can see a great future for TCL phones.\n\nThis phone is not water resistant and will need to be cared for and protected from micro dust and not exposed to a harsh environment.\nThe screen is very touch sensitive, and you can easily flick to another app without intending to.\n\nConclusion \nIf you are looking for a very reasonably priced Android smart phone -with highly up to date capability and are prepared to spend a good deal of time getting to know your new device, then I would really recommend the TCL 20 5g. You will discover its features are captivating and amazing. But this is not for those who want a simple strait forward phone that just does the old basic functions.  It would be like comparing a Ferrari to a Robin Reliant.  \nGive this phone the care and respect it deserves and I am sure it will  remain  a most prized possession for many years.",
            "Excellent body colour on this large-size phone with its 6.67 inch LCD screen. The octa-core processor is fast giving no lag when playing videos or browsing. Octa-core processor, huge 256GB storage (expandable by up to another 256GB with micro-SD card) plus 6GB RAM. Up to 4K UHD video recording is available. Screen display is sharp with defined depth and colour, including when playing videos. Camera quality is impressive, offering a large range of options, including a Macro mode, 48MP triple rear camera and 8MP front camera for superb selfies and video calls. Storage, RAM and speed is as good as many desktop PCs - you could film a movie-sized video in 4K without running out of space. Android OS with easy access to apps, and popular apps are pre-installed. Gel case is included to protect back and sides. The pin to open the SIM card slot is inside the instruction box and it is best to download the full PDF instructions from the website (typing the phone name into a search engine will take you straight to it). Overall, a hugely powerful phone with a wealth of features, lightweight, the build quality is superb. The speaker output is only mono but add headset or external speaker and the quality is improved. 5G ready so this phone is futureproof. This phone was a real pleasure to review and I would be happy to use it on a daily basis, including for taking photographs and making videos.",
            "On opening the box this striking blue mobile phone hits you straight away.\n6.67” screen and a 2.56GB rom add to makes this a very stylish and a mass of memory, High res Audio and a 4500mAh battery that lasts and lasts. 48mp camera down to a macro camera too\nI just love how you can expand the memory even further.\nCharger/cable and gel case included.\nJack port for ear buds etc.\nthis replaces my old phone a treat. Certainly recommend to anyone and sim free too.\n“Stunning”",
            "Not heard of the make before but thought I'd give it a go for a change from the norm and so far, very happy with it. I had a Samsung A51 I think, 128g. This phone has twice the amount of storage. Battery lasts for at least 2 days and I'm constantly on it. Can't find any negatives at the moment.",
            "I am very happy with this phone after upgrading from my old Google Nexus 5 that I had since 2013. This new phone has 6 GB Ram so no lag at all. I love the big screen 6.67 inches as well.",
            "I am very pleased with this mobile. Its battery time is very good. It has a lot of latest features. I highly recommend this mobile.",
            "I've been meaning to buy a new phone for a while now and when I was putting away stock at my store and I was voicing this phone away and never heard of the brand before so I googled it and read nothing but good things about it, its got good memory a great camera plays games well it just shows that you don't need expensive phones like Samsung or iPhone go for a cheaper less known brand and you'll be surprised and how good they are, accessories options are not good but it comes with a gel case",
            "Great phone. Shame the included case is so loose it keeps popping off the phone. The lack of cases from third parties (Amazon etc.) means you need to be confident you can handle it without a case",
            "The only thing it didn't come with was the needle to get the sim card/memory card holder, out of the phone. Other wise very good value for the money. It has a very good photo camera's. Being 5G it is very quick on the Internet,streaming is pretty much obsolete, plays films off Netflix pretty good. All in all  a very good phone for your money,it's compatible to much more expensive phones."
        ]
    }
}