{
    "793/9057": {
        "remotekey": [
            "793/9057"
        ],
        "item_category": [
            "With its 48 MP, AI-powered triple camera system, moto g pro captures outstanding shots in every situation. Whether it's sharper, brighter photos in low light, ultra-wide action videos, or detailed close-ups, moto g pro is all the camera you need. Want to edit your photos with pinpoint precision? Slide out the stylus to retouch an image or jot down a note. Moto g pro. You + perfection. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "27 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "81%"
        ],
        "review_rating": [
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4"
        ],
        "review_date": [
            "30 July 2021",
            "23 June 2021",
            "1 June 2021",
            "21 April 2021",
            "13 April 2021",
            "26 March 2021",
            "26 March 2021",
            "16 March 2021",
            "16 March 2021",
            "13 March 2021",
            "20 February 2021",
            "18 February 2021",
            "10 February 2021",
            "9 February 2021",
            "26 January 2021",
            "19 January 2021",
            "13 January 2021",
            "5 January 2021",
            "1 January 2021",
            "3 December 2020",
            "26 November 2020",
            "18 November 2020",
            "18 November 2020",
            "11 November 2020",
            "27 October 2020",
            "14 October 2020",
            "14 October 2020"
        ],
        "review_title": [
            "Excellent Value",
            "Camera fault on all of them",
            "Really good features like the pen it comes with",
            "Great value",
            "My phone is great love the colour",
            "Phone",
            "Cheap phone with everything you want for daily use",
            "Very good",
            "could not update it",
            "Poor internet network",
            "Great phone",
            "Fine for a budget phone",
            "Great phone",
            "Fabulous phone.",
            "Good looking phone for a great price",
            "Great Price for an Android Phone",
            "Poor screen colors,try settings no better, return",
            "My moto phone is brilliant as good if not",
            "Was a gift",
            "good all rounder",
            "Mostly great, though a bit long for my face!",
            "Very nice features and really nicely designed phon",
            "Awesome Battery",
            "Good spec for phone at a reasonable price",
            "A nice mobile upgrade",
            "indigo blue pro",
            "Motorola"
        ],
        "review_text": [
            "Unbeatable for the cost. Great features as it's an Android One phone. Camera is above average. Stylus works good enough.",
            "I got this and had to return it.\nWhen switching to 60fps or slowmo\nThe cameras focus pops in and out.\nBut on this phone model, when you play the videos back, you can even hear the focus moving \n\nContacted Motorola, but so far they don't seem to care",
            "I got this phone as could not get the Samsung A51 to be fair I'm really happy with this not had a Motorola for years",
            "Good price and a good phone. Does everything far higher-end phones do (fingerprint, face ID, contactless payment, even a stylus!!) for a very reasonable price. Responsive and quick, and easy to set up and use.",
            "I like this phone every happy and I love  the colour",
            "It works and the colour is beautiful.",
            "Been using it for few weeks now, it has very good camera, battery last over a day for my usage which is more than enough. Kids love the stylus.",
            "Very very good product",
            "Spent 2 days and most of my phone credit, trying to update the phone. \nHad to return phone and get money back, just couldn't deal with the stress of it.",
            "Keyboard Hard to type. \nPoor inty connection\nSlow system\nMobile phone, sometimes deleted date and password",
            "Great phone does everything that all recent phone's are required , cameras great also",
            "Looks good. Works. Irritatingly kept telling me I needed to update the Motorola software and restart, several times a day for 1st week, but then it settled down. \nCamera is reasonable - again for a moderately inexpensive phone.",
            "Excellent phone great improvement on my partners previous Hawai",
            "It has some pretty cool features. Quick start for camera and torch. Fabulous at screenshots it captures the whole page if you need it to. Camera also has some cool features including a feature where if you show the palm of your hand it takes your selfie, not actually used camera that much yet, been at work alot lol. Comes with a stylus, the phone tells you when you last took it out so you can retrace steps if you lose it.",
            "Needed to replace my aging moto 5 as only a 16g memory.\nVery happy with this one 128 gb very fast, great camera's.\nEven a stylus.\nVery happy and would recommend",
            "Great features for the price. Android Apps compatible. Works well and long battery life. Quite large screen for clarity - Advise buy carry case for protection as screen looks fragile and insurance excesses are ridiculously large at £50 - £75.",
            "Good phone apart the quality of the screen , the colors are not like Samsung screens,\nReturned and bought Samsung  a51 adding 100£ on top.",
            "My  phone is brilliant can't fault it",
            "As far as I know, it's brilliant.  He's still playing with it!",
            "Updated from an older Moto and pleased with it. Fast, good screen, reasonable camera. Fingerprint sensor not so good. I need to get a case for protection because the clear case that comes with it is OK but, like many phones, it's quite smooth and easy to slip.",
            "The phone is pretty nice and I love the the great cameras.  It took a while to get used to it from the Moto G, but when I found the stylus, it was a game changer for me.  I love it!!  I also like that the facial recognition works whether or not I have my glasses on.\n\nMy only issue with it now is that the phone is quite long and I have a small head.  I can't talk and listen well at the same time.  I have to move the phone up and down between my ear and mouth or  wear headphones.",
            "The phone I received is a very nice looking phone and the features, camera and speed of the phone is really really good",
            "Sing ...At first I was afraid I was petrified, kept thinking had a done the wrong thing leaving my old pixel behind, but then I hummed and arghed and now I realize that I was wrong, the Moto G can do no wrong, now I'm alive and I feel just great, I walk around all day and night flashing my phone up in the air, I could of stuck with pixel 2 I could of had another year but now I'm holding my Moto G, and I'm smiling from ear to ear.. Go on now Go walk out the door go buy!",
            "Its fantastic priced phone with good specifications, ideal for teen aged kids.",
            "SIM Free Motorola G Pro 128GB Mobile Phone is an upgrade on my G6 bought 3 years ago, I am sure that once I get used to using gestures it will prove to be excellent .",
            "bought this phone for the speed of download and the additional little extra's that it has like the built in stylus and note taking capability, the blue colour also appealed to me as a little different from the norm.\nit also comes with a plastic cover so no need to buy anything extra this is keeping it looking pristine and sharp, i like the additional screen size and video's play instantly on it. i haven't got my head around all of the features yet but it is a pleasure to use.",
            "I bought it to replace my previous Motorola, which was cheap and worked but the memory was too small. This one is similar but updated with a much better memory. It costs more but I feel it is very good value, compared to other makes like Samsung."
        ]
    }
}