{
    "869/8067": {
        "remotekey": [
            "869/8067"
        ],
        "item_category": [
            "The Find X2 Pro features a simple, tangible elegance. With smoothed curves that fit perfectly in your hand, this is beauty you can feel from your eyes to your fingertips. Whilst being water resistant and dustproof for added protection. With a 120Hz QHD+ high resolution display and dual stereo large speakers to fully immerse in entertainment. So much so you won't want to put the phone down but when you need a top up of charge the Find X2 Pro supports super fast SuperVOOC 2.0 fast charging and a 15minute top up will give you a top up of 60%. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "14 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "13 July 2021",
            "27 June 2021",
            "19 June 2021",
            "6 June 2021",
            "8 January 2021",
            "14 December 2020",
            "18 November 2020",
            "13 November 2020",
            "29 October 2020",
            "11 October 2020",
            "11 October 2020",
            "30 September 2020",
            "30 September 2020",
            "30 September 2020"
        ],
        "review_title": [
            "Awesome",
            "Fantastic",
            "Try something different!",
            "Great device",
            "Oppo phone",
            "X2 Pro 5G",
            "Not looked back",
            "Amazingly smooth and the charging speed is just WOW!",
            "Wow what a phone",
            "Real power house",
            "Speed way quicker than my old Samsung",
            "After reading the high star reviews I decided...",
            "Love this phone",
            "Find X2 Pro"
        ],
        "review_text": [
            "5* best phone I have had, iv had Apple HTC Huawei and Samsung.",
            "I bought this phone last year and really have trouble faulting it! If I were to have a gripe it is with the ip68 water resistance. While it's certified if the phone should suffer water ingress it is not covered by warranty! It begs the question, what's the point of the certification. Having said that I have yet to find a phone that does include the aforementioned in the warranty. For the rest, a year old phone and totally happy! Doesn't help planned obsolescence though : ))",
            "Fantastic phone. Brilliant screen, great camera and speakers, excellent build quality and specs. Superb value for money.",
            "Best phone I have ever used and there is no other phone that can compare from other brands",
            "Great phone and great features the only down side is the battery is poor if your a heavy user you will need to charge it during the day but on the up side the fast charge is amazing plug it in and 30 mins later your phone is fully charged",
            "This is the best ever choice, Its really good with the charging and the look and feel. Extremely satisfied with the product quality.",
            "Came from a note 9 and thought I'd miss the stylus but was really excited to see what this phone could do.\\\n\\\nCameras are night and day more advanced, not talked about enough is the 512 storage as standard.\\\n\\\nCharging is *omg* good. So much so I have totally changed the way I charge my phone. I don't like using other chargers as it feels like I am depriving my phone of the good stuff, like putting inferior petrol in a supercar. It also hides the *not the biggest* battery which could be an issue but if the phones getting low after an early start or intense day, literally 15 mins gets you another half days usage. So I don't miss wireless charging at all. Not one bit.\\\n\\\nScreen is incredible, buttery smooth and fast, great colours and it makes others say \"wow what is that?\" when showing them content.\\\n\\\nA few little software niggles at first had me doubting my choice but now they've all been ironed out with smooth updates and the bog coloros11 launch imminent. My only gripe is the use of 3rd party launchers is a little hampered, not a deal breaker, the standard launcher is good it just has one or two quirks or missing features like most standard launchers.\\\n\\\nNearly 6 months in, I find myself wanting for nearly nothing, and still haven't seen a new phone where I have thought... I am outdated or I want that.\\\n\\\nAll in all pretty much perfect for the power user and it's nice to be a little individual.",
            "Never had an OPPO before but was recommended by a friend. I looked up the specs and it sounded too good to be true. The camera is stunning, the charging speed is out of the world. I never thought you'd be able to charge a phone in about half an hour. The screen is super smooth and bright even when outside.\\\n\\\nI would recommend this to anyone who wants a top of the line phone.",
            "I changed from IPhone to Android, and wow what a phone. So fast and the screen and sound is amazing. The camera is brilliant, but I think the software needs adjusting in places. \\\n\\\nThe battery lasts all day and even if you need a quick boost a quick 10 minute charge is all you need. 32 minutes and the battery is fully charge. Looking forward to coloros11 in December. It has been a bit of a learning curve coming from having iPhone all my life but so glad I swapped",
            "Having not heard of Oppo before, I was skeptical when the guy instore suggested this device for me in my local store. However, after doing a little research I thought I would give it a go and I have to admit to being very impressed. \\\nThe most important thing for me on a device is Battery and this device has not let me down. I must confess to being a little worried in the first few days as although it charged faster than any device I have ever had, it run down fairly quickly. However, after about a week that sorted itself out and I have never had a problem since. As I said the Charging speed is incredible, the response from the touch screen is razor-sharp and multitasking it handles with ease. I use the camera mainly for close up shots of jewelry due to my work, but the macro mode is great for detail.  All in all, I have to say I have been very pleased with my experience",
            "I spent a lot of time considering what phone to buy this time around, I made the mistake of buying a lower end Samsung last time. However, this time I thought I would opt for a higher spec, this lead to me to compare the new Samsung with the X2 Pro and realised the spec is a hell of a lot better and it's cheaper overall!",
            "After reading the high star reviews I decided to take the plunge and buy and Find X2 Pro and I am not disapointed! The device has an exceptional camera, sleek design and an impressive battery life.  Thoroughly recommend!\\",
            "Love this phone. A great combination of excellent screen, suberb camera, brilliant battery life all wrapped in a slim and elegant package. The system is really simple to use for everyone as well so will be swapping out my family to Oppo devices. \\",
            "I absolutely love my Find X2 Pro, first stand out feature for me was the charging, its mind blowingly fast, 38 minutes to full charge but even 10 minutes will set you up for the day. The screen is so vivid that I’m able to confidently play all my favourite content with the same quality as my high end TV at home. Coming from a 2 year old device previously, I was shocked at just how quick and responsive this device is, lightning quick regardless of how many tasks I throw at it, i love my OPPO."
        ]
    }
}