{
    "820/3225": {
        "remotekey": [
            "820/3225"
        ],
        "item_category": [
            "The Nokia 130 - great, long-lasting, entertainment. With its beautiful polycarbonate shell that keeps its colour even when scratched and a built-in rear camera, any moment can become a treasured memory With Bluetooth connectivity for file sharing between devices, you can share to your heart's content. "
        ],
        "summary_star_rating": [
            "4.3"
        ],
        "no_reviews": [
            "140 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "3",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "19 May 2021",
            "5 May 2021",
            "7 April 2021",
            "1 April 2021",
            "25 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "10 March 2021",
            "3 March 2021",
            "24 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021",
            "21 February 2021",
            "21 February 2021",
            "17 February 2021",
            "17 February 2021",
            "10 February 2021",
            "9 February 2021",
            "13 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "4 December 2020",
            "2 December 2020",
            "1 December 2020",
            "18 November 2020",
            "18 November 2020",
            "18 November 2020",
            "11 November 2020",
            "5 November 2020",
            "4 November 2020",
            "19 October 2020",
            "14 October 2020",
            "14 October 2020",
            "14 October 2020",
            "13 October 2020",
            "9 October 2020",
            "7 October 2020",
            "30 September 2020",
            "23 September 2020",
            "22 September 2020",
            "16 September 2020",
            "10 September 2020",
            "8 September 2020",
            "3 September 2020",
            "2 September 2020",
            "23 August 2020",
            "12 August 2020",
            "28 July 2020",
            "23 July 2020",
            "22 July 2020",
            "1 July 2020",
            "30 June 2020",
            "17 June 2020",
            "3 June 2020",
            "27 May 2020",
            "20 May 2020",
            "14 May 2020",
            "13 May 2020",
            "6 May 2020",
            "18 April 2020",
            "16 April 2020",
            "25 March 2020",
            "18 March 2020",
            "13 March 2020",
            "11 March 2020",
            "4 March 2020",
            "26 February 2020",
            "21 February 2020",
            "19 February 2020",
            "6 February 2020",
            "5 February 2020",
            "21 January 2020",
            "27 December 2019",
            "27 December 2019",
            "3 December 2019",
            "20 November 2019",
            "20 November 2019",
            "13 November 2019",
            "13 November 2019",
            "31 October 2019",
            "23 October 2019",
            "2 October 2019",
            "25 September 2019",
            "15 August 2019",
            "31 July 2019",
            "3 July 2019",
            "12 June 2019",
            "4 June 2019",
            "29 May 2019",
            "18 May 2019",
            "18 May 2019",
            "17 April 2019",
            "16 April 2019",
            "3 April 2019",
            "26 March 2019",
            "27 February 2019",
            "26 February 2019",
            "13 February 2019",
            "13 February 2019",
            "13 February 2019",
            "12 February 2019",
            "5 February 2019",
            "1 February 2019",
            "23 January 2019",
            "17 January 2019",
            "16 January 2019",
            "9 January 2019",
            "2 January 2019",
            "2 January 2019",
            "29 December 2018",
            "28 December 2018",
            "26 December 2018",
            "26 December 2018",
            "29 November 2018",
            "28 November 2018",
            "21 November 2018",
            "20 November 2018",
            "17 October 2018",
            "16 October 2018",
            "2 October 2018",
            "12 September 2018",
            "12 September 2018",
            "5 September 2018",
            "5 September 2018",
            "29 August 2018",
            "14 August 2018",
            "16 May 2018",
            "9 May 2018",
            "15 March 2018",
            "14 February 2018",
            "17 January 2018",
            "4 January 2018",
            "4 January 2018"
        ],
        "review_title": [
            "Poor phones need upgrading to accept latest sims",
            "Cheap mobile",
            "Good little phone",
            "Perfect for oldies",
            "I bought it for my Dad, great value",
            "Worth the price",
            "Newer version of an old friend.",
            "Perfect for my mum, as shes not a tech savvy",
            "IDEAL AS A BASIC PHONE",
            "poor instructions",
            "mobile phone",
            "Just what i needed it for",
            "good",
            "Solved a problem",
            "Simple, small & effective phone.",
            "Locked phone",
            "My phone was the right size for me and well laid",
            "Great phone",
            "I'm really happy with this phone",
            "Does what it says in product description.",
            "Looks good and works well.",
            "Misleading product info",
            "Brilliant, only needs charging weekly",
            "excellent phone",
            "Simple and effective",
            "Great little 2G back up mobile phone.",
            "It is a good phone",
            "Not the phone for me!",
            "Easy to use phone",
            "Good product",
            "Excellent phone",
            "Very convenient and simple to use",
            "Great little phone as a backup",
            "Cheap phone, does what is says on the tin!",
            "Nokia 130",
            "the sound is very clear",
            "",
            "Basic, Functional Mobile phone",
            "My Nokia looks great",
            "Great phone for a OAP",
            "2G Mobile Phone - Sim Free so NO CONTRACT & PAYG",
            "Basic functional phone",
            "Good basic phone, reliable and easy to use",
            "Simple phone with great battery life.",
            "Still happy with Nokia phones",
            "Great buy",
            "Birthday present for mum",
            "Couldn't ask for anything more.",
            "Great present",
            "it s easy to use - great",
            "Perfect first phone",
            "Did what it needed to do",
            "Good basic phone",
            "Good quality but looks like a refunded one",
            "THIS NEW MOBILE PHONE GIVES ME ALL I REQUIRE",
            "Simple plain Nokia",
            "This is a simple, basic phone",
            "Neat phone, easy to use and good value",
            "Good mobile phone specially for kids or elderly",
            "Sooooo basic and small",
            "Cheap basic phone does what it says",
            "Back in touch",
            "Just what I wanted.",
            "An excellent basic Mobile - great value",
            "Brilliant",
            "It is what it is!",
            "a simple no frills phone",
            "Great simple phone",
            "Great product, suits me very well",
            "My phone is very straightforward",
            "just what I requred",
            "Awful if you have hands bigger than a 2 year old",
            "Easy phone foe elderly relativve",
            "Goes on and on",
            "does what i need",
            "Limited connectivity",
            "Very useful second phone",
            "Looks ok and easy to use",
            "Good basic mobile phone",
            "Cool and efficient for purpose",
            "Easy to use.",
            "The phone was bought as a present and they loved i",
            "Does NOT work with Three sim cards despite Argos a",
            "Bog standard \"burner\" but nice bit of kit",
            "Does the job",
            "Great, simple little phone.",
            "NOKIA MOBILE",
            "It is what it's supposed to be.",
            "phone",
            "Great battery level stay for more than 3days",
            "Wanted simple and got it!",
            "A good mobile for basic phone calls",
            "Easy to use",
            "Nice phone",
            "Real value for money",
            "Nokia 130",
            "Compact ,small",
            "A good buy",
            "Nokia excellence",
            "My mobile phone",
            "Couldn't read sim card",
            "good simple phone",
            "Basic PAYG Nokia - to replace older model",
            "Small Phone",
            "Had everything I need",
            "",
            "Just what I wanted",
            "Basic",
            "Does what i want it to do",
            "Good basic phone",
            "Grandad friendly",
            "Great little phone for my age group.",
            "love this phone and easy to use",
            "does what it says",
            "Fantastic value good battery life and bluetooth",
            "My new phone is value for money",
            "my nokia phone",
            "nokia 130 phone",
            "Love my phone does what i want and no more",
            "",
            "Basic and reliable",
            "it is the same as my old Nokia with a few upgrades",
            "Great Phone",
            "Great for calls, texts.",
            "Very very basic",
            "Mobile phone",
            "just the job",
            "Perfect retro feel",
            "Good basic phone, works very well.",
            "Phone",
            "The phone was for my wife.and she love it.",
            "The phone looks good and simple.",
            "Great little phone , fits into shirt pocket,",
            "Finally a decent feature phone (again)",
            "Great value, nice and easy to use",
            "",
            "Good enough!",
            "phone",
            "Great basic phone",
            "Good value first phone"
        ],
        "review_text": [
            "Software needs upgrading to use latest SIM cards",
            "This is not a top of the rate phone but it was purchased for my mum as she had been admitted to hospital due to a fall.\nDoes exactly what it needs too.\nDecent cheap phone.",
            "This phone is very simple to use and has lots of features . It was bought for someone that doesn't like mobile phones but they are happy and can work it easily",
            "Mother in law loved it same as her last and easy to use. Perfect",
            "Perfect for my Dad before he went into hospital, it has been his lifeline.",
            "Easy to use long lasting battery",
            "Hubby needed a replacement phone but doesn't do anything new and fancy so this was the lesser of all the evils out there. He baulked when he realised it had a camera but was mollified that it also could be used as an MP3 player. He doesn't know how to use either!\nIt's neat and very similar to his last last old Nokia so he can make & receive both calls texts which is all he wants.\nI was surprised when we set the date that it was showing 2017 but that's my only crib.",
            "Was really happy with the purchase. Needed something simple with good battery life and bonus point was that its sim free..",
            "Bought for my 88 year old father to replace a previous Nokia one , he loves it , but it is very basic .",
            "Phone looked ok but twice it ran out of battery overnight when it was supposedly switched off, it now seems ok. Lack of clear instructions made it a try and try again to obtain some of the functions, otherwise its ok.",
            "bought this to replace my old phone very good and easy to learn I am very happy",
            "This phone is just what i was looking for. Just a simple phone for calls plus a few handy extras.",
            "good phone does what it needs to do",
            "Basic phone delivered to elderly mother who had dropped and broke her old one.  That this could be delivered to her within 24 hours (and after her neighbours son assembled it with the SIM card, and I talked her through charging it and turning it on) meant that her panic about not having a phone during a time she has a broken wrist was ended.  If this is your situation I recommend this, otherwise get an iPhone.",
            "It's my first phone. All seems to work well, but the buttons are small, and the three multi-function buttons sometimes exercise their will rather than mine. Otherwise, the design and manufacture seem excellent. The full instructions from the internet are easier to follow than the supplied paper copy.",
            "Phone was locked, not stated in the description. Kept for the charger and battery as I managed to get the original one this was going to replace working again but yeah; locked.",
            "Mobile fits nicely in the hand well rounded with reasonably sized buttons. My one complaint is that although it is sold with specification of up to 33 days standby time and 22 hours talk time. I find that I am having to charge the phone every second day.",
            "Create simple phone does exactly what it's supposed to do",
            "I think this phone is a brilliant phone and would really recommend it to anyone thats looking for a good phone with bluetooth",
            "If you are looking for a basic phone it's ideal looks okay as well.",
            "Does what it says on the can.",
            "I was looking for a cheap phone that took the old standard Sim card. Having searched in advance, I was led to believe that the Nokia 130 did just that. However, on getting it home I found this was not the case. The only redeeming factor was that the new battery fitted into my old phone - so I am using that. But this has turned out to be a comparatively expensive battery!!!",
            "Only wanted similar to the previous Nokia I'd had for 19 years! It's easy to use and I  can now take photographs",
            "does what a phone is required to do with out fuss.many extra functions easily accessed. good value .excellent service from argus could not be better.",
            "I love how simple this phone is. It is sturdy and reliable and has great battery life.",
            "Please note this is an unlocked phone but will not take any 4G Sim, its a 2G phone, so the sim provider I did sign up to could not make the phone work but were amazing checking everything but not until I gave the model number did everything become clear So just check with your service provider that there new sims work with what is now a basic phone.",
            "I didn't want a smartphone and this phone was a good choice. The storage is pretty low however a SD memory card has helped me save music playlists and photos.I would recommend this if you do not want a device with internet and just the basics :)",
            "I bought this phone having read reviews saying it was 'Oldie Friendly'  Its not.\nI could not fit a SIM card into it. I am using my old phone again.",
            "Simple phone get away from the smart phone.",
            "I already have a smartphone but the radio works when it feels like. That is why I bought this phone as a backup for it's radio. I had a very old Nokia which I used for it's radio, but the volume was fading. And evidently  it Pack up, but this phone is good, Very easy to work.",
            "Very good phone, battery is great!! Excellent affordable price too!! Thanks!!",
            "I just needed a phone at short notice as my smartphone broke. It was needed, so family members could reach me (which I am sure is important to everyone during these times). Messages are easy to send as well as come through easily. The battery life is excellent and it has a nice tactile feel to phone itself.\n\nA very useful phone to have.",
            "Great little phone as a basic or spare - great battery life, simple to use",
            "If you need a basic cheap phone this is for you.",
            "The item is simply an upgrade to my old phone. I use it for text/phone and take photos. However, there are no instructions on how to take photos, I’m not very good with technology, I would be grateful for some guidance on how to use this phone.",
            "the sound is very clear and its the best mobile ever !!!!!!!!!!!",
            "good basic phone which is what I wanted",
            "Small, Lightweight, Basic, Functional mobile phone for making and receiving calls.",
            "If you're looking for a basic mobile phone.  A SIM free Nokia 130 is having all features you may require.  It is light, easy to use with loud speaker and camera on.  It is an unlock phone and suitable to use with any 2G network.  A full charge is taking about 1hr45min.  Having it I can make a clear call or texting friend and family whenever I needed.",
            "Great little no fuss phone for texts and calls , purchased for a 76 year old he loves it",
            "Does the job without the hassle of contracts, emails, www, 3-5G, social media and all the other rubbish!",
            "Basic phone- ideal for a kids 1st phone. Enough little things like radio and camera means they are happier with it than a more basic model even though it’s not a smart phone",
            "Got this for my mum who is now in her 80s and cant operate touch screen devices. She is able to press up and down key on the phone to select numbers from the phone book and hit dial. Easy!\nInserting the mini USB charger the correct way up can be a challenge for some people.\nRingtone could be a bit louder but call quality is loud and clear, I tried the Alba phone but it gave up after 6 weeks and wouldn't charge the battery. Stick with Nokia for reliability.",
            "Perfect replacement for old Nokia 108. Reception is very good, and calls are clear, and loud enough to hear over background noise. Controls are classic Nokia, and fairly intuitive. All the basic functions I need are included - phone, text, clock with 5 alarms, calculator and torch. Radio and mp3 player both work well, and are a welcome bonus. Small enough to fit into pockets, but big enough screen and buttons. Best of all, the battery lasts almost 2 weeks on a full charge.",
            "I bought this 'simple' 2G phone to replace an old Nokia X2-00 that did not work with the current Virgin sim swap. My new Virgin purple sim worked straight away in this device - it really is a little beauty. There is a radio, a music player and a basic camera that's quite adequate for taking snaps. I recommend this good value mobile to anyone who does not need a smartphone. Definitely worth 5 stars.",
            "Perfect, basic mobile. No predictive text.",
            "This was a birthday present for my mum to replace her old Nokia that had given up on her. She didn't want a smartphone and this had everything she had on her previous phone so she is very happy with it. And her battery lasts for ages too\nWould recommend if you don't want a smartphone",
            "The phone is ideal for my needs and to use is not complicated. At a reasonable price one of my better purchases.",
            "Bought this for my 79 year old mother in - law. We set it up for her, she loves it. Easy to use, quite a large font, so can see texts and numbers easily.",
            "as i don,t know how to use an i phone these phones are great for me",
            "Perfect first phone for my sons. Trusty old Nokia!! Extremely good battery life!",
            "Just basic phone for my uncle who is around 80 years old",
            "I needed a basic phone which would work with the new Virgin purple SIM, and this one does. It is easy to use, with a good range of features, including camera and torch, but it doesn't have predictive text.",
            "This is exactly the same one as what I bought one year ago, of which I broke the screen when dropping it to my car key in a box. The input of this one is no as good as C1 which I had before, but I only use it for calling or receiving calls and text, so it is ok. What I got from the tore looks like a refunded one and there's still records of call and some old messages with it.",
            "IT WAS SO SIMPLE AND QUICK TO OBTAIN MY NEW PHONE FROM ARGOS",
            "A basic phone for text and calls just right for my 75year old dad.",
            "I bought this phone because I wanted a basic, SIM free phone. It only took a short time to get used to it, even though it was different from my previous phone. I am happy with it, except for it only having 10 reminders in the calendar.",
            "This is a very neat, basic phone which is very easy to use and good value for money.",
            "Good mobile phone specially for kids or elderly",
            "Very small and buttons to match",
            "No frills, no fuss phone for calls and texts",
            "Excellent basic mobile to replace existing damaged mobile. Best price found on internet search",
            "I do not want or need a 'Smartphone'.  Spent several years working on developing them for NEC.  Won't have one, or  do phone/PC banking -  a common reaction with people that work in tech.\nSo, just wanted a basic phone to put my SIM in.  Surprised to find so little choice for 'old' sims, 7, I think.  But am pleased with this, works fine.",
            "A great value for money Mobile that delivers exactly what it says it will do. Easy to set up and use. Would recommend to anyone looking for a good quality basic Mobile.",
            "Works well brilliant battery life would highly recommend this",
            "It was the middle of the Corona Crisis and my phone stopped working - absolute panic set in and I bought the first phone I found!  If you are looking for a cheap burner phone - or something to keep you going until the next Samsung comes out - this does exactly what you expect!  Calls and messages are easy to make and the battery life is good!  It won't rock your world - but it does what is needed to keep you in touch!",
            "This is my second Nokia 130 and it only replaced my original because it has sim free capability, allowing me to use abroad it in zone 2, after obtaining a local sim card. It is simply a basic (almost) mobile phone that makes and receives calls and texts, nothing fancy but does the job. it is small enough to tuck into in a small pocket, has decent battery life and thankfully no internet capabilities. what`s not to like.",
            "Lovely and easy to set up and use. Perfect for my elderly friend who doesn’t like smart phones.",
            "Does all necessary functions, simple to use, very pleased with it",
            "I needed to access the User Manual which is available on-line but that is not a complaint.\nI found the phone to be a nice piece of technology with which I felt very comfortable.\nI have tried quite a few of the functions with very little difficulty.\nIf a phone is needed for basic functions this is just the job.",
            "The mobile phone is basic, but that was what I was looking for. Provides a means of being in contact without the unrequired extras.",
            "This phone is naff. The centre omni-directional button is really poorly designed. If you have hands bigger than a 2 yr old, you’ll need long pointy nails. You got trimmed nails and beefy hands? Forget it. It’s almost impossible to use the centre button without pressing up/down/left/right at the same time. I couldn’t even compose a text without pressing the wrong button. I don’t see anything on the box that says “only for women with long nails or kids” so being returned as not fit for purpose!",
            "Bought this for 80 year old who is not very tech savvy. They have found it easy enough (not everything) and very much like the loudness of the volume which they had difficulty with on last phone. Good size in the hand, great battery life on screen commands can cause little confusion when trying to text but overall good value",
            "Great little phone. Easy to use and has all functions you need to make phone calls or texts. Thankfully hasn't got internet. Great battery life, bluetooth compatible to use with bluetooth headphones of your choice for phone calls or radio. A little pricey.",
            "it is just what my wife needed",
            "I wanted a phone that didn't have an internet connection and this phone seemed idea, it was sim-free. However, I had to buy before finding out it was restricted to 2G and my granddaughter's network basic level was 3G, so it was returned as unsuitable. It is a nice, handy little phone, just not suitable for our chosen service provider.",
            "A cheap handy no nonsense phone for an elderly person. Simple to use with a long battery life.",
            "Nice & easy to use good cheap phone",
            "Basic, but functional. Good sound on the MP3 player - worth playing the small extra amount to upgrade from the Nokia 105. Fantastic battery life. Bought as a back up for my son for when his smart phone is out of action.",
            "Cool and efficient for purpose",
            "Although small,it is easy to use.Handy when one is out and about,as it fits easily in the pocket.",
            "Arrived at the time they said\nPacking was good \nPhone was good value",
            "This phone does NOT work with All SIM cards despite ARGOS advice that it does.",
            "I was looking for a cheap phone for my therapy business and this has done the job well (calls, vm, and texts). Very nice basic design, very light, and the charge lasts forever. Be aware that the voicemail needs to be set-up as a call divert on the handset - you will need to specify the *full* vm number for divert to call i.e. +44xxxxxxx2222. Took me days to figure that out, so hope this helps someone else!",
            "Makes and receives calls and texts, what more could you want?",
            "Bought this phone for my Father who was struggling with his old phone that was touchscreen and had lots of features he didn't understand or was that bothered about.\nThis phone is durable, simple and made making calls and texts easy again.\n\nGreat little phone.",
            "Bought this mobile for my Mother-in-Law has a birthday present. She only wanted a basic one has she only makes and receives calls. She loves it .",
            "There isn't much to expect from this one, but does the job",
            "a neat wee phone does all thats required of it",
            "Good battery level stays more than 3days",
            "Purchased the phone for an aging relative who  missed the Tech train.\n\nSimple to use, great battery life, and does what is say on the tin - recommend!",
            "I purchased this mobile for somebody who just needed a very simple model to make and received calls.\nIts easy to operate, and basically 'does the job'\n It is also reasonably priced",
            "Great easy phone to use for someone who isnt very \"tech savvy\"",
            "Nice phone and very easy to use!",
            "Just what you want for making cheap calls and taking pictures, cant beat it",
            "Absolutely useless.......\nBrought an orange 130, returned it and then a black one and neither will accept my SIM card \n\nSo if you want a cheap phone to take your SIM card don’t bother",
            "Small plain phone easy to send text phone coverage and clear to hear",
            "this is a very good mobile for the money and it does what you need it to do make a mobile phone call",
            "This Nokia is very similar to the old school Nokia's,  easy to use. Good battery life and quite durable.",
            "Not very good for storage of photos and can't save photos",
            "Bad products  returned",
            "good phone for the money",
            "My wife's old emergency PAYG Nokia's battery had died. needed another basic Nokia to replace - SIM card swap only. this Model 130 was ideal -easy to use - low price - better than your competitors prices. Your in-store customer service is very good.",
            "Screen a bit small otherwise good phone.",
            "Good style and size covers most things you need to keep in touch with others",
            "It's ok, like with any phone some things are better than the last one you had and some things are worse. I don't think that it's good value for money though, not by any stretch of the imagination. I've said I'd recommend it however, that's only if; like me; you couldn't find anything cheaper & so have no choice.",
            "Just what I wanted for my children for school",
            "The phone is great for a spare. Battery lasts days and it’s easy to manage",
            "Good. Does what i want it to do",
            "For a basic phone this ticks all the boxes. For smaller fingers easier to use than a larger hand.. For phone calls and texts good value pity the instruction leaflet isn’t a bit more detailed.",
            "Bought this for my elderly dad and its great totally user friendly and great for a techniphobe.",
            "I did not want a smart phone so I got this little NOKIA 130 its great for what I require.",
            "this phone is a replacement for one that was lost love it for ease of use and the battery lasts a long time before it needs recharging.",
            "works well basic phone picture quality could be better and more free games but is a good phone",
            "Fantastic value for basic phone, battery life good but camera very average. Also needs sd card to save photos but on the whole excellent value.",
            "I was looking for a new phone on line at Argos I saw some good mobiles \nThat Argos was offering i could not make my mind up which one to go for until I saw the good reviews about this product and I have only  had this phone for three weeks I can see why it’s had good reviews.",
            "the phone is very good simple to use brought this one as similar to my old one prefere the push button type as i do have problems swiping to much static i think only fault i have with it is i have biggish fingers and and as the buttons have mulltiy functions i sometimes have problems but other wise i am well pleased thanks.",
            "realy pleased with this phone which replaced one similar nokia phone in 3weeks have only charged it once",
            "Love the phone didnt want an all singing and dancing thing!! Just wantex a phone to make and receive calls from..",
            "This phone was perfect for my Nan. She wanted a simple Nokia brick with a camera and its simple and easy for her to use",
            "Long lasting between charges. Nothing fancy - perfect if you don't use Facebook etc.",
            "very pleased with phone, simple to use, and excellent service at Rayleigh Weir store great customer experience thank you.",
            "Excellent Value, decent features and superb battery life",
            "I needed a phone that takes 2 full size sim cards. One Vodafone and one T-mobile. Both phone numbers I have are  7 years old and I couldn't change the sim cards without changing the phone numbers . So this phone does perfect for calls and texts. I have a smartphone for Internet and e-mail. 2 phones are far easier to do what I need. Than all been tied up on one phone.",
            "If all you want is to make and receive calls then this is fine. Got as a work phone for my husband but its so small and light its hard foe him to use. Would be fine for a child as an emergency contact phone.",
            "We bought this so my disabled husband could ring if I wasn’t here as numbers are easy for him to see as he can’t always get to the house phone",
            "perfect for what i wanted i for . basic but definatly does the job. battery life perfect . light weight and easy to use",
            "Purchased for my wife. Excellent button key phone as easy update from older device. It has adequate text, call and camera features including sd card expansion. Phone access to internet was not required as this is already available on other devices.",
            "Simple to set up and operate. Does almost everything I want it to.. Bluetooth particularly good. Only disappointment is that it has no timer option, which previous Nokia phones had.",
            "My phone working really well",
            "If you have problems using the most up to date phones, this phone is for you,as it’s so easy to use.",
            "Easy to use phone, especially if you don't need 'smart' features like going on the internet..",
            "Great bit of tech that fits into shirt pocket, hours of battery life. No worrying have I packed the charger.\nFull of features if you need them!\nExcellent quality for small price,",
            "After the demise of nokia there was a death of decent cheap phones.\n\nFinally this one does what it says on the tin... its a ohone... it works.",
            "Great little phone, very easy to use for calls and texting. Battery lasts all week. Only let down is the pixel quality of the camers",
            "okay nothing special",
            "I only wanted a simple mobile, to send texts, make/take calls and use video/take pix.  The phone is a bit of a let down in that, to take pix or video, you need to use a memory card in it.  I assumed the memory card was simply an option, but pix will not be retained without one.  For the basics - text, calls, alarms - its fine.  The games are a bit rubbish.  All in all, it'll do.",
            "If all you want is to phone people and not much else then this is ideal.",
            "If you want a simple phone that's easy to use then this does the job.",
            "Bought for my 10 year old as a first phone, excellent value for money.  Love nokia phones, tempted to get myself one!  Charged it up for him before Christmas, still has half the battery charge!!  Took him a while to get used to actual buttons but is easy enough for him to text and make calls."
        ]
    }
}