{
    "856/5884": {
        "remotekey": [
            "856/5884"
        ],
        "item_category": [
            "Stylish and easy to use, the Doro 6040 has everything you need for everyday calling, messaging and sharing photos with family and friends. The clamshell design prevents against accidental key presses and lets you answer and end calls with a simple flip. And you can feel safer with the direct help when using the Assistance Button by Doro. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "101 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "97%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "31 July 2021",
            "21 July 2021",
            "21 July 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "15 June 2021",
            "9 June 2021",
            "8 June 2021",
            "2 June 2021",
            "2 June 2021",
            "20 May 2021",
            "19 May 2021",
            "5 May 2021",
            "29 April 2021",
            "28 April 2021",
            "28 April 2021",
            "28 April 2021",
            "13 April 2021",
            "13 April 2021",
            "7 April 2021",
            "7 April 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "16 March 2021",
            "7 March 2021",
            "3 March 2021",
            "3 March 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "18 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "16 February 2021",
            "10 February 2021",
            "9 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "2 February 2021",
            "27 January 2021",
            "26 January 2021",
            "14 January 2021",
            "12 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "4 December 2020",
            "3 December 2020",
            "2 December 2020",
            "2 December 2020",
            "1 December 2020",
            "25 November 2020",
            "25 November 2020",
            "19 November 2020",
            "18 November 2020",
            "13 November 2020",
            "10 November 2020",
            "5 November 2020",
            "29 October 2020",
            "28 October 2020",
            "23 October 2020",
            "22 October 2020",
            "21 October 2020",
            "20 October 2020",
            "15 October 2020",
            "14 October 2020",
            "14 October 2020",
            "14 October 2020",
            "13 October 2020",
            "7 October 2020",
            "7 October 2020",
            "16 September 2020",
            "2 September 2020",
            "2 September 2020",
            "2 September 2020",
            "26 August 2020",
            "25 August 2020",
            "20 August 2020",
            "19 August 2020",
            "19 August 2020",
            "18 August 2020",
            "13 August 2020",
            "12 August 2020",
            "11 August 2020"
        ],
        "review_title": [
            "SIM Free Doro 6040",
            "Easy to use",
            "Mostly great",
            "Easy to use",
            "Doro 6040",
            "Brilliant phone",
            "Stylish but basic",
            "Great wee mobile ,easy to use",
            "Ideal replace",
            "Great",
            "Excellent non-smart phone",
            "Ms Joan parkes",
            "brilliant",
            "Good features, easy to  use.",
            "Great phone!",
            "Brilliant Phone",
            "Ideal phone for people who don't want a smart one",
            "Great mobile phone",
            "doro phone excellent",
            "Mobile phone",
            "It's a phone",
            "My mobile was brill big numbers",
            "Easy to see large letters and numbers,perfect.",
            "Solid",
            "Excellent for elderly",
            "",
            "Easy use phone",
            "My mobile",
            "Such s simple phone to use.",
            "Easy to use",
            "Easiest phone to use",
            "Has everything I want.",
            "Nice easy to use and set up",
            "Handy phone, easy to use",
            "good value for money",
            "Great phone for anyone looking for a simple phone",
            "Simple Phone",
            "Perfect phone for my elderly Mum.",
            "hard of hearing, elderly, learning difficulties",
            "Nice looking phone",
            "Uncomplicated. Doro 6040.",
            "Doro 6040 Basic looking phone",
            "I bought this for my mum who is hard of hearing",
            "For people that just want a phone",
            "GREAT LITTLE PHONE",
            "",
            "Does not work, waiting for store to open back up t",
            "Ideal for my mum",
            "This mobile is perfect for me.",
            "",
            "My mobile",
            "Great compact phone",
            "Mobile big numbers and rings loud",
            "uncomplicated phone for my wife",
            "t",
            "Great little phone",
            "Looks great, does what it’s supposed to do.",
            "Easy to use phone",
            "Simple small phone",
            "Easy to use",
            "Dora phone brilliantl",
            "Great for father with illness",
            "Replacement",
            "Brilliant easy to use phone",
            "Bought this for my mum and she absolutely loves it",
            "Really good phone for your gran.",
            "Nice and simple phone for my grandad!",
            "Just the Job",
            "Great flip phone",
            "Perfect for my Dad!!",
            "Easy to use",
            "My Dora phone is easy to use.",
            "good mobile for old people",
            "Smart looking phones",
            "The phone was better design than our previous one.",
            "Great little phone",
            "Excellent simple handset for my elderly mom",
            "the doro 6040 is a brilliant phone",
            "Bought for elderly parent.",
            "Nice small phone.",
            "Good mobile easy to use",
            "battery not last long",
            "Great size phone",
            "reliable phone.",
            "My Doro mobile phone is exactly what I wanted",
            "Not as good as original",
            "Behaves like a phone",
            "Smart phone for general use",
            "nice telephone",
            "Great wee compact phone",
            "Good all round phone",
            "Instructions could be much clearer and fuller.",
            "Ideal for people my age.",
            "simple phone",
            "Flip phone",
            "Very satisfied worth the money .",
            "This is a great phone, I am going to buy 1 again.",
            "Great phone",
            "My phone not only looks great it also works great",
            "Fantastic phone for elderly",
            "Doro mobile phone"
        ],
        "review_text": [
            "very good phone a bit larger than the older Doro Mobile Phone",
            "A nice sized flip phone with clear numbers and very easy to set up. Lovely camera too .",
            "Big keys, good screen display, quick. For the price though I did expect slightly more. My old flip phone had a media player for music - this doesn't. The only up and down buttons are a bit annoying as you can't go across. It is basic and the for price I did want a little bit more but overal not too bad.",
            "Has all the features my parents require",
            "I have had a Doro phone for a while, this is my 3rd and bought this after reading other people’s reviews. It is really easy to set up and use especially as I am not tech savvy. Thoroughly recommend.",
            "I got this phone for my grandad . And it’s brilliant!! He can see the numbers and finds it very easy. And the price is good value!",
            "Exactly as ordered, except my SIM card was the incorrect size, so sadly had to return for another Doro.",
            "Bought this for my brother as he needed an easy to use phone and quite large buttons as he messages a lot ,Hes had one before and loves this style .",
            "Easy to use as a pay as you go phone, no complicated internet to navigate.",
            "Just exactly what we need",
            "It's well-built and the battery life has been good so far. The dual SIM facility enables us to have a UK and a Spanish number on the same phone.",
            "I bought this mobile because iam happy with it I bought before so easy to use",
            "great phone.easy to use.big screen for easy reading.as all the features i want",
            "I bought this three weeks ago, and it replaced a broken mobile. I hope it lasts longer than a year.",
            "Purchased this phone for my elderly father, he's 84. It was very easy to set up and is just as easy to use. It's very basic but with large text and buttons it's great for older users.",
            "I purchased this as a replacement for my 80 year old dad. He has had a same phone for a number of years and likes what he likes so this phone really does it for him. Easy to use with loads of features. so far the battery has been brilliant and with a charging cradle it is so easy for him to ensure a good charge. Happy to recommend",
            "Good service, easy ordering, good delivery service, in fact everyhting good about Argos and the phone is brilliant bought for my husband who is not Tec savvy, and he found it easy to use. one up for Argos and one up for Doro.",
            "A great mobile phone which was bought for my elderly mum who has hearing aids. Settings allow the phone to be used with hearing aids",
            "This is my third doro and it is even better. The screen is wider and more crisp\n\nhighly recommend it",
            "The phone was for an elderly lady who is partly deaf and she finds it easy to use and hear",
            "Bought this for the mother in law, she likes it,",
            "Easy to use, big numbers what I needed, good value for money and easy to set up",
            "Perfect for  me, large easy to see letters and numbers,and easy set up.",
            "Great for those that find mobile phones difficult. Great for those that do not use mobiles very often.",
            "This handset is easy to set up and use. It does what it says it does. The only reason I gave 3 stars for features is because they are limited but they are all my parents require. My parents have used Doro handsets for some time now and thus handset was bought to replace an older model. Very pleased with purchase and recommend highly if the basics and no frills are required.",
            "This mobile was purchased for a 92 year old lady with partial sight and hearing loss.  \nIt is ideal.  5 stars",
            "This phone is compact easy to use nice big numbers, Other options are easy to find.",
            "This is ideal for the older person.Very easy to set up and use, no Internet of course but if you need a basic phone to just make and receive calls, l can highly recommend the DORO range.",
            "This is a good looking flip top phone. Very simple to use, with camera, good size font for txt, and the battery lasts for a few days.",
            "Got these phones for parents as they are not very technical and are very easy for them to use.",
            "This phone is easy to use, it is so simple. The ringtone could be louder but other than that it's efficient and simple. Just what my mother in law needed.",
            "Basically I needed a mobile for phone calls and texts, nothing more.  This fits the bill perfectly, with the bonus of being able to take photos.  Nice big keys, reasonably sized screen, perfect for me.",
            "I bought this for an elderly friend.  They find it very nice and easy to use.",
            "I've had similar Doro mobiles before and got another one because they are handy to use and easy to navigate.",
            "Does exactly what I want a phone for. Very suitable for those of us who are hard of hearing and want a simple phone to make calls and send messages.",
            "Great simple phone, loud ringtone, for a basic phone it's brill",
            "Purchased for my mother who is vision impaired. Phone is simple to use and is great if all you need it for is phone calls. Much easier to use than a smart phone.",
            "Easy to set up, easy to use for my elderly Mum. Charging cradle that comes with it is perfect.",
            "Easy to use for elderly or learning difficulties or hearing problems. Nice looking phone with a good battery and signal.",
            "This is a nice looking phone bought for my mother to replace an earlier model. Unfortunately we are going to have to return it as it won’t connect to the Three network",
            "The Doro 6040 mobile ‘phone bought for my wife replaced another Doro model unfortunately accidentally damaged beyond repair.\nWe have both used Doro mobiles for a long time and find them totally suitable to our older/non technical use.\nVery simple to use.and totally reliable unless dropped from a considerable height onto a tiled floor.",
            "Purchased for an elderly person in hospital who had no experience of using a mobile phone. The easiest way to use it is just open it, dial the number and press green to call and then red to hang up rather than navigating through the menus. But as simple as it sounds for someone not used to a mobile they keep pressing the volume buttons on the side while holding it and turning the volume down,(not realising they've done it) and then they can't hear it... they're slowly getting used to it.",
            "Very good if you want just a basic mobile, bought for my 83 year old mum who's hard of hearing and was in hospital and it was perfect for her",
            "I bought this for my father-in-law (81). He doesn't like change or technology but wanted something simple and easy to use.  He has vascular dementia and alzheimer's.\nSimple flip up phone that when programmed gives one or two touch connection to family and friends. \nGiving us reassurance that we can contact him and he can contact us.  \nBattery life lasts a long time as it is rarely used and it comes with a simple charging dock.\n\nGreat for people who just want a phone.",
            "Got this for my Dad who is not Tec savvy it’s easy to use big numbers and loud ring tones. \n\nSo just for a phone it’s great he doesn’t need to text or take photographs. \n\nSolid phone good price",
            "My 87 year old mom loves it & finds it very easy to use.",
            "Says its open to any network. This is not the case, does not work at all on any network, waiting for shop to open back up then I am going to get a full refund",
            "Bought for my mum as she struggles with non flip phones\nThis is the updated version from her previous one \nVery good perfect for Older generation I think",
            "I had a Doro phone for about 6 years, I only bought the 6040 because the battery on the old phone was a bit weak. This new phone is an improvement in every function. I just moved the sim into the new phone from the old phone , and all my contacts were saved. I use the alarm to wake me up each morning. I am now testing the camera in different conditions, and can send a picture, I have just taken to my daughters phone. I am pleased with the phone.",
            "excellent phone Really good for its money",
            "Easy to set up absolutely fantastic phone",
            "Great compact flip phone with large buttons and large screen.\nLoud beeps and signals for the the more elderly person.\nExtremely easy to use.\nA good phone all round",
            "This was bought for my 89 year old mum, the buttons are big and the ring tone is loud also,to message it is very easy also. Great buy would def purchase again.",
            "Have been searching for a small, uncomplicated phone for my wife for around 18 months, this one fits the bill and she is really happy with it.",
            "Easy to use phone for older person who only needs calls and texts",
            "Bought for my husband who only likes to talk lol .\nEasy to use would recommend it",
            "Bought for mother (93). Like safety features and worth it for peace of mind. However only works on 2G so needed to buy another SIM. It would have been useful to know that!!",
            "Purchased this phone as I did not like my 'smart phone'.  This phone does everything that I want it to do - phone calls, text and has a good camera.  Very easy to set up and use.",
            "This was bought for a elderly relative who wanted a simple easy to use phone for emergencies. Up to now she hasn’t had any problems to report.",
            "Great phone essy to use",
            "Brought this phone for my mum loves it so simple to use and my mum loves it and it is so easy to charge as well as it has a docking station to put the phone on to charge",
            "Bought this phone for my dad who suffers with MS and Alzheimer’s. large buttons and ease of use make this phone great for him to use.",
            "Was got for my elderly dad to replace his old one. Simple and easy for him to use",
            "My husband needed a new phone as his broke after years of use ( that was a doro phone ) , needed easy to use , loud ring numbers large enough to read easily , not too near so easy to use . \nI have been looking for a few weeks this one really ticked all the boxes , he was so pleased with it . Manages it so well . Very easy to set up , instructions are so clear . \nDesign means buttons can’t be pressed by mistake which is a good idea",
            "Mobile is exactly what I was looking for keyboard is smart but easy to use and elderly friendly (according to my mum).\nWould definitely recommend this for other like minded users.",
            "Really good phone for all you older people it looks good slips in your pocket nice . Good value great keys for shaky fingers.My nan is very fickle even she gave it a big thumbs up . If your looking for a good pressie for someone you care about this will sure make someones Christmas.Go for it.",
            "The batery life could be a but better but it does state thay it needs to be fully charge more than once to get the full battery life which i have not been able to do yet. Simple to use and perfect for older people.",
            "Bought for an elderly relative and gone down very well. Apparently good crisp sound, clear buttons and easy to operate. Just needed phone calls and texts so perfect and emergency features a useful plus!",
            "My husband doesn't like smart phones he's very happy with this phone which replaces a similar phone he had for a long time",
            "Bought this as to upgrade an old Doro. Dad is really pleased with the clearance loud sound, the simple functionality and the bigger screen!",
            "Wanted a basic phone for my mum\nGood largebuttons and the volume is good especially for the hard of hearing\nEasy to set up\nCant comment on the battery but seems to last well",
            "I like the Dora phone because it isn't complicated to use. This is the 3rd one I have had over the years.",
            "This is a very good design for the less tech proficient. Also good for the hard of hearing.",
            "I bought one for my wife, I was so impressed, I bought one for myself. I stopped using my alarm clock and use the phone instead, excellent.",
            "The 6040 Doro is an ideal phone for older users especially with sight and hearing challenges.Very easy to set up.Highly recomended.",
            "This is a great little phone.  i just wanted a simple phone to make calls and message.  It does do more but I want to keep my phone free from unwanted calls so never use the internet on the phone and so far haven't had any spam calls. I had an apple phone but it was too heavy",
            "My mom who is 86 and partially sighted needed a simple to use phone that she could use with ease. This phone was ideal.",
            "doro 6040 phone is a brilliant phone and i like that its clamshell/fliptop works for me",
            "Bought for elderly parent for emergency use. Does everything required. Easy to set up & use. Can’t answer about battery life as not been in use long enough.",
            "Ideal for the person who wants a simple to use phone. My previous phone was being continuously activated inside my handbag or pocket due to the buttons being exposed.",
            "Phone delivery was efficient and \nthe phone is very easy to set up. \nIt is ideal for anyone wanting to use \njust for phone calls and the \noccasional text message.\nPhone is well made with a clear keypad excellent for seniors.",
            "the phone is OK,but battery doesn't last long,Argos do not say what sim it takes so I spent days trying to get the correct sim for this phone,so was left without a phone for a week,it takes two sim cards,but you only need to use one,the other is for more storage,it takes a micro sim card",
            "Great phone its got everything I need love it",
            "I'm a year away from sixty. I grew up in a world that was simple. Now we've gone into excess. We want more than we need. The phone is easy to use, and it has everything I require. Just one slight problem. Maybe a longer battery life. Other than that, I am pleased with the produce. Thank you.",
            "As I needed to replace my phone  the Doro mobile phone is exactly the right combination of things I want it to do and is a no frills, so easy to use phone!\nThe service from Argos and the delivery were excellent too.",
            "This was to replace an old Doro phone. I loved it because I depend on my reminders daily. This phone differs in the fact it holds fewer reminders. After putting in important dates there is little room for daily reminders. Aside from this it is a great wee phone for those of a certain age. I cannot use smart phones and do not need all they offer. This is perfect. I can phone and text. That’s all I want.",
            "This is a good quality phone. No all singing and dancing features , which is exactly what I wanted! Highly recommended if you want a basic functional mobile phone for calls and texts plus a few extras. Also very easy to use and understand.",
            "An excellent phone for one with poor eye sight. Easy to use.",
            "it is easy to use and clear sound",
            "Great compact phone my elderly mother loves it so easy to use .",
            "Excellent phone for my needs",
            "A good basic phone which is what I wanted but the instructions for use should be much fuller and clearer particularly for the elderly.",
            "Comfortable in the hand and easy to operate and read.",
            "sorry but it broke after i weeks use.",
            "The phone has a better battery life of its predesester and the bigger buttons easier seen and to press. Love this phone which has the emergency button on it as well. Thanks",
            "I am finding this phone very easy to use being 74 years of age I struggle with modern technology but this phone is easy to use and has all the functions that I need as I do have an iPad as well",
            "Easy navigation, great design - good features, this is the best phone on the market for the price. The standard level is high, good battery power. Email and phonebook data good capacity. This phone is very reliable and has a 2 year warranty.",
            "Bought for my Father who is in his 80's . This phone is perfect for him as he can see numbers clearly. It is easy to use and he keeps it in his pocket.",
            "My phone is essay to use and has great fetcher's well pleased with my purchase .",
            "This was purchased for my elderly father.  Large buttons provide easy use and can do all basic things that he requires, texting, taking photos and making calls.  Robust design.",
            "Very nice simple mobile phone for basic usage, no smartphone functionality. Very pleased."
        ]
    }
}