{
    "921/7856": {
        "remotekey": [
            "921/7856"
        ],
        "item_category": [
            "Xperia 10ii - Trustworthy in any condition. 6.0\" 21:9 FHD+ LCD large display allowing you see more and work smarter. Sony minimalistic design with IP 65/68 protection. 4GB RAM & 128GB internal memory so you have all the storage you need and excellent multi-tasking performance. Power throughout the day with a long-lasting high-capacity 3,600mAh battery for all-day use. Zero Touch compatible - Seamless setup and deployment of corporate-owned devices. Access sensitive business data securely with an integrated One-Touch fingerprint sensor. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "45 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "91%"
        ],
        "review_rating": [
            "3",
            "5",
            "1",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4"
        ],
        "review_date": [
            "31 July 2021",
            "31 July 2021",
            "30 July 2021",
            "24 June 2021",
            "23 June 2021",
            "9 June 2021",
            "2 June 2021",
            "6 May 2021",
            "21 April 2021",
            "14 April 2021",
            "13 April 2021",
            "7 April 2021",
            "6 April 2021",
            "1 April 2021",
            "31 March 2021",
            "30 March 2021",
            "24 March 2021",
            "23 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "23 February 2021",
            "10 February 2021",
            "20 January 2021",
            "14 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "29 November 2020",
            "26 November 2020",
            "19 November 2020",
            "18 November 2020",
            "17 November 2020",
            "16 November 2020",
            "11 November 2020",
            "21 October 2020",
            "16 September 2020",
            "8 September 2020",
            "19 August 2020",
            "12 August 2020",
            "12 August 2020",
            "12 August 2020",
            "5 August 2020",
            "4 August 2020"
        ],
        "review_title": [
            "A good mid-range phone",
            "Does all I need ..",
            "Very poor",
            "Slim so easy to use 1 handed",
            "Bought as a present.",
            "Sadly Sony is loosing it's customers.",
            "Amazing phone",
            "Great phone",
            "Nice display",
            "first class phone",
            "Phone is great",
            "Easy set up and transfer from my old phone",
            "Xperia 10 ii",
            "A great phone",
            "The Sony Xperia 10 II Mobile Phone",
            "",
            "I expected better",
            "Sony Quality",
            "Excellent battery life",
            "Does what it says on the box",
            "My phone has revolutionized my life",
            "It's looks smart",
            "Good phone easy to use",
            "Great quality and speed",
            "lovely phone",
            "Lovely phone",
            "Not soo good!!",
            "A perfectly functional phone but with some marmite",
            "Excellent new phone",
            "Excellent Mid Range Phone",
            "Love my New phone",
            "Upgraded from Xperia Z5 Compact",
            "",
            "Looks fab and battery life is good",
            "Amazing",
            "Great phone for its price point",
            "Good phone for the price",
            "My phone look good & working extremely well.",
            "Great new phone at an affordable price",
            "Great phone overall",
            "The phone is fantastic",
            "Very good phone for price",
            "Good spec phone and not too big",
            "Fast and good battery management",
            "The phone's amazing and battery life is good."
        ],
        "review_text": [
            "This phone is \"ok\". For the price I would have expected a much better camera. However, the handset is a good size. A good mid-range phone.",
            "This is my second Sony phone they seem to last longer than Samsung in my experience.\nOnly downside is the camera in some lighting situations it's not marvellous, but it's adequate.\nNo regrets so far buying this phone..",
            "I purchased this product just over a month ago and have had nothing but problems with it",
            "As usual,the Sony handset does everything I want, though the software has changed since I last bought one in 2017.",
            "Bought for a family member who was over the moon with it.",
            "Been a Sony FAN for awhile. Optimistically, I still hope to see Sony ruling the market. Returned the product the very next day. When compared to the market, there are lot many options that beat Sony in every sense for the same price.",
            "I bought this phone from my wife and she was so happy.",
            "Great phone had Xperia for years so know system well. One little minus is that the phone is smaller than my old one so little bit tricky but just need to use to it. Apart of that money we'll spend.",
            "Good phone for price, very good display with good contrast and colours.\nIt is easy to use with just one hand. Nice pictures and easy to use due to  last android version.",
            "Excellent phone and exceptional value for money.",
            "Brilliant phone. Easy to use. Storage is fantastic battery life is long lasting. Overall a fantastic phone",
            "Good sized memory and nice camera",
            "Really good phone for the price",
            "My previous phone was a Sony and they are clearly superior to others so it was a no-brainer to go for another Sony when I wanted to upgrade. I was slightly worried about going for a larger phone but this one is about right - it even takes great pics in 21:9 ratio which look fantastic! \n\nGreat hi resolution screen.\n\nOnly one speaker built it is a bit of a drawback, but not an issue if you use earphones.",
            "The product reflects the description and feature as advertised. From the point of purchase/order to delivery, it was all done speedily without any issue.",
            "Worthy for the price",
            "I expected better, bad camera, poor sound and there is no removal of background noise ana poor torch",
            "This is my third Sony mobile so I guess I'm converted!  I'm particularly impressed with the longer battery life (so far) and the features are familiar but improved.  The camera is particularly good.",
            "Brilliant phone, battery life is very good last ages\nDecent size screen, not heavy at all , fits in my pocket , could really say best phone I've had, and I've had a few, 10/10",
            "Looks good,feels good, comfortable to use ,can't fault it.",
            "The price was fair compared to other shops I'd looked at.The delivery was timely and package was intact.",
            "Well the main thing is that phone is good.  Looks smart and not too big. Smart futures good camera. \nNegative is that, that there's no handbook, where you can look for information. Because from previous phone, there is different options and not clearly stated ,for example - where I can found messaging signal change. It took me a while, while I found it. Still there's things which I need explore.\nOtherwise phone is good.",
            "Very good camera good easy to use phone",
            "The design is a bit long but actually is really comfortable for reading and editing documents. The speed is superb and I’m happy with the image quality and battery charging and capacity. \nThe only thing I found a bit disappointing is the speakers , the max volume is below what you expect for similar phones but overall I’m happy with my new companion. I changed from iPhone as I definitely prefer the freedom of the android apps and the screen quality from Sony.",
            "1st Sony Xperia I have owned and I love it. well worth the money and would recommend to anyone.",
            "Really pleased with this phone,only issue online it said it was contactless charging compatible but it's not.",
            "It's looks nice but after two days the display gone. Two green lines appear on the top and bottom of the display. \nI can't recommend it because there is no any guarantee for the other phones from the same partition!!",
            "This phone replaced an LG G6, a flagship model from 2017. Nowadays mid-range phones have more than enough power to cope with the Web browsing, rope cutting and bird flinging that I like to do.\nThe performance, screen and camera are all fine. The screen has no notch, there's an audio jack and the SD card is easy to get to.\nLess favourable are the screen's aspect ratio, accessibility of software features (multitasking and audio path especially vs. my G6) and compatibility with my Fitbit Versa 2.",
            "Quick purchase and collection during difficult times. Great value and choice. Excellent parking to collect.",
            "After looking at all the reviews for a midrange phone, this phone fit what I wanted. The headphone jack is a must for me, the battery life is now 2 days plus some. Great camera, great viewing experience, great price for what you get.\nThe only thing I will say, is I find the phone ratio a little long- not for handling, but a lot of the shows and apps don't fit the entire screen- so black edges.\nBut that's really all there is to it. \nSony is a massively underrated mobile product",
            "Love it, good quality and very sleek",
            "Bought this as an upgrade from a 4 year old Xperia Z5 Compact. It is not a compact model but is a bit smaller than most which suited my preference. I prefer the Sony versions of the Android interface to the Samsung even since my first Sony (Xperia Z1 Compact) phone. Well presented graphics, camera is good, fits in one hand much better as it is narrower than many other full size phones.\nIf you want to upgrade to a compact format but can't find one, this is the next best thing.",
            "Good phone, very nice design,to slim,easy to use.",
            "I've always liked Sony phones they are the best",
            "An amazing phone and was available to collect earlier than it said.",
            "Great phone, works really well and it's the evolution I needed from the previous Sony I had.\n\nOnly drawbacks are the fingerprint sensor, can be a bit slow at times, and the pic quality is sub par. This is a common issue with Sony phones but manageable.",
            "Android 10 has some good features and I think this will be upgraded to Android 11. This phone is good value for money, the battery life and camera are good, speaker is okay but max volume is rather quiet for audiobooks, podcasts etc. The torch is utter trash and doesn't have any brightness options unlike some other phones, but that's not really an issue for most.",
            "Extremely well.i like my phone.less money  better quality.",
            "Bought this after having the Xperia X for a number of years, I have no problems and Argos is always quick and easy to use. \n\nWoul recommend",
            "I really like this phone. The option to quickly switch to one-handed mode is particularly useful. The only downsides are that only Sony branded headphones seem to work with the headphone jack (although no problems with any wireless headphones), and the background noise blur seems to be overactive when used with the speaker, making speaker conversations a bit unclear. Also, this is the slipperiest phone I've ever had, so I'd recommend a phone case.",
            "The phone is beautiful and fanatic very easy to use, picture quality is very good",
            "Decent phone. Really like the Sony software. Side fingerprint reader is good however it does have a feature where it unlocks without pressing the button if you rest your finger on it which takes a bit of getting used to. Camera had fairly poor reviews but does the job for me just fine. It is fairly tall and thin compared to other phones I've owned which were a bit more square. Glass shell is very slippery without a case so I'd recommend one.",
            "One of my pet dislikes are all these humongous phones coming onto the market, I simply don't have any massive pockets to put them in. This narrow but tall phone seems to be a good halfway house, screen is big enough for most things yet it doesn't feel too big in your hand. Camera is good, battery life so far excellent. Would definitely recommend",
            "Slightly different from my previous Xperia in the layout of Apps but quickly got used to it. Battery life is excellent, not a heavy user but easily lasts all day with moderate use without the need to recharge. Sharp and clear screen, easy to use, and love the fingerprint sensor for logging in to both the phone and apps.",
            "The phone's amazing, the sound and pictures quality is great. Battery life is also really good. I really like this product :). The cameras are pretty awesome. The product design is amazing, and unique."
        ]
    }
}