{
    "943/6833": {
        "remotekey": [
            "943/6833"
        ],
        "item_category": [
            "Designed for the everyday creator, whether you're snapping selfies or shooting videos on-the-go, Neo will make these moments effortlessly epic thanks to the 50MP Ultra HD Quad Rear Cameras, a 32MP Front Camera. Keep your creativity flowing for longer, with OPPO's 65W SuperVOOC 2.0, which can achieve a full charge from 0% in as little as 35-minutes. Perform beyond with the powerful Qualcomm Snapdragon 865 Processor that offers rapid, responsive performance when gaming or browsing, and supports superfast 5G. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "13 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "92%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "24 July 2021",
            "21 July 2021",
            "7 June 2021",
            "4 June 2021",
            "31 May 2021",
            "28 May 2021",
            "28 May 2021",
            "28 May 2021",
            "27 May 2021",
            "26 May 2021",
            "26 May 2021",
            "19 May 2021"
        ],
        "review_title": [
            "Oppo Find X3 Neo",
            "You won't find a better camera system for less",
            "Excellent",
            "A Decent Phone",
            "Pretty good overall",
            "Fast and good phone",
            "Oppo X3 Lite",
            "Amazing camera",
            "this phone packs a punch",
            "Excellent phone",
            "Amazing phone , well worth the price",
            "Wow",
            "Great service"
        ],
        "review_text": [
            "I have had this phone for a few months now and can honestly say that I am extremely happy with it. The finish of the phone is outstanding, especially the grain style details on the back. It also has tremendous processing power and a beautiful high resolution screen. The integrated fingerprint sensor it far better than my previous Oppo Find X2 Pro.\nThe camera is also as good but on paper it's better although I don't entirely agree. \nIt has a cool features on the video camera the allow you to use both front and back cameras at the same time making a split screen recording.\nThe actual camera hardware also looks good and has been slim lined compared to previous models.\nOverall it is a good midrange phone that feels like a high end phone. It definitely shouts out premium quality.\nMost definitely worth buying.",
            "Too many cheaper phones cram in useless cameras, but the X3 Neo brings real versatility in photography, with OIS, ultra wide with AF, and telephoto. The Snapdragon 865 is still every inch a flagship processor and the device handles any task smoothly, whilst still offering impressive battery life. No regrets.",
            "Oppo Lovely phone, who cares about iPhone.  This Oppo is absolutely fast and great features. Full battery charge in 20/25 minutes. Excellent",
            "[This review was collected as part of a promotion.] The OPPO Find X3 Neo is a really decent phone. The camera takes some great shots especially during low lighting. I don't like the fact that the phone doesn't support external memory but it does come with 256gb of storage. I didnt find myself always charging the battery which i would say lasted about 2 days before i had to charge it again. I have to say I do love the design and the back of the phone doesnt get covered in my fingerprints. Unfortunately there are some other things that are missing that let this phone down; its not waterproof and there's no wireless charging.",
            "[This review was collected as part of a promotion.] I was looking forward to getting a 5g phone as its just started to be set up where I live. The cameras are good and take good pictures especially in darker settings. I also like that the camera in the screen is offset so it doesn't interfere with the viewing of stuff in landscape so much. The ability to fully charge in 35 minutes is impressive as is the thought that goes in to the packaging and items you receive in the box. Being a curved edge screen it comes with a screen protector already fitted and a case to help save it from everyday bumps.\nWhat I have struggled with is the operating system though, I'm so used to samsung that it has been hard to navigate the oppo version.\nIt's great that it has stereo sound, but what it's let down most by is the screen. It just seems to be a bit washed out in its colour representation, even in dynamic mode it doesn't pop as much as an amoled screen should.\nThe storage is more than adequate but can't be increased with a memory card and it only has one sim slot.\nOverall its a good phone, but left wanting for a flagship model.",
            "Very fast phone with fast charging 35min to full. Lots of customisation and nearly pure Android. Downside is Netflix preloaded and impossible to uninstall. Worth those money compared to other phones maker.",
            "[This review was collected as part of a promotion.] I have used Oppo phones for the past few years and the one before this was the Oppo F11 Pro. I love the features and android platform that Oppo have designed. It is really intuitive and easy to use. For years i used Iphones but i will never look back now i have found the light with the Oppo technology. I loved my F11 Pro phone but the Find X3 Lite is extra special. Much bigger memory and a seriously improved camera. The camera's on these phones are amazing and the camera functions are incredible for editing and adjustments. The screen size is perfect...nice and big and the clarity of the image is so so good! I would recommend Oppo phones to anyone out there... you will be converted!",
            "[This review was collected as part of a promotion.] I received this 3 weeks ago and couldn’t wait to try it, I was impressed by the nice size of the screen. It’s a very lightweight phone and looks very sleek and stylish.\nI’m usually more of an iPhone user but Theo’s android was very easy to set up.\nThe camera on it is by far this phones best feature, the pics are crystal clear and it easily rivals the iPhone 12 camera.\nIt’s dual primary cameras make every shot look like they have been taken professionally.\nIt’s definitely changed my mind about android phones and is much better value for money than the new iphones",
            "[This review was collected as part of a promotion.] For many years i have been a samsung fan boy - stuck with the brand and didn't look or try much else - till this little pocket rocket came along - the phone for me beats any other handset i have had prior from it's superb camera to it's snappy fast os - and the quick charge function is this day and age is a god send - as with previous phones my batterie had died and i had to wait and age for it to charge not with the oppo you don't",
            "[This review was collected as part of a promotion.] The Oppo Find X3 is a fantastic looking phone and on par with some of the more expensive models. It appeals on many different and relevant levels, whether it is taking great photos in any condition, having excellent specifications, being a stylish looking phone or great value for money. It has a lot going for it and has a good mix of hardware & software to please me. The camera is excellent and the screen is superb. Battery capacity is respectable and although it doesn't have wireless charging support, the super-fast charger means you get going again in under 30 minutes. \nWhile the phone is no game-changer, it certainly offers a lot. There aren't an awful lot of trade-offs to make and it performs solidly in daily use situations.",
            "[This review was collected as part of a promotion.] This oppo phone is incredible and well\nWorth the price. It’s full of a lot of tech that makes using a phone a lot easier and it’s a lot smarter than what I had before.",
            "[This review was collected as part of a promotion.] What a fantastic phone this is. The camera quality is outstanding and the operating system is seamless. It is a beautiful, sleek looking. with plenty of space for videos and photos. The video streaming is perfect. Such a great phone.",
            "I am very happy with my purchase"
        ]
    }
}