{
    "848/3203": {
        "remotekey": [
            "848/3203"
        ],
        "item_category": [
            "iPhone 12 mini packs big features in a 5.4-inch design. Incredible low-light photography with Night mode on all cameras. Cinema-grade Dolby Vision HDR video recording, editing and playback. Powerful A14 Bionic chip. 5G capable and new MagSafe accessories for easy attach and faster wireless charging. It's big news for mini. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "49 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "96%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "23 June 2021",
            "23 June 2021",
            "9 June 2021",
            "2 June 2021",
            "20 May 2021",
            "19 May 2021",
            "5 May 2021",
            "4 May 2021",
            "4 May 2021",
            "29 April 2021",
            "28 April 2021",
            "20 April 2021",
            "15 April 2021",
            "7 April 2021",
            "6 April 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "16 March 2021",
            "16 March 2021",
            "10 March 2021",
            "10 March 2021",
            "3 March 2021",
            "23 February 2021",
            "17 February 2021",
            "17 February 2021",
            "9 February 2021",
            "3 February 2021",
            "3 February 2021",
            "2 February 2021",
            "26 January 2021",
            "26 January 2021",
            "19 January 2021",
            "15 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "3 December 2020",
            "2 December 2020",
            "26 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020"
        ],
        "review_title": [
            "Great phone",
            "Very happy with my new phone",
            "Good quality item",
            "Excellent Phone",
            "Great phone",
            "Excellent",
            "Very good",
            "Fantastic little phone very powerful",
            "iPhone",
            "Phone is super quick and snappy",
            "just the size of phone I wanted",
            "Its lovley",
            "perfect size! super fast!",
            "",
            "Good Phone",
            "Very neat and easy to handle",
            "New phone is great",
            "A much needed improvement - a smaller screen!",
            "Good quality",
            "My phone is great",
            "**************",
            "Perfect size for a perfect phone",
            "I love the new iPhone mini very fast",
            "Great phone",
            "IPhone 12 Mini is elegant & so fast",
            "Perfect size and extremely responsive phone.",
            "Great phone, fantastic customer service",
            "Great",
            "Very good Phone Fast order and delivery",
            "Excellent phone , well worth the money",
            "Excellent!!",
            "Love my new phone",
            "",
            "Works fine",
            "Great small phone",
            "Amazing product works amazing definitely recommend",
            "My iPhone 12 mini is fab",
            "Been waiting for an iPhone 5 size phone for years.",
            "Looks great",
            "Perfect Compact Phone of the year",
            "Super phone",
            "Love the iPhone 12 mini",
            "Great phone and not big like the others.",
            "Compact and easy to use",
            "Too Small!",
            "Great phone had most of the iPhones thisi is the i",
            "Awesome I phone 12 mini",
            "Brilliant phone",
            "Back to the start"
        ],
        "review_text": [
            "Very nice compact phone and has all features which we have been looking for",
            "Like everything about my new phone",
            "Gift for my daughter, she said the iPhone 12 mini is brilliant!",
            "After my previous three iPhones this on is superb.",
            "Very pleased with my purchase and a great price",
            "I decided to treat myself to this phone, great size, works fantastic, very quick, I can run so much at one time, great colour, easy to set up! Very happy with this.",
            "Very good ……………………..",
            "Fantastic little iPhone very powerful battery lasts all day sound is loud just what you need for a cheeky movie at work",
            "Really pleased with this phone, the one I had before was iPhone 6s Plus but like this better because it is smaller. I love Apple",
            "Screen is really sharp with vibrant colours although not cartoonish. Like the new design,easier to grinp when using a case.Feels speedier when scrolling through web pages or social media. Amazing sound quality!",
            "Delighted with my iphone 12 mini. I didn't wnat a larger heavy phone. This was just slightly bigger than my old phone and light enough for me to hold. Transferring my details from my old iphone was so simple. i'm glad I chose iphone again",
            "Working good, im recomend them",
            "Super amazing phone it’s the perfect size! hard to drop compared to bigger iphones, runs super fast! the 5G is going to be great when it comes to my area!",
            "Exactly what I wanted. Perfect size and love the colour.",
            "Fine Phone, Works Perfectly easy to transfer from old device.",
            "Just like a miniature iPad with an excellent camera",
            "Good price, cheaper than buying from Apple.\nLooks nice in blue",
            "Upgraded from the iPhone 11 Pro Max, which I absolutely hated, to the iPhone 12 Mini and I am in love.\n\nThe size is just perfect, the green colour is absolutely gorgeous and the phone is so much snappier and well refined than the 11 series. \n\nI really hope Apple continue to make a mini-series iPhone, there is still a market out here for people who don’t like the bigger screens!",
            "Good quality and good price",
            "Nice service. Ready for collect really quick",
            "done it again well done apple",
            "I had been thinking about replacing my old iPhone 5s but wasn’t keen on getting a big device. As soon as the iPhone 12 Mini was announced I knew that it would be the best option.\nIt’s light and super fast. The size is perfect (I can use it with just one hand even with a cover) and the screen is very sharp and detailed. The photos and videos are very natural and detailed and the battery has been lasting 2/3 days with moderate use.\nVery happy with it and definitely recommend it.",
            "Very happy with the new iPhone mini, goes very fast.\nLove it \nTake beautiful photos",
            "Great phone for the price, fabulous photos taken on it ..impressed",
            "It's a mini phone with a large screen, it's so beautiful. I so happy with my product.",
            "I bought this for a friend and they are, \"very pleased with it\". They said: \"It is the perfect size and extremely responsive.\"",
            "Fantastic customer service, replaced my awful Samsung phone with no bother and couldn’t be more helpful (unlike Samsung). Very pleased with my new iPhone. Thank you Argos Hinckley",
            "Great phone happy I chose to purchase from argos fat delivery",
            "Price îs good and High quality",
            "Excellent phone well worth the money",
            "Have had a number of iPhones in the past, but this one really excited me.  As one would expect from Apple, excellent in all characteristics.  Particularly impressed by battery life.  With previous iPhones, had to recharge daily.  However, this one lasts nearly 3 days between charges.  Gorgeous piece of kit!!",
            "After thinking it over and over I’m glad I took the plunge and went for the iPhone mini. Love the pastel mint colour and have had no problems with the phone itself",
            "Very good...........",
            "Works as described, no problems",
            "The iPhone 12 mini is great if you don't want a huge and cumbersome phone. Small and light it takes great pictures and has all the quality you expect from Apple.",
            "This phone is perfect it’s comfortable to hold and charged quick",
            "Do buy from Argos please",
            "Amazing phone!!!\nAs title been hanging onto smaller SE (old iPhone 5S body) for years until smaller versions. Snapped the mini up straight a way. Spot on. Camera good. Sounds good. Reach screen with one hand. Fits in pocket. \nPerfect for the average male. \nIt’s got that contemporary look the 5 had too. Probs Love You xxx the best looking iPhone that’s ever been made. \nLove it.",
            "Only bad point is it’s iPhone mini 12 battery is smaller so battery don’t last as long \nI Would recommend iPhone 12 Pro",
            "For those who are not addicted to their phone, who prefer a smaller footprint, and demand all the features of the larger phones (not the reduced feature stuff like the SE models had) this is what you were waiting for.",
            "Super phone - best phone I’ve had",
            "My daughter love it.",
            "Great phone and not big like the others. Has the latest technology and some cool features!",
            "Happy with my new iPhone",
            "I thought it way too small for a smart phone.",
            "Would suggest if you use your phone for gaming videos music and a lot during the day go for the iPhone 12 because it has a bigger battery",
            "Awesome phone couldn’t wait for Apple to release a smaller handset and this exceeds my expectations, Ace+++++++++++++++++",
            "Great phone, very compact if you want everything in small phone it’s great",
            "Much prefer this Mini size it’s fab to hold in one hand with all the features of the latest iPhones wireless charging OLED SCREEN great little device highly recommended"
        ]
    }
}