{
    "877/9333": {
        "remotekey": [
            "877/9333"
        ],
        "item_category": [
            "Awesome is for everyone. Life just got a little more awesome with the sleek and stylish Galaxy A42 5G. Enjoy an amazing camera for capturing your favourite moments, a 6.6\" Infinity-U Display for binge-watching your favourite entertainment, and a Long Lasting Battery that will keep you going. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "60 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "97%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "1",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "21 July 2021",
            "21 July 2021",
            "21 July 2021",
            "23 June 2021",
            "27 May 2021",
            "23 May 2021",
            "5 May 2021",
            "5 May 2021",
            "29 April 2021",
            "22 April 2021",
            "21 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "17 April 2021",
            "17 April 2021",
            "14 April 2021",
            "14 April 2021",
            "13 April 2021",
            "12 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "5 April 2021",
            "5 April 2021",
            "4 April 2021",
            "31 March 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "25 March 2021",
            "24 March 2021",
            "17 March 2021",
            "16 March 2021",
            "16 March 2021",
            "16 March 2021",
            "14 March 2021",
            "10 March 2021",
            "10 March 2021",
            "3 March 2021",
            "17 February 2021",
            "16 February 2021",
            "16 February 2021",
            "13 February 2021",
            "1 February 2021",
            "13 January 2021",
            "7 January 2021",
            "5 January 2021",
            "26 December 2020",
            "8 December 2020",
            "17 November 2020"
        ],
        "review_title": [
            "Great camera, special features",
            "New phone",
            "Great Phone",
            "Great phone",
            "Perfect for my needs",
            "Great features",
            "Brilliant",
            "Great features and usage",
            "Nice and sleek design",
            "Every thing  need to replace my tablet.",
            "Great features",
            "So far, so good",
            "This phone is very fast and too spacious.",
            "Fab phone",
            "Great phone",
            "Good phone",
            "Excellent Phone.",
            "Wroth the money",
            "looks quite okay",
            "Fantastic mobile very easy to set up",
            "Great phone",
            "Great phone",
            "Phone is beautiful",
            "Excellent barebones smartphone",
            "Wonderful",
            "Very pleased",
            "Great camera and nice, large display",
            "Replaced a Samsung A40 so very similar",
            "So far so good",
            "It’s worth the price the camera is too good",
            "New larger size, sleek looking phone",
            "Excellent phone",
            "Value for money.",
            "Great apps and features some of the apps are reall",
            "Screen",
            "Love this phone",
            "",
            "",
            "Huge memory and very fast",
            "Great phone",
            "I think is a good phone for woman like me : )",
            "Brilliant",
            "great smartphone that thos who buy it won't regret",
            "It is good and beautiful",
            "My phone",
            "Samsung A42",
            "Excellent phone",
            "Great value for money",
            "",
            "My phone looks and it's so fast like i want it .",
            "I’m tak it for my gf it’s very nice and good",
            "Fab budget phone",
            "Samsung galaxy A42",
            "Modern phone.",
            "Its ok still getting used to it",
            "Great phone for the price.",
            "Camera is great phone excellanlove it",
            "Very bad",
            "Worst phone with 720p display and cost is too high",
            "Great"
        ],
        "review_text": [
            "The camera is great, definitely recommend, different zooms available,scenic extras, flower mode etc",
            "Great phone easy to use love it",
            "Enjoyable to use and a good size screen",
            "Love it great phone.",
            "Bought as an upgrade from Galaxy A50, same specs but slightly bigger screen. Really pleased with looks and performance. Highly recommend.",
            "I am happy with this phone",
            "Bought this to replace my Samsung A52 which I lost, I think this is a lot better. Bigger screen,  rapid 5G where available.  A great mobile which doesn't break the bank.",
            "This phone has more advanced features along with optimized featiyes",
            "I bought this phone in May,and am so glad with my purchase.",
            "This is my first smart phone. I  still learning how to use it after having it for about two weeks. Looking very good so far.",
            "Great videos and pictures and games. Good to watch YouTube on the phone",
            "Super phone with great range of features including 5G. Purchase recently still to make the most of phone's functions. So far so good",
            "Buy it if you want good phone in this range.",
            "Great phone, needed a new one wouldn't swap it with anything else",
            "Great for the price and easy to use. Only draw back was couldnt get my free earbuds as kept recieving messages looking for more details. Gave up in the end. Cant understand why digital reciept and EMI number is not enough",
            "Good phone for the price",
            "Delightful phone to use.",
            "Very happy with the phone does everything I need it to looks great the whole reason I brought it as dont want contract phone any more and it's a great phone for a low price with a amazing camera.",
            "Does what i want , but a little long sometimes feels uncomfortable, if one has small pockets. overall nice phone",
            "Great price very easy to set up takes great photos",
            "For the price it is a good responsive phone + 5G ready can't ask for more.",
            "Had thus phone a few week's now and it's great,, battery life is exceptionally good,use it all day n still have over 50% when I get hoke, camera takes brilliant photos and so many other features to mention,, gets a thumbs  up and 10/10",
            "Highly recommend easy to use and set up great value for money. It's beautiful phone so happy with it",
            "This phone does everything a flagship would so except high end gaming and maybe loses some resolution when streaming video . If you can live with that then you can save yourself a lot of money !",
            "Wonderful , i bought this phone before i was think Samsung is not good but i am happy with this phone",
            "Got this phone to update from A30s. Lot better and just been upate to Android 11.",
            "Love this phone. I've needed an upgrade for a while and have always liked Samsung phones. The display is large (which I like, though might not be for everyone) so perfect for streaming TV and film. The camera is really clear with lots of great settings and features. Plenty of storage for apps and is really easy to use.",
            "Replaced a Samsung A40 so very similar except this is 5G and has a larger screen. All apps , settings data transferred across automatically so easy to switch. Ordered online and picked up a few hours later, could have got it a fair bit cheaper online from other sellers but price was competitive with the better known retail brands.",
            "Easy to use, no problems, looks stylish and does everything I expect.",
            "The phone is just amazing the camera is what I liked the the most it’s worth the price",
            "Larger in size with a more screen visibility. The white design has a nice iridescent shine across it. Easy to set up and use straight away.",
            "Purchased this phone last week upgraded from my galaxy a20e and it's amazing excellent colour sound is amazing boss camera features amd battery lasts all day",
            "After replacing my s10 with a A42 5g I was expecting a down grade on features, not so.\nScreen resolution, sound and cameras on this phone are just as good, battery lasts a good two days for me, a high user.\nOnly let down is the lack of wireless charge ability. We'll worth the money.",
            "It's a better phone overall then my a41 the features seems to be more advanced",
            "Phone is great.. screen is huge great for watching TV or music..",
            "This was a lot bigger than I was expecting, speed is excellent, perfect for gaming and watching videos camera isn't the best but love the features on it,  amazing amount of storage love love love ❤ it.",
            "Good value for money.",
            "My new phone Samsung galaxy A42 5G 128GB SIM FREE FROM ARGOS STORES IS VERY AMAZING and very fast in operation. I am loving it and thanks to Argos for making things easy for me.",
            "Love this phone. Lots of room for apps and storage. Only issue is the shutter speed on the camera is slow which causes you to miss the moment. Especially with children and pets that move a lot. The phone is over all good value.",
            "Great phone. Easy to use with long- lasting battery. Great camera quality. Descent price and it's totally worth it.",
            "Enough good for 100% womam : )\nVery fast, really very fast with enough big screen and very up to date : )",
            "It was very good and the memory and battery ....brilliant",
            "Good product, battery, Ram,capacity and screen space seemed appropriate, but it was rather focus on products that are assembled in the Far East instead of (India)_where the smartphone I bought was assembled_ because I can't download some applications from the Google Play application and the application gives me an ambiguous answer which is this (application is not available in your country\"U.K.\" ; in addition to That the product box was missing earphones!.",
            "Its good and beautiful.love it",
            "Great phone and a great price",
            "Great device. Efficient, easy to use and awesome camera !",
            "Bought 4 of them.  In many ways better than my year old S20+.  It has reasonable camera (out of the box, no need for the ongoing camera updates). It has 3.5mm accessory jack, expansion card slot (that S21+ doesn't have) and relatively fast processor.  The low display resolution doesn't mean, that your photos, or video clips have low resolution.  You can always watch them in hi-res on your tablet, or laptop.  The low screen resolution equals to lower power consumption and longer battery time. The A42 5G super amoled screen in general use (games, Youtube), is no different, from hi-res screen in my S20+.  In fact after my purchase of first A42 5G, I have reduced the resolution of my other phones, to reduce the time they spend on high speed chargers.",
            "Great phone. It does all I needed to do. It has lots of functionalities, lots of storage and decent battery. \nI didn't want to spend lots of money on a new phone and I'm happy with my purchase.",
            "Good value for money",
            "I love my phone it fab for me. it's fast specifically the internet let say 5G is great and i needed more space and i've got it i'm so happy . thank Argos to make that easy for me.",
            "Thanks it’s very nice and very good",
            "Easy to set up.\nEverything you need from a smart phone.\nGreat camera rear and front facing.\nFast charging. Complete in less that 1hour 30.\nBrilliant clear screen.\nWod recommended to anyone needing a cheap smart phone.",
            "Easy to use. Seemless transfer of apps from old phone. Clear display & excellent camera",
            "Bigger than my previous mobile, so a little less convenient to handle and carry. Extremely slippery to hold so needed a case for safety in handling.\nSeems to work well. Easy to enter data.",
            "Only downfall is putting a case to protect it doesn't show white as i was expecting to see on front",
            "Looks good, great screen picture quality. Great phone for the money.",
            "Love it better than my other phone",
            "Very bad quality phone . Specially it is too difficult to take screenshots , up and down volume etc its totally rubbish.",
            "Bad phone dont even think of buying  720p disply what samsung was thinking no one knows",
            "loving everything! Nice service came quick and served me good!"
        ]
    }
}