{
    "848/1762": {
        "remotekey": [
            "848/1762"
        ],
        "item_category": [
            "iPhone 12 Pro Max. Superfast 5G. A14 Bionic, the fastest chip in a smartphone. Pro camera system for unbelievable low-light photography. And a larger Super Retina XDR display. It's a huge leap forward. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "80 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "1 August 2021",
            "1 August 2021",
            "31 July 2021",
            "30 July 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "8 June 2021",
            "22 May 2021",
            "5 May 2021",
            "2 May 2021",
            "29 April 2021",
            "20 April 2021",
            "20 April 2021",
            "14 April 2021",
            "14 April 2021",
            "9 April 2021",
            "3 April 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "25 March 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "16 March 2021",
            "16 March 2021",
            "15 March 2021",
            "10 March 2021",
            "10 March 2021",
            "10 March 2021",
            "9 March 2021",
            "9 March 2021",
            "9 March 2021",
            "5 March 2021",
            "3 March 2021",
            "3 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "19 January 2021",
            "12 January 2021",
            "12 January 2021",
            "5 January 2021",
            "2 December 2020",
            "26 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020"
        ],
        "review_title": [
            "Great product",
            "Good",
            "It looks good for what I need it for",
            "Great product",
            "Really nice !!!",
            "phone is great on the outlook",
            "Amazing product",
            "Good",
            "Amazing piece of technology",
            "Very good",
            "Amazing phone!!!!",
            "Excellent phone",
            "",
            "number one product who anybody have to take it.",
            "I love it the phone looks amazing",
            "Very nice",
            "So quick",
            "Goof",
            "It's fantastic",
            "My phone is good i love it",
            "Good services",
            "It’s a great phone l love it. I we recommend it",
            "Delivered within 24 hrs.",
            "My pro max 12 phone looks & Works just great",
            "Excellent phone",
            "Good product",
            "My phone is fab",
            "Good",
            "Great Phone",
            "Perfect gift for my lovely wife",
            "Everything you need in a phone",
            "My iphone is much much better than other phone",
            "My Iphone’s 12 pro max crystal looks wow",
            "really pretty",
            "The phone is amazing",
            "It’s so fast, perfect, nice colour and design.",
            "I phone 12 pro max",
            "Fantastic",
            "A very good phone",
            "Perfect for recent days",
            "Great phone and great deivery time",
            "iPhone 12 Pro Max  5G Mobile Phone",
            "I’m loving this phone after 7 years with Android",
            "My new phone is brilliant",
            "My new phone is spot on.",
            "fine and thanks.",
            "Great iPhone, love the camera!",
            "My new phone",
            "Screen came with a scratch",
            "My phone looks fabulous",
            "SIM Free iPhone 12 Pro Max 256GB 5G Mobile Phone -",
            "Fantastic phone. Yet again",
            "Nice and good",
            "Low my iPhone 12 Pro Max",
            "Great phone",
            "Iphone12 pro max",
            "The phone was sealing was already open",
            "",
            "Fabulous",
            "IPhone 12 Pro Max",
            "iPhone is ok but not great",
            "Excellent phone",
            "Fab",
            "Brilliant phone",
            "Great as expected",
            "iPhone",
            "",
            "Great product",
            "It's worth upgrading",
            "Very fast compared to previous models",
            "Best Camera Phone",
            "Mr",
            "Beautiful phone, aesthetically and digitally",
            "It’s an iPhone!",
            "Fabulous phone",
            "iPhone 12 pro max",
            "Awesome camera",
            "The camera quality is too notch",
            "iPhone 12 Pro Max",
            "Brilliant phone to use"
        ],
        "review_text": [
            "I bought the new IPhone and beside great quality, the customer service was excellent. I will definitely keep buying from Argos.",
            "I am so happy for this item.",
            "I bought the phone about a month age abd am happy with it",
            "I bought iPhone nearly 1 month it's good to easy to use and gredt functions and features to use daily lifestyle. I am really grateful to have it.",
            "Very happy with the purchase.",
            "Not yet finished setting it up as there are a few teething problems that I need to resolve",
            "Apple is apple !!!\nThe best brand ever !!!",
            "This is a very good device",
            "I bought 256 GB Graphite color Iphone 12 Pro max couple of weeks ago, and I am impressed with photos and video quality.\nBeing Android user for almost 10 years I wasn't sure about IOS, but I am happy with performance of the Iphone",
            "Nice item and very suprise with argos delivery and very safe",
            "I’m so happy!!!!amazing phone",
            "Best iPhone I’ve ever had no regrets at all",
            "I love this phone! It’s times better than the iPhone X",
            "amazing product with stunning colour also with 9 month plan to pay is perfect.",
            "I was confused for months with to get sliver or gold been waiting 8 month for it come in the stock battery and the camera is my favourite last be 2 days without charge it",
            "Good phone for good price",
            "Only thing doesn't like me it's the hi price.",
            "Yeah fast delivery eveythign was top notch",
            "I really like it and love taking pic with my new iPhone",
            "The phone dose look good and is so nice too use",
            "I like this iphone 12 max",
            "My best phone ever. I we recommend. It worth buying.iPhone 12 pro max go for it you wouldn’t regret buying",
            "Perfect buying experience.  Smooth and easy.",
            "Although no nectar points received so far\nI would like to say delivered on time looks great well pleased",
            "Great phone as you would expect with apple and it has plenty of storage space for photo’s etc. The camera is very good with HDR quality",
            "Very nice phone, got it next day by 8am works brilliant",
            "I absolutely love my phone",
            "I love the pro very good",
            "Like the colour. It's a very good phone.",
            "Quick and fast delivery\nPerfect gift for my lovely wife \nGood technology, fantastic camera and video full hd really recommend",
            "Well worth the money looks good. And believe me it isboo",
            "Look wise quality wise every thing its a best and also performance is top.",
            "Glassy iPhone 12 Pro Max safely delivered by me and it’s so Crystal and easy to use all the App...",
            "beautiful phone very easy to use. \ndeffo recommend.",
            "I love to make shopping from Argos",
            "I like it so much. I bought for my wife for mothering day.",
            "I punches iphone 12 pro max but when I put for charge phone start heatup ,I not happy and not satisfied",
            "It's fantastic phone .\nI like it.",
            "Easy to use, fast transfer of documents and information from your old phone to the new",
            "Really loving this \nPerfect in camera, fast",
            "Outstanding quality phone. Highly recommend the device and also argos for their exceptional service.",
            "great phone but very expensive ....",
            "I decided to get the iPhone 12 Pro Max after 7 years with android - I’ve had it for a few weeks now and I am loving it! \nI was up all night deciding whether or not to order it and finally ended up ordering it at 4am on a Saturday and somehow it managed to arrive just after 8am the same day - 4 hours after ordering! I thought that was really impressive. \nI’m loving everything about it so far. The camera is amazing, and it just has a very premium feel. Definitely would recommend.",
            "My new phone is brilliant. I waited so long for it to come back into stock and I’m more than happy with it! Really nice colour too",
            "The phone is a great product and From start to finish the transaction was so smooth and easy.",
            "I have recently purchased this item online from Argos's website, I am indeed happy with the service and perfomance of the product and all staff.  \nThanks.",
            "Love this iPhone. It is very slightly bigger than the XS Max (without feeling uncomfortable to hold) and the camera is noticeably better too! The screen light also feels less harsh on your eyes at any level. The back of the phone is a lovely matte pale gold colour and the edges are very shiny (although I put a cover straight on when I received it).",
            "Got it as a gift for husband he was surprised and real happy",
            "The drive is a bit slow and came with the front screen scratched",
            "It is very good I like so much",
            "iPhones is very excellent",
            "Incredible phone. Another great product. Everything and more than expected followed by great home delivery service from Argos. Thank you for your professional service",
            "I highly recomanded to friends and family thankd",
            "Love the blue screen is big but you you get used to it the camera is a amazing the best iPhone camera yet and with the 5G makes it super fast on the internet browsing the battery life way better than my iPhone 10 and the super fast charging is unreal the only down side is your don’t get a plug with the phone and as they have a c port and not a usb means I can’t use  my  old plug with it plus watching you videos on it look really good as the Display is really good",
            "It’s a great all round phone, it does everything you need from a phone, PDA, tablet, camera, etc... it’s a piece of cake to use and even easier to set up or transfer from your old phone. Product quality is top notch. I would have given 5 stars but due to the lack of a charger plug & no headphones.",
            "Thankyou Argos for your fast divery.my hubby has surprised and he likes it very much.",
            "It looks like that it was returned by someone",
            "I am very satisfied with the purchase I made",
            "The best online shopping",
            "I love the phone best purchase ever!!",
            "From the advertising thought I would be getting next generation iPhone. Besides the camera no real difference to iPhone 11 Pro Max. As for 5G it’s nearly nonexistent.",
            "Excellent phone great camera",
            "My iPhone looks fab works well does what it says \nNo refresh rate :(",
            "As usual Apple have come up trumps. Had an iPhone for years but this is the tops. I love having no home button. So easy to use. The camera is amazing.",
            "Apple is an easy choice to make. No need to look up at tons of reviews. Functions and performs well as most apple products do.",
            "It’s doing me ok\niPhone is a iPhone",
            "No change it’s like I phone 4 or 5",
            "It's a great product",
            "It's worth to upgrade if you have an older iPhone or if you want to buy a new phone. I like to purchase from Argos because I can buy now and pay later, in my opinion is the best option.",
            "Worth every penny! Very good battery life, had it approx nearly two weeks and not once has the phone run out of battery i could go the full day with one charge and roll over to next day.",
            "I have owned every plus, every max and every pro max up to date and i received my Iphone 12 Pro Max yesterday and let me tell you it surpassed all of my expectations",
            "Thanks for costumer service",
            "The phone is super fast and the flat sided design of the phone is super refreshing coming from apples older phones. it feels really nice in your hand and the frosted glass back helps to keep sweat and fingerprints off. however the sides are a super shiny stainless steel which collects marks and fingerprints incredibly easily. \nThe screen is HUGE so it provides tonnes of space for you to be able to watch shows and allows you to have a super fast and comfortable typing experience.",
            "It was well worth the wait, an upgrade to a iPhone 8 Plus and so glad I waited for the 12 Pro Max.\nCamera is fantastic, with a huge screen and very quick processor.",
            "The best iphone whatsoever.Had been waiting for proper upgrade for years.Its a complete package for me whether its taking pictures,shooting videos or playing games.\nOn top of that,it has ceramic shield which means it is more drop resistant.\nAlready recommended to my friends and families.",
            "We are pleased for  the item, fast order and quick delivery , looks good I absolutely love it, great price !",
            "Apple never disappoints.",
            "This phone is everything! Has a night mode for pictures, so if you’re the type that’s into photography like myself, you would love it. The battery life is also pretty decent and the shape is just wow",
            "Amazing phone, the way the phone is made is wonderful, battery life is very good it last me two days.",
            "Great price and love the phone"
        ]
    }
}