{
    "869/5084": {
        "remotekey": [
            "869/5084"
        ],
        "item_category": [
            "The OPPO A72 is a high performance premium design with a 1080P Neo large 6.5\" FHD+ Display for truly immersive entertainment. Side fingerprint scanner for ease of access and a 5000mAh battery capacity to keep you going all day. A 48MP quad rear camera and a 16MP selfie camera for every occassion. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "15 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "12 July 2021",
            "6 July 2021",
            "23 June 2021",
            "23 June 2021",
            "15 June 2021",
            "8 June 2021",
            "8 June 2021",
            "31 May 2021",
            "21 May 2021",
            "19 May 2021",
            "11 October 2020",
            "30 September 2020"
        ],
        "review_title": [
            "Purchased as a gift, we'll pleased",
            "Excellent Customer Service",
            "Seems good",
            "Good quality for the price",
            "Oppo A72 brilliant!",
            "Tidy layout and function",
            "Great",
            "Decent phone",
            "Great Mobile on competitive Price!",
            "Recommend",
            "",
            "Great value",
            "Great phone",
            "Cheap great camera",
            "A72"
        ],
        "review_text": [
            "My son is happy with it.",
            "I have always bought from Argos for over 20 years and be we been disappointed. Excellent phone for a great price.",
            "I've had it for a couple of weeks and so far no real problems.\nThe app layout is different to my last phone, the latest OS is different too, and I'm still getting used to things.\nBut I'm happy.\nA dood phone, great value.\nRecommended.",
            "I love the features and design, comfort in using. Bit too slow. Not the perfect camera, but definitely enough. I like the aesthetic of pictures it's taking. Nice filters, bit more than basic. Screen size is helpful to retouch pictures. The phone cover is really useful. Nice apps, not too much unnecessary apps putted in. The size is ok for back pocket in jeans.",
            "Absolutely amazing phone for the price, clear screen great camera and it does everything a phone should do,can't ask for any more!",
            "Bought this from Argos a few weeks ago. Not an easy process as the app has been rubbish for many months. Argos say they are aware and are doing all they can. Scrap it and start again as what they're doing doesn't work. They must be losing custom because of it.",
            "I Bought this week, so far there have been no reservations",
            "Good quality phone and specs for the price. Also has expandable storage and headphone jack, relics from the good ol' days! Display and battery life also great",
            "Nice phone. Very light weight and has all the necessary features of an expensive contract phone. Fast charging makes all the difference. Why don't give a try!",
            "I bought this phone for my 11 year old so-he's very happy with it. I am happy too. I've left it a star short as it was tricky to set up and the we still haven't been able to clone the old phone transfer onto this new one. Other than that everything seems to work well and he's very happy with it. Screen size and resolution is good.",
            "",
            "It is cheaper than buying it with a plan from mobile service suppliers as it is SIM free.\nThere is plenty of room to store data and install Apps, you can install 2 SIM's and has .\n various camera options.\nIt is the best mobile phone I have ever had, I wouldn't hesitate to recommend it to everyone, it is great value.",
            "I am so pleased with this phone two speaker 128g so much you can put on it great for watching films for the price well worth it",
            "I just call and text, I take pics on my walks and listen to the radio on the weekend for football. This phone is loud so I can hear it on speaker across my kitchen. Love the pics it takes and people have already complimented the colour.",
            "I really like this phone i think it GREAT its really easy to use and the screen is very big ."
        ]
    }
}