{
    "918/9410": {
        "remotekey": [
            "918/9410"
        ],
        "item_category": [
            "Tap into an unforgettable viewing experience with Galaxy A Series. Large screens, rich colours, and uninterrupted Infinity displays, you'll be fully immersed in your gaming and streaming, wherever you go. And if you're big on snapping photos and capturing the moment, Galaxy A series has you covered there too. Shoot jaw-dropping pics with a tap, thanks to multiple cameras and angles. Plus, with easy-to-use image controls, you can make every pic Insta-worthy in just a few taps. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "96 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "96%"
        ],
        "review_rating": [
            "4",
            "4",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "5 July 2021",
            "24 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "9 June 2021",
            "8 June 2021",
            "3 June 2021",
            "28 May 2021",
            "25 May 2021",
            "23 May 2021",
            "21 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "13 May 2021",
            "11 May 2021",
            "8 May 2021",
            "8 May 2021",
            "5 May 2021",
            "5 May 2021",
            "5 May 2021",
            "5 May 2021",
            "4 May 2021",
            "29 April 2021",
            "28 April 2021",
            "28 April 2021",
            "28 April 2021",
            "28 April 2021",
            "28 April 2021",
            "28 April 2021",
            "27 April 2021",
            "22 April 2021",
            "21 April 2021",
            "21 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "19 April 2021",
            "19 April 2021",
            "17 April 2021",
            "17 April 2021",
            "17 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "13 April 2021",
            "13 April 2021",
            "13 April 2021",
            "12 April 2021",
            "12 April 2021",
            "11 April 2021",
            "10 April 2021",
            "9 April 2021",
            "8 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "6 April 2021",
            "6 April 2021",
            "5 April 2021",
            "5 April 2021",
            "4 April 2021",
            "1 April 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "30 March 2021",
            "25 March 2021",
            "24 March 2021",
            "24 March 2021",
            "16 March 2021",
            "5 March 2021"
        ],
        "review_title": [
            "Excellent value",
            "My honest opinion.",
            "Great phone",
            "Does everything I want....and more",
            "Bigger scree much easier to use",
            "Excellent phone",
            "Great phone",
            "Great camera",
            "Good quality/cost ratio",
            "On the go",
            "Very good value",
            "Samsung",
            "Brilliant features",
            "Very good  camera",
            "Samsung A32",
            "UMMM OVERALL It's AMAZING DUHH",
            "Got to love samsung",
            "Great camera",
            "Nice and slidy",
            "Decent phone",
            "perfect phone for perfect price",
            "Nice phone overall",
            "Great mobile all round",
            "GalaxyA32 64GB 5G Mobile Phone",
            "Great phone for work",
            "Some great features.",
            "Amazing product on budget with amazing features",
            "Great phone all round",
            "Great features",
            "Samsung A32",
            "Nice phone easy to set up.",
            "Great battery, easy to use.",
            "Beautiful phone",
            "Great Phone- A32",
            "Lovely phone",
            "Its a decent mobile but i had iphones before this",
            "Samsung Galaxy A32 5G 64GB Mobile Phone",
            "I love it",
            "Good camera easy to use",
            "Good mid priced phone",
            "Phone great",
            "bought for my partner and she loves it",
            "Great phone",
            "A32 5G",
            "Happy customer",
            "Excellent",
            "Value for money and well worth the price.",
            "phone",
            "Lovely colour& new features",
            "",
            "Top quality kit, just one slight problem",
            "Great battery life",
            "Changed from S5active",
            "When switched on , it takes a while to open",
            "Very good phone",
            "Excellent",
            "Phone works very well",
            "The phone is really a brilliant phone",
            "Great Phone",
            "Top class phone",
            "Brilliant easy to use.",
            "Happy but beware fingerprint recognition is ify.",
            "Camera broke on night time picture",
            "Great features",
            "Easy to use",
            "Really great, had so many compliments",
            "Nice sleek mobile",
            "Brilliant phone all over",
            "I need a new phone HELP!",
            "It looks the part,and love the colour.",
            "The phone is easy to use and is good value",
            "Good phone",
            "Amazing",
            "Galaxy phone just what I needed",
            "Replacement",
            "Great phone",
            "Samsung A32",
            "Samsung galaxy a32",
            "Really fast and loaded with features.",
            "Exactly what I looking for",
            "New Samsung line",
            "Very easy to set up and looks great",
            "Its faulty",
            "Quick and easy",
            "Great battery live",
            "Very good phone.",
            "The phone is amazing",
            "My phone have Nice Design and good memory capacity",
            "This phone very good for camera faster them my s10",
            "Too big and heavy.",
            "It is what I was looking for. Super!!!",
            "Samsung a32",
            "Value for money",
            "Brilliant battery life and excellent camera",
            "Perfect phone",
            "Lovely great value"
        ],
        "review_text": [
            "This phone has more than met my needs and am really happy with it. The battery last extremely well and plenty of storage.",
            "So I had mixed feelings about this product when going through all the reviews. \n\nBut I purchased anyway, as its different for everyone.\nI've had no problems with this phone so far, and I'm very happy with the product.\nI play games alot and I'm always on social media so I need to charge once a day. Which is alot better than charging twice a day with my old phone.\nThe camera is alright it does what it needs to do.. the only time I'm not satisfied with the camera is when it comes to evening time, even with the flash on the pictures doesn't come out decent but alright.\n\nGive the phone a chance it might be perfect for you. \nIt's decent for the price.",
            "Bought for my 19 yr old son, he says it’s a really good phone does everything he needs, has a good sound and microphone also good camera",
            "I bought this a phone a few weeks ago.  I had to purchase one in a hurry due to accidentally 'drowning' my previous one.  I am new to Samsung, have not been disappointed.  I only use the basics (not a gamer), it does everything I require.  Lost a star as it is rather heavy.",
            "My old Samsung had limited storage and kept telling me to delete items. I haven't downloaded much yet nor used all the features. Easy to transfer all data from old to this phone",
            "I bought this phone because it was in the price range I was willing to pay and appeared to have the features I was after. Really happy I did.\nGreat value for money.",
            "I bought it a month ago and it look and working perfectly. I'm really happy of this purchase",
            "Great mobile and very good price really happy with this product",
            "I've been using this mobile for a couple of weeks now and am satisfied with the quality considering the total cost of the product. Both hardware and software work without issues. Happy with the purchase and the Argos service.",
            "Ordered online easy to pay .easy to collect.staff very helpful.",
            "This is an excellent smartphone in terms of its features, ease of use and value for money.",
            "Really nice phone bigger than my other one easy to set up just the voloume key not use to",
            "The wife brought me this photo for my birthday and I love it",
            "I changed  my iPhone  for  the Samsung  galaxy  best  thing  I did",
            "Great phone particularly when in receiving a 5g signal. Reviews state it's a heavy phone and guess what it is!",
            "AMZING AMAZING AMAZING AMAZING AMAZING AMAZING AMAZING AMAZING",
            "So pleased to be back with samsung after trying Huawei for 18 months. I won't ever leave you again!",
            "Easy to use and long battery life good security great design",
            "Great phone. Really shiny plastic that slides.",
            "Purchased 2 weeks ago, so far so good.",
            "update on my a5 great. the camera is brill main reason for purchase .easy transfer of data using samsung app .all v .good so far .",
            "Purchased as a replacement for my old Samsung. Very pleased with it overall however fingerprint recognition doesnt really work well or at all most of the time. Would have given 5 stars otherwise.",
            "I totally love my new Samsung, my partner has brought it for me for my birthday",
            "Excellent phone easy to use, good battery life, storage & overall a neat compact mobile",
            "Great battery life . Clear screen fast to respond 5 g ready a value for money phone.",
            "I'm really glad I chose another Samsung. It is even better than my last one. And I'm still finding features that I really needed, like changing very short ringtone from 15 seconds to 30. Now it won't go to voicemail as often.",
            "An amazing phone on a budget range with unbelievable features for the price . Overall an amazing product !!!",
            "Love photos  good speed great for gaming and films great phone",
            "Lovely to use and takes great photos , love the feel so easy to use",
            "Good phone and price for a 5G. Have noticed however that the volume when using the phone is very quite, even with the loudspeaker option turn on !",
            "No problems setting it up most done for you.",
            "Work idealy for my needs. Hreat phone for the price.",
            "Bought it as a gift for my husband and he loves it. No problem so far. Beautiful camera and the phone is so sleek. Very good price also",
            "This A32 is prefect for streaming and the sound quality is pretty good, especially for the price. \n\nI would recommend this phone if you view videos quite a lot and stream online as it is 5G compatible. The memory is also good and has a slot to add a memory card to save your big files. \n\nGood all rounder phone",
            "This phone is fab and has a loud volume. It is light and the screen is big",
            "I was looking for a cheapish mobile but efficient and effective and the new model did the job.",
            "My previous phone has 3GB of RAM which sometimes goes slow while watching football but this one with 4GB of RAM and bigger screen is absolutely fantastic and I'm enjoying it. Thumbs-UP!",
            "The best phone I ever had.",
            "If you want a good phone but don’t want to spend a lot it’s worth it",
            "Purchased to replace a very worn out basic phone. Pleased with the quality",
            "Love the phone great",
            "bought for my partner and she loves it",
            "Very nice size great photo quality easy to use and great looking phone",
            "Brilliant phone. Good price. Excellent battery. Camera great. Ample storage.",
            "My 13 year old son is a very happy lad. He loves the phone so happy child happy parent.",
            "Perfect 5g phone for a reasonable price. No problems transferring files etc over. Bought case and screen protector elsewhere. Easier and quicker to obtain from Argos than Amazon Prime",
            "If you don't want to spend a fortune and don't need a top of the range phone, then this Galaxy A32 5G is well worth the money. I don't need a phone for gaming so this one is more then ideal for my needs. My last mobile was Galaxy S7 Edge at twice the price but didn't offer any better features than the A32 5G.",
            "Excellent little Phone for the price",
            "It was a gift my cousin happy with the phone , more knowledge, lovely lilac colour\nGood price",
            "Excellent screen,  very easy to use",
            "The phone is of the same first class quality I've come to expect from Samsung products. The battery life is amazing! The only minor problem is the same as with the Tab A7 I purchased recently...the charger cable is waaay too short. 4.9 stars of of 5.",
            "Happy with phone overall however there are few things it could improve on. It is very heavy. Hold it in one hand is impossible. There is also something with this version of android. Some apps arent working the same way like on my Samsung S8.",
            "Extra  features and so much quicker responses great improvement \nExcellent value",
            "Don't like the phone . Regretted getting it.",
            "Very good phone the battery  life is amazing, it's lasts forever and the camera is superb.",
            "It was a very good phone, I am satisfied with it!",
            "I am very pleased with my phone does everything I want it to do fast.",
            "The product is not too expensive and does everything. Got nice camera . Everything is perfect",
            "Great Affordable Phone. Does everything needed and quite fast, especially for the internet browser. Takes nice detailed pictures (can see every pores on my face). As for the double SIM it is important to note that you can only use eitheir a second Sim or a memory card.\nAnyhow it is a fantastic phone for its price.\nCame with a superfast charger.",
            "Battery life is excellent good quality product great price",
            "I am in my 60's and managed to set it up my self. Very pleased with it mr",
            "Both my partner and I have this mid range model and are very happy with it except for fingerprint recognition neither of us have had any luck trying to get it to work. It was much better on the rear of the phone. Sadly we have given up trying to use it. I'm not ofey with the technicalities of phones it does what I want it to do re calls,texts,photos,games but I've dropped a star because of the fingerprint  recognition  problem.",
            "Camera not working still waiting for a fix unable to take pictures with flash",
            "i am a 72 years old  male i have no problem using this phone",
            "Good screen size & easy to use. \nLike the design too",
            "I've  had this phone over a month now and I can have it for 2 days without charging, I wish it were waterproof but other than that great",
            "Economical, mobile with all tge features in it and im happy with my purchase. Argos quick service is best service.",
            "Love this phone camera 100 % brilliant and just a brilliant phone all around",
            "Not good at learning to use new products so when I was forced to replace my phone I was in a bit of a panic. Took lots of time to research (to impress the kids) And deciding to stick with Samsung I finally decided on the Galaxy A32.\nIt has taken me a couple of weeks to be comfortable with it but I am happy with my choice. So far I have only had to have someone sort me out once so am happy. \nThe phone looks impressive but it is easy to use and I know I made the right choice.",
            "Great phone for the price and a fraction of the top leading models,just what i,m looking for.",
            "Very pleased with the phone.  Collection was quick and easy.  Would recommend the service to all family and friends",
            "Good phone. Quick and responsive to use.",
            "The battery lasts long, the camera is amazing and the sound is good. Really good for the price, works better than phones I've bought double this price!",
            "Price great \nWaiting for me at store\nHappy staff considering Current circumstances",
            "Replacement phone for my s7 that packed up. \nIt was easy to set up and great to use",
            "Great phone easy to use",
            "Good phone so far, plenty internal memory and can add sd card for more. Gives plenty space for apps without constant your out of space messages had on original phone. easy to setup. Charger lead in the box is bit short but you can check Argos or other online stores for replacement usb type c lead which just plug in charger but solves problem. No headphones in box.",
            "It's great . A good phone that has everything. Battery last very long. It has everything that you can ask for. The camera is amazing",
            "Absolutely brilliant. Bought to replace my old Samsung galaxy s8 and it's brilliant.",
            "Best product , good price",
            "This phone is exceptionally good I have no problems using it understanding it or or downloading stuff onto it. The camera is magnificent the picture is so sharp and the preloaded effects or very interesting also.",
            "I love the 4 cameras on the back I take a lot of photos and there amazing",
            "Argos sold a faulty phone. It seems they sold me a used phone",
            "Quick and easy picked up next day excellent",
            "Phone is great however It is a bit heavy. I have small hands so feel this slightly uncomfortable as need to hold it qith both. Anyhow I like it. Battery lives long and don't need to worry about charging so often. Great display and loud enough.",
            "I think that this phone is great, and I am very pleased.",
            "Beautiful phone. With excellent camera",
            "Good quality. Nice design. Good memory capacity",
            "This phone blow my Samsung galaxy s10 lite out off the water camera amazing battery last 2 days",
            "Nice phone but to cumbersome. Too heavy and difficult to fit in pocket.",
            "Very good price!!!! For those who like social media and a very powerful camera.",
            "The reason 5 stars I gave to mobile Samsung A32 is great phone for grat price. It does have all what I need for my busines and private matters. Also it is sim free mobile and ready 5G where at the moment I use just 4G sim card. For price almost £250 simple perfect.",
            "Good phone worth this price and 5g",
            "Defo recommend as good as the s series",
            "Does everything you can ask for from Samsung at a very good price.",
            "I purchased this as a replacement for my j6.  For a budget end phone I absolutely love it. Great gaming, fab camera and video.  My only grumble is that I can't work out how to turn my camera on in zoom!!!! Yes I've followed all instructions."
        ]
    }
}