{
    "220/9421": {
        "remotekey": [
            "220/9421"
        ],
        "item_category": [
            "Three cameras. Unlimited possibilities. Shoot amazing videos and photos with the Ultra Wide, Wide and Telephoto cameras. Capture your best low-light photos with Night mode. Watch HDR films and programmes on the Super Retina XDR display — the brightest iPhone display yet. Experience unprecedented performance with A13 Bionic for gaming, augmented reality (AR) and photography. And get all-day battery life and a new level of water resistance. All in the first iPhone powerful enough to be called Pro. "
        ],
        "summary_star_rating": [
            "5"
        ],
        "no_reviews": [
            "11 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "27 October 2020",
            "22 September 2020",
            "18 August 2020",
            "12 August 2020",
            "30 July 2020",
            "28 July 2020",
            "10 June 2020",
            "15 January 2020",
            "26 December 2019",
            "21 November 2019",
            "30 October 2019"
        ],
        "review_title": [
            "Top Quality Apple iPhone.",
            ":)",
            "Amazing Argos trader",
            "This is my dream phone and i love it.",
            "Phone is fab! Pictures are amazing.",
            "What a phone. Camera amazing",
            "Sleek and practical",
            "iPhone 11 Pro is instantly easy to use.",
            "Good product",
            "Just get one",
            "Perfect!"
        ],
        "review_text": [
            "As you would expect , this Apple iPhone is top quality. Battery life is excellent , and the phone is easy to use and set up.\nHas all the features you would usually see on an iPhone , fast and reliable \nRecommend it.",
            "My The Best IPhone :)",
            "I am very happy with my purchase and how the battery life and memory are lasting.",
            "Owesome phone. I really love it...",
            "Great product!\nPicture quality is very good, size of the phone is perfect to watch movies or even read the books or just simply type emails or messages.\nI am very impressed with battery life.\nReally happy with my purchase.",
            "Camera is the best and battery life is awesome",
            "I was surprised at how quickly everything transferred from my older model on to this one. The transfer was seamless and the phone is working perfectly. I love the battery life and I’m having lots of fun with the new settings on the camera.",
            "Didn’t think I’d like not having a button to press for the home screen.! But the 11 pro is so easy to use and it’s features come to you naturally. It’s Awesome",
            "I was a long term Sony buyer but this time decided to go for something new and I am not disappointed 1 month in.",
            "Thought long and hard about getting this iPhone 11 pro. After reading and watching tons of reviews I decided to go for it. So glad I did! Everything on the device is super fast and easy to get used to. Would recommend this phone to anyone looking to upgrade or just to treat themselves.",
            "Perfect phone! Battery lasts for 2 days with no problem even if it’s used on cold weather"
        ]
    }
}