{
    "859/0392": {
        "remotekey": [
            "859/0392"
        ],
        "item_category": [
            "HAMMER 5 Smart is a unique 4G smart feature phone with KaiOS. This means it has popular applications such as Facebook, Twitter, Whatsapp and Google Maps pre-installed, combined with the simple functionality of a classic feature phone. The rugged device has IP68 certification, making it dust and water resistant, along with an exceptionally large 2500 mAh battery and 2.4 display. "
        ],
        "summary_star_rating": [
            "3.5"
        ],
        "no_reviews": [
            "8 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "63%"
        ],
        "review_rating": [
            "1",
            "5",
            "2",
            "3",
            "4",
            "4",
            "4",
            "5"
        ],
        "review_date": [
            "7 April 2021",
            "20 January 2021",
            "1 January 2021",
            "12 November 2020",
            "8 October 2020",
            "22 September 2020",
            "20 August 2020",
            "28 July 2020"
        ],
        "review_title": [
            "Works OK",
            "I don't like touch screen phones",
            "Language kept changing",
            "By no means a rugged phone",
            "rugged phone",
            "Very good hard cased phone.",
            "Great Tough Phone",
            "My mobile phone looks great n well made"
        ],
        "review_text": [
            "Order came from a 3rd party, which I was quite surprised about, and the the plug for the phone was broken. The only thing holding it together were the wires inside.\n\" VERY DISAPPOINTED \"\nThe actual phone itself is not bad, dual sim, WhatsApp, Email, QR Scanner ( which doesn't work), but it's OK for what I needed. Not actually very heavy, but it is a big phone, looked a lot smaller in the pictures.",
            "It's really good. Does what I needed it for, dual sim - for work and home. Check WhatsApp, ring and text. You can use the internet but it's a bit strange. I couldn't use the pre installed whats app at first but that was because it was still on my old phone, I had to uninstall it from there and the pre-installed one and then download it from the store. Also texting is obviously slower with buttons and the battery is not as long as you'd think but at least 2 days before another charge.",
            "The language kept changing to polish",
            "This phone gives the appearance of being rugged but in a nutshell it's pretty naff & we'd have been better investing in a new smart phone with a gorilla case.  There is no facility to lock the screen & prevent dialling of 999, it has limited ring tones & to be honest if it was dropped I'm not quite convinced the built-in casing would prevent breakage.  The screen is small & not touch operated.  The style is good but (put simply) this could have been a much better phone if designed better.",
            "very hardy phone,good battery life has a retro look.i can reccomend it.",
            "Good smart phone with features..rugged case..",
            "I was looking for something different from usual smartphones that I seem to break, which cost me money, on a monthly basis! Great device that allows me to use all the standard apps and isn't afraid of water or being dropped!",
            "Great overall product"
        ]
    }
}