{
    "848/0385": {
        "remotekey": [
            "848/0385"
        ],
        "item_category": [
            "iPhone 12 pushes everything forward with superfast 5G. A14 Bionic, the fastest chip in a smartphone. A new dual-camera system. And a beautiful Super Retina XDR display, so you can see everything in vivid detail. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "17 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "19 May 2021",
            "6 May 2021",
            "31 March 2021",
            "10 March 2021",
            "2 March 2021",
            "22 January 2021",
            "20 January 2021",
            "5 January 2021",
            "29 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "18 November 2020",
            "11 November 2020",
            "11 November 2020",
            "10 November 2020"
        ],
        "review_title": [
            "Value for money",
            "Great so far",
            "A big upgrade",
            "dream color best phone",
            "Excellent iPhone 12",
            "",
            "Great phone",
            "I love my new phone",
            "great phone",
            "Great upgrade",
            "Absolutely beautiful",
            "Super phone",
            "No charger",
            "The right size",
            "Such a fab phone",
            "Superb service",
            "Very good"
        ],
        "review_text": [
            "Can’t complain about iPhone 12 that I purchased from Argos nice piece of gadget",
            "I bought this recently to upgrade from my iPhone 8. I managed to upgrade to the highest storage as Argos had a great deal going on. Can’t wait to use this more, it’s been great so far! Make sure you get a screen protector though, as it’s such a big screen space to get potentially damaged!",
            "So this phone is unreal. Such an upgrade from any phone I’ve used before and I can’t really find any negatives. It’s fast, bright and a stunning colour. \nDefinitely would recommend!",
            "Going back to the iPhone was the best decision. Super-working, clear menu, and only advantages.",
            "It’s just brilliant - I changed from the iPhone 6 and everything is better! I was slow to upgrade but so glad I did",
            "Great phone and very good service by Argos",
            "I love this phone, fabulous buy.",
            "Love the phone. The insurance and care for the phone covered by Argos are also better than the ones Apple care was offering.",
            "great phone, looks very stylish and slimline,  extremely easy to use,",
            "Came on time and is a great upgrade from my previous phone.",
            "Lovely customer service . \nDelivered on time. \nAnd the phone is absolutely gorgeous thank you",
            "I really like my new iPhone. The size is sensible for my pocket, not to big or heavy. Lovely design like all Apple products.",
            "Not happy as the phone don’t include proper charger !Expensive and on top of that you have to spend more to buy charger and pretending the want to smaller box ?!that is ridiculous",
            "I do not like big and heavy mobiles, this one has the right size.",
            "Upgrading from iPhone 8, this is a massive upgrade, super fast, super light, super screen, lovely colour - totally love it !",
            "2 weeks wait when ordering online from the Apple store, tried Argos and got the same phone at the same price with next day delivery! Was even able to use PayPal so I could use PayPal Credit. Couldn’t be happier.",
            "Compared to my old iPhone 8 it’s very fast still working my way round it lots of new features and battery life is much better"
        ]
    }
}