{
    "140/1055": {
        "remotekey": [
            "140/1055"
        ],
        "item_category": [
            "2019 is the big button, easy to use phone, for people who need something that they can rely on. It is packed with a 2.4 large display, big keypad & hard keys for an easy-to-use experience. The 2019G has a long-life battery and charging cradle included in the box. This phone is hearing aid compatible and has a built in SOS button, which will call through several preset numbers when pressed. "
        ],
        "summary_star_rating": [
            "4.1"
        ],
        "no_reviews": [
            "79 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "86%"
        ],
        "review_rating": [
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "1",
            "1",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "2",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1"
        ],
        "review_date": [
            "30 July 2021",
            "2 June 2021",
            "2 June 2021",
            "6 May 2021",
            "6 May 2021",
            "4 May 2021",
            "29 April 2021",
            "20 April 2021",
            "20 April 2021",
            "20 April 2021",
            "15 April 2021",
            "14 April 2021",
            "6 April 2021",
            "26 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "31 December 2020",
            "11 December 2020",
            "25 November 2020",
            "24 November 2020",
            "18 November 2020",
            "11 November 2020",
            "10 November 2020",
            "30 September 2020",
            "23 September 2020",
            "22 September 2020",
            "9 September 2020",
            "26 August 2020",
            "25 August 2020",
            "8 July 2020",
            "7 July 2020",
            "7 July 2020",
            "7 July 2020",
            "30 June 2020",
            "23 June 2020",
            "16 June 2020",
            "10 June 2020",
            "3 June 2020",
            "28 May 2020",
            "27 May 2020",
            "13 May 2020",
            "6 May 2020",
            "3 May 2020",
            "22 April 2020",
            "7 April 2020",
            "25 March 2020",
            "25 March 2020",
            "11 March 2020",
            "5 March 2020",
            "4 March 2020",
            "4 March 2020",
            "3 March 2020",
            "26 February 2020",
            "19 February 2020",
            "12 February 2020",
            "12 February 2020",
            "22 January 2020",
            "15 January 2020",
            "8 January 2020",
            "6 January 2020",
            "3 January 2020",
            "2 January 2020",
            "2 January 2020",
            "2 January 2020",
            "28 December 2019",
            "26 December 2019",
            "6 November 2019",
            "5 November 2019",
            "30 October 2019",
            "23 October 2019",
            "16 October 2019",
            "9 October 2019",
            "17 September 2019",
            "13 August 2019"
        ],
        "review_title": [
            "Perfect",
            "Not good for elderly.",
            "Great phone",
            "First mobile for me",
            "Cheap phone, easy to use",
            "Simple to use mobile",
            "Had better",
            "Easy to use phone",
            "Super easy to use",
            "Great little phone for the price",
            "Excellent mobile for my mum",
            "Good phone for the elderly.",
            "Easy to use.",
            "Simple to use - once you've worked out how.",
            "Ideal for frail elderly",
            "Brilliant to use big numbers easy to set up",
            "Bought",
            "The mobile looks good and charges up fast",
            "Great phone for my granddad",
            "The phone looks lovely and it does all it says.",
            "My mobile phonr",
            "Phone",
            "Problems with Simcards",
            "Good phone, awful instructions",
            "Decent mobile phone",
            "Mobile phone",
            "It is like when I started with a normal mobile pho",
            "Good sized keypad and charging stand",
            "Great phone with all basic needs",
            "Easy Phone",
            "The phone was for my mum",
            "Bought for a Friend (To Up Grade the Menu System)",
            "Great phone. Big buttons",
            "Simple phone to set up.",
            "Great Phone for the older generation",
            "Good for been dawn town",
            "Looks good and easy to use",
            "Returned",
            "User friendly",
            "Easy to use phone",
            "Great simple phone for elderly.",
            "50 x Better than expected Excellent Phone : )",
            "Decent low cost basic phone but no instructions!",
            "Suitable for sum",
            "Good for target market but some silly design flaws",
            "A great basic phone",
            "Excellent phone for the elderly",
            "good phone for my mum wiht big buttons",
            "Alcatel 2019 sim free phone",
            "Phone great for elderly mother",
            "Great large buttons and easy to use",
            "looks fabulous",
            "Nice and big phone",
            "Easy to use",
            "Just what we needed",
            "Dont buy",
            "Great wee phone for a first time of using a mobil",
            "Could be so good yet sadly a big negative.",
            "Terrible, does not work",
            "very pleased with my new phone",
            "Easy to use and very fast connection to Internet",
            "Phone bought for my mum",
            "Great phone and suits the purpose",
            "Great big buttons and easy to use",
            "This phone is not fit for purpose",
            "Mobile phone",
            "Great practical phone",
            "Bought for my elderly father",
            "Too complicated for the market it is aimed at.",
            "Alcatel 2019G phone",
            "Easy to use. Fabulous SOS function.",
            "Easy to set up",
            "Very good for the old folk",
            "Easy mobile for the elderly",
            "Bought for my son. He didn’t find it easy to use a",
            "Love the simplicity of this phone.",
            "",
            "A good simple phone",
            "Not suitable for elderly"
        ],
        "review_text": [
            "Absolutely perfect for the person I bought it for, as easy to use as the house phone",
            "Bought for my elderly mum, it is not easy to use.",
            "I brought this phone for my eldaly father as it had the larger buttons",
            "This is the first mobile I've had which my granddaughter sought out for me.  She taught me how to use it which I found quite easy. As I have hearing problems it seemed the best on the market.  It wasn't expensive and I think value for the price paid. Haven't used it much as I'm a bit anti mobiles but was made to have one by my daughters for safety reasons.",
            "Great cheap phone, easy to use, good buy.",
            "Easy to use for calls/voicemails and texts",
            "It's ok but nothing great.",
            "Bought for my mum who doesn't do tech.  Phone is easy to setup and the big buttons are a bonus.  Mum still learning to use phone, but I am confident that this phone will get used much more than mobiles bought for her in the past.",
            "Brilliant phone with large buttons, easy to use.",
            "Great little phone for the price",
            "This mobile is exactly what my mum needed nothing more nothing less.  Firstly it has large buttons so easy to use, big screen and a lock key that slides up and down on the side.  Best of all is the charging cradle, she can charge the phone without having to mess around with usb cable as this can be too fidly for her.     There is also an sos button on the back which can be used in an emergency that alerts stored contact numbers by text.",
            "I bought this phone for my 94 year old mum to replace her antique Nokia. It’s a simple phone with large buttons. It’s unsophisticated which would suit the older, non tech generation. Only complaint is in the contact menu you have to scroll through several options before seeing any of your contacts. Otherwise a good phone for the price.",
            "This mobile was bought for my father in law and finds it great with large buttons and very clear instruction.",
            "Bought for my Mum who found using smart phones too complicated.   Its simple to use and the buttons r easy to distinguish.   I would say that the circle button for directional control in the menu is not simple - fine for me but mum has struggled with this aspect.  Its not an issue as she'll only be using it as a phone in emergencies",
            "Bought this for my increasingly frail mother in law who has not learned to use modern technology and so this phone seems to be the best especially for the next time she is admitted to Hospital",
            "Excellent easy to use",
            "Bought for an elderly family member, easy for them to use.",
            "I purchased this for my elderly mother who has tried mobiles before but couldn't get away with them. However she taken to this mobile as it is easy to use. We did however find it hard to reach the page for balance and top up.",
            "Great phone for the older generation my Grandad was happy with it",
            "Excellent value for the money paid for it. I’m using mine as a house mobile phone. The buttons are perfect size for everyone to manage, including young children. I like how it sits on the charger. It looks more expensive than it actually is. I will definitely buy one for my mother-in-law. Excellent product.",
            "Fits exactly to my requirements.  Cradle fab no fiddling with inserting a cable to charge. No rooting for cable. Easy to read and operate the buttons.",
            "Brought this for my elderly grandmother who can’t even see a landline with big buttons perfect for her if there’s an emergency one button calls 5 pepole",
            "Erratic acceptance of Simcards.Did not accept the EE cards provided when the phone was purchased nor with a separate EE card provided later.A Vodafone card provided yesterday is also having problems with acceptance.If possible a replacement Alcatel 2019 phone would be the answer.Could this be arranged as it has the features I like/",
            "Bought for an elderly neighbour, the stand is great as it keeps the phone in the same place and is always ready to go. \nThe instructions are non existent which has made it very difficult for her to work out how to use it. \nAlcatel’s Help Desk were great and sent me a link to a 43 page (!) pdf file, the content of which was just what I needed. \nCome on Alcatel, don’t make it difficult. Include proper instructions in the box. \nPlease.",
            "This is a decent mobile phone but although the buttons are big the actual phone I feel is not big enough for the elderly especially men with big hands - I have since purchased a flip phone -  again with big buttons and the user can operate the flip phone much better and place it correctly to use.  The phone that I am reviewing is fine but not ideal for this user",
            "Bought this for my dad simply to use and buttons not fiddly just a good basic phone that does what it says",
            "Best phone I have. You can talk to people more than just text or email. It's a breath of fresh air. Well worth having.",
            "Good sized keypad makes it easy to use. I have poor eyesight so the stand for recharging is better than trying to connect to a cable.",
            "This was bought for an elderly lady and it’s filled her with confidence due to its ease and reliability. Would certainly recommend as a good basic reliable phone.",
            "Bought this phone for my 95 year old mum after her old phone broke.\nShe mastered it straight away and finds it easy to use.",
            "My mum has sight problems along with hearing trouble and can use this phone perfectly",
            "Bought for a Friend as her previous phone was a Alcatel (Android System) and she knew how to use the (Android) system it was perfect, It's a very good upgrade with a few more add on's for the modern phone. The included Head-Set allow for more privacy. She is very Happy with it.",
            "Good phone for elderly. Cradle is helpful for charging",
            "Bought to replace the same phone that was water damaged for my 94 year old mum. Wanted the identical phone as it is a good size and very easy to use. A little disappointed as the previous phone had a choice of ring tones and my mum could answer a call by pressing any button. Now you have to ensure you answer a call by pressing the green button. Can cause my mum problems as she suffers with arthritis and cannot see very well. However, the phone is one of the easiest to use and I would recommend.",
            "My son managed to show his 80+ granny how to use the phone competently in an afternoon, no mean feat I assure you!  She loves  the fact that it takes a picture, and the SOS button, a great feature for the elderly or infirm user.",
            "This is good to us dawn town for family friends and work to call you\nNo fuss just answer text is a little bit difrent to master but the phone is just good for that quick call",
            "It's a lovely little phone, my brother had a stroke but can use it must better then theses new phones",
            "This phone will not connect to three network not mentioned in listings of features but it does in the reviews",
            "User friendly \nscreen lock not as effective \nAccessible \nValue for money \nBattery life Reasonable",
            "This phone was bought for my elderly father. Very suitable for him.",
            "Bought this for my father who had to go into a care home during lockdown. It gave him independence and the ability to communicate with family and friends in a simple enough firm that he could cope with easily.",
            "More Features than a Swiss army Knife , For the money and its cheaper than a Swiss Army Knife ; ) , I bought This for My Mum who has bad eye sight and she found it easy to read the numbers and was simple to use , I would suggest you read the spec on the phone as it can do nearly every thing a smart phone does.",
            "This was for my Mother in Law (in her 70s) and she seems to be getting on fine with it despite there being no instructions in English enclosed? I had to download the manual and print it off. Made even more frustrating by lockdown and the current inability for me to just show her how to do something - describing on the phone is so much harder and a lack of instructions for her to refer to really didn’t help. Having said that the build quality seems ok and a charging cradle is a great addition.",
            "Unfortunately it wasn't suitable for my mother. I tried to return it but was told I couldn't as I'd put the battery in to see what the screen etc was like. It looked nice though and the charging cradle is a good feature.",
            "The phones very basic, exactly what we wanted. Bought it for my father in law who's a technophobe. He wanted a phone and a paper phone book. For this its perfect, sound is clear, pressing OK button whilst in call uses speaker which is clear. There's a physical switch for the torch. The lock switch is tight and to difficult to move with his arthritis. A bigger thumb grip would have been better. There's no basic ring, he needed one like a house phone. We got one but after a few hours of computer.",
            "We bought this for our elderly aunt who is in hospital. With lockdown we have been unable to visit (understandably) and bought this to allow her to keep in touch more frequently. It’s very simple to set up which we done and easy to use especially for someone who has never had a mobile phone. It has other functions such as radio and camera but this isn’t needed for her so she hasn’t used them.",
            "Bought this for my father in law. Simple phone that allows calls and texts. Very basic but also very simple to use and he loves it. The phone also has a charging stand so he doesnt have to fiddle with plugging cable in for charging, just sits it on its stand. There is also an SOS function that you can program, allowing the SOS button on the back of the phone to sound an alarm and auto dial to whichever number you allocate ( my mobile in our case ) ideal for older folk with health problems.",
            "good phone for my mum wiht big buttons and easy in using. Good price. Im very happy with.",
            "Looks good, unfortunately rather complicated. If you need instructions on what everything can do, just ask one of your adult kids!",
            "Mother95 in care home on lock down. This has been wonderful at keeping in touch every day.",
            "Great product and easy to use",
            "Small price and the best costumer service !",
            "Ideal large mobile for my elderly father who has difficulty seeing clearly. Very basic phone with no extras as using only for calls",
            "Finally a phone my 86yr old dad can use! Easy to see numbers and make calls. Also  have put in emergency numbers so he only  has to press button on rear of phone if he has a fall or something like that and it will keep calling those on it or txt if no answer so they know help is needed.",
            "I bought this for my elderly mum, she is not tech savvy with mobiles but this Phone is easy to use.",
            "Brought this for my grandad as he has hearing aids and the buttons are big enough for him. It had no instructions in the box. It say sim free phone. But a ee sim  card in and it wouldn't send a text. Took it back and brought another model.",
            "I got this phone for a old age pensioner who never had a mobile phone",
            "I really want to give this phone a great review but sadly not. The features of the phone are good for this price and the big button is great for those who struggle with smart phones. Loads of good features like a radio. The only annoying negative is the messaging is so difficult when you switch on auto correct. It's so small and difficult that everyone that tried the phone really struggled to send just the simplest of texts. So frustrating because other than this it's a good phone.",
            "This phone has electronic interference with it's own microphone and can never actually work as intended. Terrible design.",
            "I chose this type of phone as it has flip cover and I am very happy with it --   many thanks",
            "Solid caseing comfortable to hold. The mobile phone is appropriate for any age Group, with larger keypad buttons. The ALCATEL 2019G IS excellent value for money and very strongly put together.\nIt has a scroll across Menu and any user can work out the Menu options.",
            "Easy to use and re charge would recommend",
            "Phone was purchased for someone their 80's. It's a very useful phone if you struggle with arthritis or other ailment as the keypad has large buttons. Very impressed with the SOS button on the reverse of the phone which, when pressed, not only sends out a loud police siren type alert but also sends a text message and auto dials up to three users. If the first caller on the SOS list doesn't answer it reverts to the second. A very good feature if you're in trouble and require assistance.",
            "Bought for an older relative , the phone was easy for me to set up and get going , although the lack of paper instructions might be an issue for some. The SOS button and ability to set up speed dialling makes it easy for them to use.",
            "This phone was brought for my elderly mother. The phone will not accept incoming calls as it keeps locking onto call divert. On looking at other reviews after purchasing this phone, this issue seems to be a big problem.\nI will be returning this phone as it’s not fit for purpose",
            "The item is perfect and ideal for the person I got it for as it speaks when you press the number buttons so ideal for people who are partially sighted.",
            "Easy to use practical phone",
            "I got this phone for my elderly father's Christmas and it has been absolutely perfect for him, I highly recommend this item to everyone who has an elderly relative.",
            "I bought this for my 92 year old Mum. This looked ideal but wasn’t as good as we would have liked.\nThe Pros are\nGood Price\nBig clear screen\nLarge keys\nCons\nThe ring tone - there is no Ring Ring traditional tone as standard. \nIt doesn’t need a music player etc.\nContact list needs to be much easier to use.\nA user manual",
            "The phone would not work with either Three or Lebara sim cards. It only worked for emergency calls. I wouldn't recommend that anyone purchases this phone.",
            "Fabulous design, easy to use and the keys are easy to see. A present for my dad who is a techno phobe. He loves it.",
            "Good phone for the money it has everything that I need",
            "My 85 year old father-in-law broke his phone and this has been an ideal replacement. Large keys, one button dialing and a handy charging dock. Well worth the money",
            "Easy to use with large buttons also SOS button for emergency contact which sends a text when pressed but also sounds an alarm",
            "The service I received when buying this product was first class. Very helpful and patient assistant.",
            "Love its big buttons and the voice telling me exactly what numbers I'm pressing is very helpful",
            "It is a good looking phones",
            "The phone was purchased for a person in a nursing home\nCannot speak for battery life as not be in use long enough. \nThe features are adequate for the purpose for which the phone was purchased.",
            "Purchased for my 83 year old mother as she wanted something simpler, lighter with larger keys than her current phone in order to select numbers and dial, no text, no internet just simple phone calls. The physical design was ideal, however, the software let it down.  I could find my way around but did not think it was intuitive. My mother to tried but was completely lost. This phone is targeted at the elderly but the menu navigation is too complex making the phone a complete failure."
        ]
    }
}