{
    "838/2373": {
        "remotekey": [
            "838/2373"
        ],
        "item_category": [
            "The HUAWEI P40 Lite comes with the HUAWEI AppGallery and is not compatible with Google Play Store and Services. With 4 rear cameras, HUAWEI P40 lite shoots wider, clearer and closer than you ever could have imagined. With its 4200 mAh battery, you'll get through the day on a single charge. The HUAWEI P40 lite is equipped with a Kirin810 chip, which brings its own formidable arsenal of tech. There's enough power under the hood to handle even the most demanding games. "
        ],
        "summary_star_rating": [
            "3.9"
        ],
        "no_reviews": [
            "18 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "78%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "1",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "23 June 2021",
            "8 June 2021",
            "2 June 2021",
            "5 May 2021",
            "20 April 2021",
            "30 March 2021",
            "17 March 2021",
            "23 February 2021",
            "14 February 2021",
            "10 February 2021",
            "10 February 2021",
            "1 January 2021",
            "31 December 2020",
            "2 December 2020",
            "2 December 2020",
            "27 November 2020",
            "24 November 2020"
        ],
        "review_title": [
            "Great full",
            "Very  good",
            "My phone",
            "Good phone",
            "The Huawei phone was rubbish.",
            "",
            "Phone is really gorgeus",
            "Looks good and works well",
            "",
            "",
            "Great spec, massive screen and quite fast the pho,",
            "Excellent product",
            "No google play store and could not download apps",
            "The was super and the battery  lasts",
            "No possible to install apps",
            "Needed a decent phone and I got one",
            "Dont have google play. Its very hard to dowland",
            "My Huawei P40 light was a great purchase."
        ],
        "review_text": [
            "I bought the phone month a go, it’s very nice",
            "I like, this phone is it very good. I love the camera.",
            "It's great, Iove it!",
            "I bought this phone month ago and I'm so happy with it",
            "The Huawei phone would not connect to my BT EE signal booster. All my friends phones do, automatically, as does my old Huawei 10 phone. Without the booster, I can not receive or make calls from home. The phone is also not Google compatible and so I could not use either of my banks apps. It has been very difficult to get a refund back from Argus, even though I returned the phone personally and within 4 days.",
            "Hi I’m happy with this phone and shoping with argos shop .",
            "Phone is Simple too use.and very satisfied for that price",
            "Looks good and works well",
            "Yes I’m happy with this mobile phone. Very easy to manage a good line",
            "type fast, take a good photo the only problem is that there is no play store and YouTube",
            "Huawei is a great company, they are creating components for Samsung and iPhone as well so everyone should understand that they would not have such phone as that if wouldn't be huawei",
            "The product is excellent and does everything that I need.  Argos description was crucial in making the purchase decision and the click and collect service was very smooth",
            "Never ever will buy huawei mobile product absolute waste of money and time.",
            "The phone is economical in every sense and I will not hesitate to recommend it to friends and family.",
            "This is the worst phone ever.. I didn’t know when I purchased it that you can’t install almost any apps on it as google play is not working( I needed messenger for Facebook, Skype, mobile banking).. I need a lot of apps  and there is no possibility to download them.. what kind of smart phone is this with no app available? It’s the same as having an antique phone except that you can take nice pictures. very disappointed!I tried to return it only to be told if the pack is unsealed I can’t anymore!",
            "Nice fast phone worth the money",
            "Without goodle play its hard to dowland aplications",
            "This phone is a great purchase. Screen bright, very fast, battery last more than a day. Very happy"
        ]
    }
}