{
    "942/0911": {
        "remotekey": [
            "942/0911"
        ],
        "item_category": [
            "All you want, to do all you love. An unexpected kind of phone made for the social generation. With the Galaxy S20 FE you can have it all, for much less than you'd expect. Get a state-of-the-art Triple Lens Camera, with some of our most loved S20 pro-grade camera features. Like, the 12MP Ultra-wide lens, incredible zoom features like the 30x Space Zoom and the 3x Optical Zoom, along with our clear as day Night Mode. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "57 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "84%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "1",
            "2"
        ],
        "review_date": [
            "16 July 2021",
            "9 June 2021",
            "5 June 2021",
            "3 June 2021",
            "31 May 2021",
            "20 May 2021",
            "16 May 2021",
            "14 May 2021",
            "13 May 2021",
            "6 May 2021",
            "6 May 2021",
            "27 April 2021",
            "22 April 2021",
            "18 April 2021",
            "18 April 2021",
            "17 April 2021",
            "14 April 2021",
            "8 April 2021",
            "6 April 2021",
            "6 April 2021",
            "5 April 2021",
            "5 April 2021",
            "4 April 2021",
            "4 April 2021",
            "2 April 2021",
            "31 March 2021",
            "29 March 2021",
            "28 March 2021",
            "27 March 2021",
            "25 March 2021",
            "23 March 2021",
            "19 March 2021",
            "18 March 2021",
            "14 March 2021",
            "10 March 2021",
            "8 March 2021",
            "1 March 2021",
            "28 February 2021",
            "26 February 2021",
            "21 February 2021",
            "20 February 2021",
            "20 February 2021",
            "15 February 2021",
            "14 February 2021",
            "13 February 2021",
            "13 February 2021",
            "12 February 2021",
            "11 February 2021",
            "11 February 2021",
            "10 February 2021",
            "6 February 2021",
            "6 February 2021",
            "6 February 2021",
            "6 February 2021",
            "2 February 2021",
            "1 February 2021",
            "25 November 2020"
        ],
        "review_title": [
            "I like my S20FE phone",
            "Great",
            "Give samsung Sam",
            "Great to use",
            "It's great",
            "Great phone but shocking battery life",
            "Amazing",
            "S20FE",
            "Samsung galaxy s20fe Brilliant phone ☆☆☆☆☆",
            "Upgrade",
            "everything you need from a mobile device",
            "Fabulous phone",
            "So far so good",
            "Eh its ok",
            "Replacement for Google pixel 4xl",
            "Great fone",
            "S20fe",
            "Great phone",
            "Excellent quality and excellent value",
            "Excellent phone all round",
            "Brilliant colour",
            "Ideal",
            "Great phone amd features",
            "Great price performance balance",
            "Smart Phone",
            "I'm loving this phone",
            "It's okay",
            "Annoying, this will be my last samsung",
            "Samsung s20 fe",
            "Great phone!",
            "S20 fe",
            "Great phone but !!!!",
            "Simply amazing",
            "Great features",
            "Lacking  2  most  important  features",
            "Great phone",
            "S20 fe",
            "Amazing phone",
            "Samsung S20fe",
            "Samsung Galaxy s20FE",
            "Great mobile",
            "Galaxy S20 FE",
            "S20 FE",
            "Love the S20 FE",
            "Samsung galaxy s20 fe 5g",
            "Love the phone!",
            "s20fe",
            "Nice phone",
            "Samsung s20e",
            "Perfect upgrade",
            "Nice phone works well S20fe",
            "S20FE",
            "S20 FE Pro's & Con's",
            "S20 FE 5G",
            "Love my s20fe switched from iPhone",
            "Changes samsung fe s20",
            "Disappointed"
        ],
        "review_text": [
            "Lots of new items that helps a great deal when looking for something.",
            "Is very simple to use, and make beautiful photos and video!!!",
            "I would like to request to hand over samsung Sam. Ty",
            "Phone is user friendly with very many different applications",
            "I have iPhones for donkeys years now and decided that they had got way to expensive so would try Samsung this time .Iam so happy I have .It is as good if not better then the Iphone .Iam very happy with it as it does everything I want and need .The main thing it is so much cheaper and I am not missing the Iphone at all",
            "The phone takes great pictures, has an intuitive operating system but the battery life is rubbish. I'd only had the phone a couple of days and found myself charging it twice a day. I changed a load of settings to help with the battery life and it seems to be a bit better. I shouldn't have to do this on a brand new phone",
            "Literally perfect in both performance and features. Not a bad thing about it",
            "Brilliant phone very happy........................",
            "Easy to use in every way Love the screen size  Great camera and video Super choice of colours Ive chosen mint green Great phone for the Samsung lovers",
            "Like my new phone bought has a upgrade please with purchase",
            "cool design, 5G enabled, screen size is just right.",
            "It really is a simple and fantastic phone. I've not took advantage of its full ability yet but so far so good. Beautiful colours too!",
            "Only had the phone a couple of days so still finding new features, so far it's been a very nice phone to use.",
            "I like the phone like it's good but I rlly don't like the fact that it doesn't come with earphones and all of the earphones at the shop won't work with it so idk what to do but overall a good phone.",
            "A bit disappointed in this phone ,as supposedly a contender for a premium phone ,this just does not cut it with me ,build quality fair disappointed though I am so used to a phone that's all glass back and front ,but also water and dust proof ,just got android 11 update ,which I already had on my pixel phone .if you don't mind a plastic back then this is not a bad phone",
            "Quick and lots of new features to use. Just wish was a bit smaller",
            "Good phone  but face recognition and fingerprint is rubbish was better on s8 as fingerprint was on back worked so much better as everyone has screen protectors",
            "Size of phone camera amazing easy an simply to use great for people who text quickly",
            "Samsung so it cant go wrong only ever use Samsung had new one every upgrade",
            "Very happy with this phone. It has a bright, clear screen which is very easy to use and useful features. Plus if you had a previous Samsung phone,  you can easily switch your information from your previous phone,  which is very useful and being android,  you can do the same with your Google apps account. The camera is very good and takes clear shots. It's responsive and quick.  The only downside for me is the fingerprint sensor doesn't appear to be as responsive as my previous S9 Plus and it's on the front, which is more faffy.  Otherwise,  I love the S20 FE.",
            "Good size, easy to use. Only had I for short time so still have to figure out some things. Great at taking pictures ( good quality) . Only thing I would say is battery life but that could be because I am using it to figure things out.",
            "Does what I want, make calls, sends messages, Internet plus more without any drama. A great upgrade from s7",
            "I absolutely love the cameras, they are amazing! Would be cool if you could make the home page etc a bit more your own style.",
            "The phone is slick, fast, does it all at a much more reasonable price. I have always had the flagship but decided this time I did not need it. The S20 FE does it all though. I am sure I am missing something of the flagship but as I don't know it is absolutely fine.",
            "Love the phone battery usage goes quickly though when it's connected to the buds. Over heats whilst on video calls too.",
            "It looks great and has all you could possibly need in a phone and more. Its super fast and I love all the extra security because I do alot of online shopping and banking. There's more than enough storage and a great big screen which I like. It also has 3 cameras to give great pictures. I Would definitely recommend this phone",
            "Good phone. Poor battery and heats up excessively and the charge is slow. Sent phone back and got it replaced still does it on this one. Love the design though its spot on",
            "This is the most annoying phone Samsung has ever made. Email app keeps giving up, you need to uninstall then reinstall to make it work for another couple of weeks. Bixby button instead of power button! Why? Bixby is utter junk! Drop it! It's voice recognition is terrible compared to Google assistants. The finger print scanner on this phone is utterly useless.\nThe older phones had an app button that took you to your apps. Now you have to do a series of kungfu like finger swipes all over the screen to find that you're still in the wrong place.",
            "I like this phone because of hole punch camera at the top of the screen and how you can make the screen bigger when you are taking a photo or you are watching something on your phone. I also like the fast charging on the phone as well.",
            "Great phone as expected from Samsung. Marked down only because battery life is so poor. My S6 which I upgraded from had better battery life!  Apart from that the S20 is perfect, amazing features and pics are stunning quality ! Thank you.",
            "It's fast , full of great stuff. Amazing camera.  Easy to use",
            "Samsung s20 fe \nGreat phone does everything i want it to buy there is no notification light at the top corner of the phone. Also holding the lock button does not have you the option to restart the phone. 2 simple things but very annoying things i have found.",
            "Simply amazing... the Samsung S20FE is such an easy phone to use, with some amazing features. The camera on this is extremely clear and gives the amature photographer, professional photos...",
            "Love everything about the S20 FE. Looks very stylish",
            "I  IS  A  GOOD  MOBILE  BUT  UNFORTUNATELY  IT  IS   LACKING  TWO  IMPORTANT  FEATURES  IN  MY  OPINION  \n\nI)    I  DOES  NOT  HAVE  A  RED  LIGHT  INDICATING  THAT  THE  PHONE  IS  CHARGING  AND  NOR  DOES  IT  HAVE  A  GREEN  LIGHT  INDICATING  THAT  IT  IS  FULLY  CHARGED .\n\nIT'S  A  PITY  BECAUSE  IT'S  A  GOOD  PHONE .    I  WOULD  RECOMMEND  THIS  PHONE  TO  A  FRIEND  PROVIDED  THESE  FEATURES  ARE  ADDED  TO  NEXT  PHONE ,  AND  I  WOULD  WARN  THEM  TO  THIS  FACT .\n\nTHERE  IS  ONE  OTHER  PROBLEM  WITH  THIS  PHONE ,  WHEN  TYPING  AND  YOU  WANT  TO  PRESS  THE  SPACE  BAR ,  YOU  ACCIDENTALLY  PRESS  THE  HOME  KEY ,   WHICH  IS  LOCATED  DIRECTLY  BELOW  THE  SPACE  BAR .\n\nOTHERWISE  ITS  A  GOOD  MOBILE  .\n\nPERHAPS  IF  THE  KEY  BOARD  WAS  RAISED  UP  ABOUT  HALF  AN  INCH ,  TO  CLEAR  THE  HOME  KEY .\n\n\n\nii )",
            "I like my easy to use S20 FE. Touch screen works fine with a screen protector. Great features.",
            "Love it..overall great performance. Glad I came back to Samsung.",
            "Upgraded from the s9 to the s20 Fe 5g and what an upgrade!! Loving the bigger screen the 120htz refresh rate. The 3 cameras on the back take so much better pictures then the s9. And the one ui is amazing software",
            "Fantastic device, solid construction, attractive design, advanced features combined with value for money equals a sure thing.",
            "Don't see many differences to my Samsung Galaxy s10E except the size. The Camera with the flash on was certainly clearer on the s10E. This one leaves a cloudy photo.  It also doesn't have a button to turn it off, it's done on the phone and slightly more difficult to screenshot. Apart from that the phone's alright but would just stick to the s10e myself!",
            "Samsung s20 FE is nice handset big screen also camera is clear photos",
            "I love this device\nI've never had anything so modern!\nThe only things that I am not so happy with is how close together the backspace, enter and space bar are as I often press the wrong button (but that's a real bottom of the barrel issue). The other thing is that because it doesn't have a headphone jack you either have to buy corded headphones that plug into the charging port or get wireless ones. I would've liked at least a corded pair included with the device...",
            "I love Samsung pay, I don't have to take my bank cards with me everywhere!",
            "Great features, gorgeous screenz fab camera and all at a very reasonable price point.",
            "I love everything about my new phone and as you would expect from samung it's nice clean lines, it's beautiful crystal clear screen and it's fast processing. The new camera is great for taking pictures in day light and just as good in the evening light it has very good storage which you can double with a micro sd card there's so much more to this phone I've not discovered yet so all in all a great product",
            "I am very happy with S20 FE it has exceeded my expectations. Especially  with big screen",
            "I am still getting use to it but the basics of the phone 2 my s8 are the same . but i would of liked the option of a plug in port for earphone than just bluetooth.",
            "The volume is very poor. If you are talking to someone you need the volume full blast whilst on loud speaker and it is still difficult.",
            "Great camera,good sound quality,easily accessible features",
            "The s20 fe, feels lighter in the hand, and much quicker in it applications.",
            "I miss not having finger print sensor on the back like my old S9+ and it's missing heartbeat sensor which I used a lot to keep track of my health as I'm now 50 years old. I have been a long term Samsung user.",
            "Fantastic phone with top tech features but at a great price. Flagship phone, non flagship cost.",
            "As a whole i love the phone, especially the camera.\nHowever the two areas that i dislike that are different to the S7 Edge and also my last mobile the S9 are the settings when a pop up screen opens, such as for a text message. The settings for these are in a tiny thin line at the top of the screen which are very impractical. \n\nSecondly call and especially ring tone. Who actually thinks the tones on this phone are good? Most of them are not practical.\nI used to have a different generic tone for texts; calls, WhatsApp messages and notifications. However how these phones have been programmed make that so difficult to achieve. I wanted to add one specific tone to a WhatsApp group thought i had set it as such but in fact every app sound changed. Yet again why change from a previous model that worked to a new method that is more complicated? To make matters worse i the had to go through all apps on notifications to individually set. But this was not easy as when swapped settings from old to new phone tones were not included. Why??\nI then had to go through each contact, each whatsApp chat, each text message to edit settings. Yet again not simple.\nPhone are supposed to get easier and not harder like in these ways.\nI have always been  Samsung and Android apart from initial few Nokia in late 90's but if Samsung and Android keep over complicating how we use them to cheapen the software after adding more expensive apps i may go elsewhere next time!!\nYou have good features on phones so why make the usage in other ways harder?",
            "I got the S20 FE as a second choice because the Plus was out of stock, and it's the best decision i could have made. \n\nMy main requirement was the camera quality and despite *only* having a 3x optical zoom the software in the FE more than makes up for it. There's no comparison compared to my previous device, a Huawei P20 pro, which is better on paper. \n\nOther than that the FE is fast, the screen is bright and samsung OS is intuitive.",
            "Absolutely in love with the features and size of phone. So easy to use would never go back to iPhone again",
            "The phone run fast and seem great. But no headphone jack means I can't charge and listen to music unless I buy Bluetooth headsets when I have perfectly good wired item. If you use an adapter to listen to music there is a contact ticking noise in the background seems to be a constant problem with Samsung phones. Spoils a great phone",
            "Not impressed with this phone...The plastic back is not nice given the price. The battery life is very poor. The phone call quality isn’t very good. I have a few apps that keep opening by themselves, even when I’ve closed all apps down before turning the phone off, this is not only irritating but battery draining. Cameras are ok but not as good as my previous phone. the screen is clear and a nice size. It is a nice looking phone but I do feel like I’ve downgraded rather than upgraded."
        ]
    }
}