{
    "827/2696": {
        "remotekey": [
            "827/2696"
        ],
        "item_category": [
            "The Galaxy Note20 5G puts productivity and play in the palm of your hands. It's got Microsoft Office integration, so you can create, upload and download documents on the go. You can even take notes with S Pen and convert them to Microsoft Word, at a touch. A pro-grade camera lets you take stunning shots and 8K video – then edit them to perfection. It's serious about gaming too, with console level gameplay and controller compatibility. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "82 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "83%"
        ],
        "review_rating": [
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "4",
            "3",
            "3",
            "4",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "1",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4"
        ],
        "review_date": [
            "4 May 2021",
            "22 April 2021",
            "27 March 2021",
            "10 March 2021",
            "3 March 2021",
            "2 March 2021",
            "15 February 2021",
            "31 December 2020",
            "22 November 2020",
            "28 October 2020",
            "22 October 2020",
            "14 October 2020",
            "13 October 2020",
            "13 October 2020",
            "12 October 2020",
            "12 October 2020",
            "12 October 2020",
            "11 October 2020",
            "10 October 2020",
            "10 October 2020",
            "10 October 2020",
            "10 October 2020",
            "10 October 2020",
            "10 October 2020",
            "10 October 2020",
            "10 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "7 October 2020",
            "29 September 2020",
            "22 September 2020",
            "15 September 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020"
        ],
        "review_title": [
            "Samsung galaxy note 20 bronze great phone.",
            "Stunning",
            "Less sensors",
            "Working so well",
            "My phone looks superb and brand new",
            "Great phone",
            "Really good phone",
            "Fabulous phone bright camera",
            "Phone is great but something's really bothering me",
            "This phone is great",
            "Superb Phone for the price",
            "Great  feachers",
            "Love it",
            "Great Phone, good upgrade from my note 9",
            "Great but in comparison to the earlier note 8 9",
            "Big, good looking, not intuitive",
            "Note 20 5g",
            "Nice phone, some issues",
            "Not much better than my S7",
            "Great camera, screen and features.",
            "Very Disappointing",
            "Better phone than Note 10",
            "Love my note",
            "Fantastic mobile phone in everyway",
            "Not as good as I thought it would be2",
            "Excellent",
            "Note 20 5g",
            "Outstanding",
            "Amazing useful phone",
            "Lovely jubly",
            "Love it!",
            "Love this phone....",
            "Needs work",
            "Easy to use",
            "excellent phone",
            "Great features",
            "Great phone love it",
            "Love it!!",
            "Good phone, bad battery life",
            "Half hearted",
            "Good Phone",
            "Love the phone!!",
            "Brilliant but lacks micro sd",
            "Yasssss",
            "Samsung",
            "Overated",
            "Good all rounder.",
            "I will never get a Samsung agen",
            "Its a phone",
            "Fantastic Phone!",
            "Great Phone But...",
            "Nice smartphone",
            "Great design and easily accessible.",
            "Looks great",
            "Poor battery life",
            "outstanding phone",
            "Fantastic phone",
            "Great camera, clear screen.",
            "Fantastic phone",
            "Amazing phone",
            "Great all round device",
            "Not all that",
            "Love this phone",
            "Over the moon",
            "Samsung Galaxy Note 20 5G",
            "Love it!!",
            "Innovative",
            "Great features",
            "First Android",
            "Screen marks very easily",
            "Amazing",
            "Very quick",
            "Great features",
            "It's pink!",
            "I love my new phone",
            "",
            "I love my new phone.",
            "Fast charging,  fast operating, good camera",
            "Dual SIM Superstar",
            "Perfect",
            "Good",
            "Great phone"
        ],
        "review_text": [
            "Great looking phone, especially the bronze colour,, full of features,  too many to mention,.good quality and value.",
            "Absolutely fluent, great photo camera! Even night shoot are amazing. 5G working greatly with average speed of 300+mbps",
            "I picked the, Note ,series again, for it's amount of functions. Although, they are too big so I got the, 20 5G, as apposed to the Ultra. But the 20 5G has no sensors for O2 levels & heart rate. Very disappointed with this.",
            "A bit skeptical about it, not sure if I should get it or S21 but believe me have been enjoying it.",
            "Fast and easy to get loved the fast pace of work would give it a 10 out of 10.",
            "Great phone easy transfer of data good charge very happy still working through all extras",
            "Phone is a good size for watching TV on because of the big screen. The S pen is really handy for writing shopping lists when you don't have pen and paper around and my data transfered from my old phone really easily. Beautiful colour too.",
            "Lovely phone fabulous setting on the phone",
            "Overall its a great phone, however 2 things really bother me. 1 is the mic. Everytime I am on a call with someone, they could barely hear me. \n2 is the quality of videos. Very low quality even for the pro video.",
            "Had the phone a few weeks now, it is really easy to use, the set up was quick qn easy, an transferring all content from my old phone was a walk in the park, the phone battery is great, the display when streaming movies is amazing also, not had any issues what so ever, currently very happy with the purchase, I would recommend to anyone.",
            "I was a little hesitant to make the jump from Apple to Android but I totally love this phone and all the features that come with it. It is fast, comes with 256GB storage and the S Pen is a fantastic tool. It comes with 3 years of software updates and the screen is crystal clear. The camera is also fairly decent and I've realised you can do far more with an android phone than an Iphone.",
            "Great camera battery life fantastic what can l say just a great phone",
            "Very happy with this phone, after months of trying to decide I took the plunge and I'm glad I did, I had the galaxy note 8 before and I just love the note range, the camera is good although I haven't had a chance to utilise all its options yet, I love the new features available and I love the design of it overall",
            "I really like it.\nI was a bit sceptical because of the low s reen resolution compared to my old note 9, however the screen actually looks better!\n\nIts brighter and more Vivid, and because there is no longer a curve in the glass (THANK GOODNESS) it appears \"closer\" to you, and more real.\n\nThere are speakers at the top and bottom which I love for watching videos or listening to music and the speakers are good quality.\n\nThe camera both front and back are outstanding, definitely better and capture more detail than on my note 9.\n\nNo expandable storage is a bit of a nad point, I'd have liked the option for an SD card, although I'm nowhere near filling up the phone.\n\nThe plastic back is a bit rubbish though Samsung, definitely feels cheap compared to my old Note 9.\nI use a case every day anyway so I don't see or feel it any more, but that is a definite low point of the phone.\n\nPerformance-wise, the phone is great, its never crashed, I've never had to wait for anything to load and I've had 0 issues with it, so very happy with that.\n\nThe battery us good, I use my phone a lot for work, up around 7:00, back on charge about 22:00 and it just about lasts that long. (I keep a power bank just in case, but I've not needed it yet).\n\nThe S Pen has switched sides since my note 9, which is now more difficult to access, I'd prefer it on the right as im right handed.",
            "Too sensitive auto spell so wrong cant get the letters right",
            "I like the look and the screen is great. It's bulkier than I would have liked. The camera functions are not intuitive and I've missed taking some photos because it hasn't operated as I expected. Some of the 'interruptions' i.e Bixby are annoying. The phone quality is better than my previous phone - as is battery life. The pictures, when they've worked, are excellent.",
            "Great spec, boring design..........................",
            "Since getting it the day it came out I have had to have it replaced for a charging issue. And it is terrible for picking up a signal, my old phone got full bars in work and this gets zero. Other than that the phone is great for what I use it for",
            "It's hugely annoying, it keeps notify me and there doesn't seem to a way to turn off all notifications with one button, I'm watching a movie and stupid notifications keep popping up. I realy can not see so far any great improvements over my galaxy S7, the camera is also annoying.",
            "The camera is great. Joint with the screen quality it takes the perfect pictures just how you need and want them. \nThe only issue that let's the phone down is the capability to add extra storage like a sd memory card. Also the battery needs to have more life within it. The features do put strain on the battery but still could of upped the battery power even size as big phones are back in style now. \nBut a good phone.",
            "Unfortunately I wish I'd have just kept my Samsung Galaxy S9. Only good thing is the Super fast charger. I'll be changing as soon as its paid off, just hope the S20 will be better.",
            "Battery last longer, feels great in the hand and looks good",
            "Great screen at 120 hz, love the new pen, fast and smooth",
            "I love every aspect of this perfect mobile phone,excellent.",
            "Disappointed that samsung have gone down the same road as apple and putting charger and headphones sockets together if I had noticed this this i may have thought twice about getting this phone",
            "Love it to bits \nDefinitely better than been married",
            "The speed is what drew me to the handset and it is living up to what I was expecting the screen is very clear the best samsung I've had yet",
            "Fantastic phone. Great camera. Speedy response at all times.",
            "I love the flexibility of the pen and drawing capabilities, quick notes and adding reminders to notes and email flags.",
            "Decent....................................... .....",
            "I was expecting great things from my Note 20, I wasn't disappointed. Great phone, superb features. A very. cool phone.",
            "Nice big screen, which is ideal for me when I'm game steaming using 5G.\n\nI like using the S pen for example, I would normally hit more than one key when texting but that's not the case using the S pen.\n\nI would recommend",
            "Many interesting new features. But still not a decent upgrade from the Note 9.",
            "Just about everything, have to complete 29 characters",
            "Very quick phone and also more cheaper the Apple 11 pro.",
            "I found it very easy, to use the features are great, the cameras are so clear. I especially like the notes feature where it links with my computer.",
            "Its great wider  and more up to date  on everything I do love my new phone just love it everyone in my house say to me its your life support lol",
            "I adore Samsung and I love the note series, I have had a note since the note 4 and they are just amazing phones, I'm really forgetful so being able to just write on my phone without unlocking it when i need to jot down reminders is perfect for me. The only negative is that Apple music sometimes plays up but incan live with that!!",
            "Phone is great, lighter than s20 ultra, features are amazing. Only let down is the battery. I am not gaming. I might search Google, watch a bit of youtube and listen to music and from full charge on the mooring is around 45% battery left by 6pm",
            "Everything runs fine just fine, bit of a annoyance that I have ended up with a exynos chipset for the same price as the snapdragon counterpart, signal is always an issue no matter where i am could be right next to a tower still 1 bar, to be honest I should have just stuck with my note 10. Had no issues at all. And runs the exact same.",
            "It is fast and responsive. A reasonable size. I really love this phone. The only criticism I have is that it is unexpectedly heavy for a modern phone.",
            "Does everything I need, would definitely recommend",
            "The screen is great the functionality is brilliant but it lacks micro sd expansion",
            "Its great its got a ton of cool features .........",
            "I just love this phone its easy to use ..the camera is so good  and the video's are picture perfect",
            "I have a Note 8 Note 10+ and Note 205G they are basically all the same! I really cannot see any difference. Not worth the price tag.",
            "Nice size, fast processor. Excellent camera features. May never need to take a camera out again!",
            "I hate the phone my note 9 was a better phone and as for the battery lasting longer well that is  Debatable If I have it on the settings that makes the battery last as long as you say the phone's virtually inoperable",
            "Interference sounds like some people underwater sometimes doesn't go on to load speaker",
            "The look, speed, pen, 5G speeds, camera, call quality, speakers and additional Note20 software are all pure class. 100%",
            "Fabulous phone love it, But essentially let down by not being able to add an SD card",
            "Good and smart phone works well  no problems with it the pen that comes with it is great would recommend it to anyone",
            "I love the ability to fully edit my photos in a more simplistic sort of way and being able to create new desig s is an absolute bonus.",
            "I only ever have Samsung phones and my new galaxy note 20 is great, the screen size is spot on and the colour, mystic green is looks amazing. I'm 100% sure how to use all it's features but there's on screen instructions to guide you through.",
            "Lovely phone but the battery life is poor and needs charging alot",
            "this phone is the best I ever had. It comes with all features  and has a large memory. It works fast and never buffer. I would recommend this phone to anyone.",
            "Its fast, easy to use, loud, just overall a fantastic phone",
            "This is overall a great phone, the camera is excellent, very easy to use.",
            "Love this phone, easy to use, the battery life is great and the camera is fantastic",
            "I love how quick and responsive the phone is with fingerprint, the overall charge speed is better than anything I have had.",
            "Literally cannot find a fault with this device.\nThe camera, battery life, screen quality and  speed of this phone is like nothing else.\nPerfect all rounder for personal and business use.",
            "Not keen at all on this phone, wish i had stuck with my i phone.",
            "The phone is amazing,to start with i had a problem with battery life but the phone learns how you use your phone making the battery last longer. It also take about 1 hrs to fully charge. The memory is amazing and the phone is so user friendly not like other phones I can mention (Apple). I would highly recommend. If you buy the buds with it you will not be disappointed",
            "Fantastic features and easy to use. The S-Pen is a game changer",
            "Had the phone a little over a week now and yet again, Samsung phones are amazing. Best Samsung phone I have used. Was using the S10+ before this and never had any problems.\n\nAnyone looking for a new phone, I would highly recommend a Samsung device.\n\n#Samsungalltheway",
            "Great device! The battery life is excellent on this phone.  I no longer have to plug in halfway through the day even with heavy usage. The camera is fab and you get great pictures.  I love the note and pen it makes it so much easier when I'm on site.",
            "Many interesting features, not all accessed yet. User manual would be helpful.",
            "The camera is amazing I use the camera to take pictures as i like photography plus upload to my blog , interaction is very easy to use",
            "I recently switched from my iPhone to the Samsung note 20 and I must say I've never really taken a leap of faith with phones, usually been an iPhone user. However, I'm glad I did take the leap, it is more useful for both University, time management and overall comfort when using a device. \n\nMust say probs to samsung and look forward to perhaps swapping out my ipad for a tab in the near future!!",
            "Camera good stylist handy. Fast processor not messed with video yet",
            "Love the size, device works smooth and haven't had any glitches. Love the colour and pen is great. I am not a massive photo taker but with the Single Shot camera feature it makes amazing photos with no effort.",
            "Was enjoying the phone until latest update (October 1st). Google news now will not scroll and freezes screen",
            "I love my new device it's quick and easy to use I live the features of the phone aswell I would highly recommend it to any one who likes Samsung",
            "If you don't like pink then get a different colour in this particular phone. Its described as mystic bronze, fancy wording for pink. \nOther than that great phone.",
            "It's an amazing phone, with all the features what you need and so fast. I used to had a problem with Bluetooth connection on my old phone it was very slow. Since I changed to this I have no problems. And before I always had to carry a charger with me as I couldn't make it through the day with one full battery but not any more. I just love it. Perfect size, beautiful design and a great samsung model!",
            "A present for the wife. She is over the moon with it.",
            "The new Samsung Galaxy Note 20 is the perfect phone for me. Excellent camera. I'm a Samsung user, so I new what to expect generally. Now I've got it, I love it.",
            "1st to phone charging superfast ,2nd phone operating very quick and smooth ,and camera quality version superb. And one plus point  dual sim slot uk version \nOnly one minus point not edge screen to compare to not 10 plus",
            "Working as a multinational sales and marketing director I have for the dual SIM seemless and smooth and easy to operate. The phones amazing screen allows for detailed review of art work for approval and the S Pen improved functionality enables me to mark up PDFs in greater detail and approve documents on the go. It truly has become my most reliable digital assistant",
            "Amazing photography features, light weight and large screen perfect for watching movies with amazing picture!!",
            "I really like the phone. I haven't really used the pen mu yet but will do soon. Easy to use and great for photos. Great to watch videos.",
            "Love the phone and functionality but the pen is a real cheap addition.  Its plastic feel just does not sell the high price of the phone"
        ]
    }
}