{
    "916/2949": {
        "remotekey": [
            "916/2949"
        ],
        "item_category": [
            "A medium size 4G phone with a big screen! Enjoy every detail of your movies and internet on the go with this stunning 5.72 HD, 18:9 ratio IPS display. Surprisingly compact due to the narrow bezel, this phone is barely any bigger than most 5 phones! Features include; 1.4GHz quad core processor, 1GB RAM, 16GB storage, 2 cameras, GPS, fingerprint sensor, Blue tooth 4.2LE, Android 8.1 Oreo Go. "
        ],
        "summary_star_rating": [
            "4.3"
        ],
        "no_reviews": [
            "81 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "85%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "2",
            "4",
            "1",
            "4",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "1",
            "4",
            "4",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "23 June 2021",
            "20 May 2021",
            "4 May 2021",
            "27 April 2021",
            "22 April 2021",
            "21 April 2021",
            "14 April 2021",
            "13 April 2021",
            "8 April 2021",
            "23 March 2021",
            "23 March 2021",
            "17 March 2021",
            "10 March 2021",
            "18 February 2021",
            "18 February 2021",
            "18 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "20 January 2021",
            "19 January 2021",
            "12 January 2021",
            "12 January 2021",
            "8 January 2021",
            "24 November 2020",
            "14 October 2020",
            "7 October 2020",
            "31 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "20 October 2019",
            "20 October 2019",
            "4 October 2019",
            "25 September 2019",
            "18 September 2019",
            "11 September 2019",
            "11 September 2019",
            "4 September 2019",
            "28 August 2019",
            "21 August 2019",
            "18 August 2019",
            "15 August 2019",
            "3 August 2019",
            "31 July 2019",
            "31 July 2019",
            "28 July 2019",
            "23 July 2019",
            "17 July 2019",
            "17 July 2019",
            "17 July 2019",
            "3 July 2019",
            "3 July 2019",
            "3 July 2019",
            "26 June 2019",
            "26 June 2019",
            "25 June 2019",
            "22 June 2019",
            "19 June 2019",
            "19 June 2019",
            "12 June 2019",
            "29 May 2019",
            "29 May 2019",
            "29 May 2019",
            "18 May 2019",
            "27 April 2019",
            "17 April 2019",
            "17 April 2019",
            "12 April 2019",
            "10 April 2019",
            "4 April 2019",
            "3 April 2019",
            "2 April 2019",
            "19 March 2019",
            "13 March 2019",
            "6 March 2019",
            "5 March 2019"
        ],
        "review_title": [
            "Great starter smart phone",
            "alba phone",
            "Really great piece of kit for the price",
            "Replacement phone",
            "looks great",
            "A lot of phone for the money",
            "This phone is a good value for money.",
            "It’s not awful...",
            "Brilliant mobile",
            "Great Value! Well worth it.",
            "Is very good and so easy to use",
            "Alba 5.7 phone",
            "Alright",
            "Great phone",
            "Alba mobile ok for emergency",
            "works as i want",
            "",
            "It does what it says on the tin.",
            "My daughter loves it",
            "Great inexpensive phone",
            "Great little phone",
            "Great phone for the price",
            "Excellent phone, great screen and camera, Bargain",
            "A good value for money given the specifications",
            "Alba 5.7 mobile device",
            "Fab phone for beginners",
            "Ok for the money",
            "My daughters love them",
            "Puuuurfect!",
            "Brilliant for kids",
            "This phone is easy to operate",
            "It is better than the 5",
            "Good cheap smartphone",
            "",
            "value for pricee",
            "It’s so nice smart mobile for daily use.",
            "Amazing phone only pic quality ain't that good",
            "Loving this",
            "",
            "Cheap phone",
            "Looks ok but terrible performance",
            "Looking fabulous",
            "Nice looking phone",
            "great value for money",
            "A Nice Phone and Good size",
            "Not a good phone",
            "Good size phone worth the money",
            "Phone is absolutely awesome!!",
            "Smart and stylish",
            "Good for the price.",
            "A brilliant phone",
            "Good wee phone",
            "The phone is ok but not keen on the slow charge",
            "It looks nice.",
            "Nice phone , little slow on picking messenger up",
            "Phone looks great and works brilliantly",
            "Fab",
            "Good phone for budget price",
            "My alba phone is good and fast",
            "Alba phone a good all round mobile",
            "Really good quality  also charges really quick",
            "Good phone",
            "My phone is fab and works well im well impressed",
            "Too big,like many phones nowadays",
            "Looks nice and easy to handle",
            "Very good battery life. Excellent audio quality",
            "Dale Bellamy",
            "Brilliant last minute phone",
            "Easy to use.",
            "Great phone ,does all the things i want",
            "Phone works great no problems at all.",
            "Battery life terrible",
            "An attractive phone and value for money",
            "It works very fast and has good functions",
            "",
            "Do not buy",
            "Nice phone but battery life very poor",
            "Phone looks nice but waste of money",
            "Very good",
            "Good value for money",
            "The phone is very good"
        ],
        "review_text": [
            "I helped my older friend choose this phone for their first smart phone, its easy to use with few apps so not to confuse them, has all the basics they require, phone, text and Internet search with the facility for Google \nmail etc if they so wish. So far so good Only downside is its quite difficult to get a wallet case to precisely fit this phone.",
            "Excellent,easy to use and understand,my husband and I both bought one,husband is disabled and this is the first phone he has managed to use alone.very clear, understandable, user friendly.",
            "Well chuffed with it!!",
            "Easy to use, looks like any other android, brought as a replacement for my stepdad and he finds it is very similar to his old phone",
            "paid a lot more for phones no good but this one marvalous",
            "Early days with this phone, but very pleased so far. Everything works well, the phone feels well built and comes with a gel backing case. Fitting the screen protector didn't go well so I've ordered a pouch case so I can protect the whole phone. Nice, large screen and it seems quick enough for everything I've tried so far, in including YouTube. I would say this a great value phone.",
            "Good value for money as it performs the same way as the Samsung A10.",
            "Works just fine, first time using an android phone, so takes a little getting used to.  It does the job for what I purchased it for which was too have as a second phone. Would recommend for an easy option if you need a smart phone.",
            "I bought this for my dad who is in late 70s. He had never had a Smartphone before. And it is absolutely amazing. Very easy to use because of the large screen. Etc.\n\nIf your looking a phone with best camera, memory etc...then this probably isn't for you. But for a basic Smartphone. It's brilliant.",
            "I purchased this phone as a second phone for work and I’m so glad that I did. I needed a smart phone that could be used for social media, emails and organising.\n\nThe long battery life is extremely helpful and it’s good that you can add extra memory via a memory storage card. \n\nThe large screen is a special feature and would therefore be good for older users as well who need an easy, low maintenance phone.",
            "I really like it because it got a back case as well and price wise it stands out,is moderate and everyone can afford it, actually Ive bought 2 of then one for my Mum as a gift and other was for my Sister in Ghana,they really love love it",
            "For price it's  a very good phone easy to use and setup and has all updates more expensive phone's have",
            "Good. A little slow at times. Does what I need it to do.",
            "Very pleased with phone just what I needed no problems whatsoever",
            "Ok for spare phone clear calling but slow as will not run certain apps. touch response ok, but on plus side comes with gel case and screen protector.",
            "will not play all songs have to press play for every song",
            "Its a great phone in price and works as I wanted",
            "Good for the price. Nothing fancy but good.",
            "We bought for my daughter for her birthday and she is so happy with it .",
            "Great phone, does everything I need it to do for the price.",
            "Great little phone as a spare. Wifes phone sent off for repair so got this one and works a treat!",
            "This is a good phone for the price. I bought for my niece last month.  She has had many expensive phones over the years which haven't lasted. This one is half the price and she is very happy with it. Good size screen for YouTube an the usal teenager needs!! The delivery was fast and so a great service all round",
            "Was pleasntly surpriesd how good this phone was for the price, and even came with clear rubber protective cover,  Love it",
            "The phone specifications and size is superb and I think it was a good value for mony",
            "Easy to use and very intuitive phone.  Very good battery life.  Decent camera.\nDecent screen resolution. \nReasonable price for such decent phone.",
            "This phone is great for somebody getting into tech. Bought it my mother-in-law as her first smart phone, and she's getting on great.",
            "Only let down is battery life which is rubbish everything else ok trying to fina a higher capacity battery is impossible it would help if argos support told you what phone this model is based on",
            "It was a great Christmas present for my daughters",
            "I have nothing bad to report to date of purchasing this phone, forget the others especially apple, apple spend a lot on advertising, the lower brands are just as good. Trust me.",
            "I bought these for my 6 and 7 year old just so they could \"have a phone\" no sim cards in though and they love them especially to play stuff with each other and their older siblings",
            "This phone has been bought for my Dad who is in his 70's. I'm impressed with the screen size, the way the phone works, and the general layout. A handy screen protector and clear plastic cover were included. Dad has not used the phone yet, but I do not anticipate any issues because the phone is very user-friendly. Seems good value for money.",
            "The price was good for the quality of the phone would highly recommend",
            "Wanted a decent but cheap and SIM free smartphone for my son who has a terrible frecord of losing or breaking phones. This has done the job perfectly.",
            "Cheap phone with limited options",
            "This phone is almost on par withe a iPhone\nat 1/4 of the price.",
            "I found it so nice and convenient smart mobile for daily use.",
            "Works great can do the basics and has enough memory to download a couple of apps.",
            "Excellent item a must buy for all",
            "Maybe the fact that i had a faulty phone but this phone wasn't worth the money. In the end I upgraded to a motoralo and have had no problems since",
            "No problems with this phone for basic use (calls, sms, facebook, twitter, messenger, various travel apps and some web surfing) other than battery life being a bit shorter than expected.",
            "Worst phone ever, everything takes so long to open. Almost smashed it a few times out of frustration",
            "Good product, worth the money",
            "Excellent value much better quality than expected",
            "great value for money, very easy to use. all in all a very good purchase.",
            "So far I am very happy with it although I did find it tricky to set up\nbecause of the 2 SIM card space idea but once I did it has worked \nfine.",
            "The phone isn't very good, as phone overheats and I've lost receipt",
            "Great phone only problem I have is the Google bar on front doesn't move so covers my photo",
            "I really love this phone so good for casual use and networking and data signals are really good.\nSpeakers and the screen are absolutely beautiful. Also love the fingerprint sensor at the back for unlocking the phone and other use.\nThe only downside of this product is that the battery runs out really quickly on heavy usage and have to carry a portable charger with me everywhere.",
            "On buying felt like a good deal but that is about it. Once out of box, battery lasted about 2 hours and needed charging again. Not only that whenever my fiancee made a call it started burning up and we had no option but to return it to shop and be issued with a refund. Only time I've had to return an item but disappointing never the less",
            "This is a good budget phone. Has a lot of features that more expensive phones don't. The phone is actually dark blue as opposed to black as stated. Battery life not brilliant but recharges fast. Phone does tend to heat up when charging though.",
            "A brilliant phone and the phone is still a good phone",
            "Good wee android phone accesses Internet quickly",
            "The phone is ok but disappointed in the charging as it takes ages and soon runs out of charge",
            "This mobile phone is nice enough to be recommended.",
            "Good phone for the price ,bit slow on picking up messages& messenger",
            "This phone was bought to replace faulty Cubot J3Pro. It looks, sounds and behaves EXACTLY the same, but the good thing being that it's not faulty. \nGreat value, great product, would certainly recommend buying this android phone",
            "Amazing great value woild deffo recomend",
            "The Alba 57 is a good phone for a budget smartphone. It has a good clear big screen, so is easy to read texts, surf the web and for playing games/streaming videos. It also has the added features of a fingerprint scanner and dual sim  card slots. The only thing that lets it down is that the battery doesn't last long, especially after heavy use. Would recommend the phone.",
            "I like it and I think it worth the price ... I will  recommend it to anyone",
            "The phone is easy to use, has a good rear and front facing camera, storage is enough for the apps I use. \n\nIsn't compatible for Instagram",
            "Don't leave it charging on a bed sheet cotton material \nCharge it in a surface or unit \nScreen protect protects screen if you drop it \nAnd also phone case has a sturdy grip",
            "Decent phone for money",
            "All great I love it love it",
            "Took it back.too big.seemed out of proportion,long but not that wide.didnt like the look of size",
            "Nice to handle, smart look",
            "Quick to setup, very crisp audio quality. The battery life is good (two days on normal use).\nLove the camera quality.\n\nLacks some of the offer sensors such as magnetism, air pressure, but I don't need them.\n\nThe screen quality is nice, I tend to use it with the brightness set very low, but it can go very bright.",
            "had a Alcatel xl before this phone and this up loads quickly but the google take a bit getting used too",
            "This was bought for my 13 year old daughter in replacement of the Argos Bush spira D5.5 after it malfunctioned. This phone is brilliant. It’s big and good looking. Camera is spot on for my daughter to do her TikTok vids. Fingerprint sensor is good to unlock. Some functions work better than my iPhone 7plus. I’d definitely consider buying this phone when my contract is up. Excellent price and excellent phone. \n\nFront is black and the back is dark blue \n\nThanks Argos",
            "This phone well worth the money.  Bought  for  someone  that's not  very  good with  phones. It's easy to use nice  bright  screen camera  is also good takes  lovely  photos. Also comes  with phone case and screen  protector. The phone is sim free so can  use any  sim the phone.",
            "Viewed the phone before buying it ,excellent customer service , the phone is easy to use and has all the apps you need",
            "Phone works perfect. Love the finger print as not good with remembering passwords",
            "I love the look and feel and size of the phpne but when it comes to battery even with screen brightness right down and all app's stopped that can be from running in background the battery is terrible, ive just taken off charge so was at 100% about 10 mins checking email's and fb and its now on 58%, if i play a game it drains even faster. Candy crush and some similar games arent compatible with phone.",
            "This phone was purchased for an older relative, who was looking for a device with a good size screen, nice weight and useful camera.  The user was already familiar with Android and so this phone represents good value for money for the price-point and the functionality required..\nThe clarity of the screen its size are real plus points at this price point and after 2 weeks of use, the recipient of the phone is very happy indeed.",
            "I am very satisfied about the phone because it has many functions and I am able to use many apps in this because as it has storages and ram enough for downloading. I will also recommend this phone to my family and friends so they can buy better phones from Argos.",
            "The pictures aspects of the phone not clear\nThey should update the quality of the camera \nApart from camera problem l'am very ok with the phone",
            "Battery life is awful, doesn't connect to other Bluetooth devices, doesn't cast to smart TV, very very slow, freezes, kicks you out if apps I cannot stress enough how bad d this phone is, buy at your peril, it's the worst smart phone I've ever had",
            "Battery life very poor, having to charge three times a day.\nNice phone, but a bit slow at loading apps etc",
            "I do not recommend this phone to anybody the battery overheats whilst on the phone when you're on the internet it keeps throwing you back to main screen all round phone is not very good I would not recommend this phone to anybody waste of money",
            "Excellent I will recommend it to my friends.",
            "Does what a phone does and then some.. Great value for money.",
            "Good phone good price"
        ]
    }
}