{
    "908/3279": {
        "remotekey": [
            "908/3279"
        ],
        "item_category": [
            "The Galaxy S8 is packed with features that help you do more, from being IP-68-rated water and dust resistant to having a powerful 10nm mobile AP for seamless multitasking. It comes with enhanced audio technology and with an expandable memory. Whether you're capturing the city skyline or a special moment with friends, you'll take incredible pictures with the Galaxy S8's Dual Pixel 12MP camera. With facial recognition for smart autofocus, the 8MP front camera assures a perfect selfie. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "11 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "2",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "1 August 2021",
            "23 June 2021",
            "10 June 2021",
            "2 June 2021",
            "8 April 2021",
            "30 March 2021",
            "18 March 2021",
            "16 March 2021",
            "12 March 2021",
            "3 March 2021",
            "2 March 2021"
        ],
        "review_title": [
            "Not Worth",
            "Lovely phone so far",
            "Very happy with phone",
            "I am amazed",
            "",
            "Great phone and a reasonable price.",
            "My phone looks great!!",
            "Great phone.",
            "It is fab",
            "My phone is awsome and quick to set up",
            "My phone looks fab..."
        ],
        "review_text": [
            "I did not know its edge style ! which i do not like.\nThe the battery drain so fast , though i dont have many apps ! \nI should of bought better one .",
            "I bought this phone a few weeks ago and so far it's been really good. The camera is amazing and battery life is good.",
            "Happy with phone was better then I thought slim worth money",
            "I was doubtful about buying a used phone, the quality and condition well I am unable to tell the difference it is excellent, I have no hesitation in recommending",
            "Good phone, Quick delivery",
            "Great phone at an affordable price arrived super quick to. Looks like a brand new phone. A big bonus was making use of buy now pay later option I had. Highly recommended this way of purchasing a newer model if you don't need all the gadgets of the phones on offer today with there big price tags to match.",
            "Love my phone. Just wish that batteries were more powerful.",
            "Great phone, meet my expectations. Good value.",
            "I got it for my son because it works for the G6 for his diabetes management system.",
            "Great value fot money as I had broke my phone and even better I could put on my Argos card otherwise I would have no phone.",
            "Very good phone condicion..."
        ]
    }
}