{
    "579/6508": {
        "remotekey": [
            "579/6508"
        ],
        "item_category": [
            "The Doro 8050 is a smartphone seniors can rely on to make staying in touch with friends and family easy with a beautiful Scandinavian style and design. It comes with the key DNA attributes of a Doro: fantastic loud and clear sound with HAC, Response by Doro if help is needed quickly, an excellent 5.45 display with high contrast colours, a dedicated home button for easy navigation and an outstanding battery life. Users can access the Play Store and use the Google Assistant to verbally ask their phone to do tasks and easily fits into any pocket. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "6 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "4"
        ],
        "review_date": [
            "30 March 2021",
            "30 January 2021",
            "23 January 2021",
            "18 January 2021",
            "18 January 2021",
            "15 January 2021"
        ],
        "review_title": [
            "Works wery well",
            "Great mobile. Easy to use",
            "Fab phone for the older user",
            "Brilliant",
            "Amazing Emergency  family   button large font",
            "Easy to use touch screen phone for grown ups"
        ],
        "review_text": [
            "Good mobile for me for the price",
            "I love this mobile. It was so easy to set up, and has a large screen which I like and simple app organisation. \n\nThe Doro 8050 takes clear photos and it's easy to carry about as it fits in my back pocket.\n\nThe only downside to this handset is the battery life is disappointing. It needs charging overnight and then again in the day. \n\nOverall I am a big fan of this mobile. Its simple to use, has a clear large screen and has a decent camera.",
            "The phone is easy to charge and set up for use, following the instructions included in the box.\nIt has the typical features of an Android phone, with additional features such as a view app to quickly see messages, photos. Font size can also be enlarged for older users.\nThere is an alert system (subscription needed) which would be helpful for vulnerable and elderly relatives to quickly get support.\nMemory is limited at 16GB, but can be increased using an SD card (not provided).",
            "Have spent the weekend getting to know the phone,I surprised myself how quickly that I managed to program the phone I usually ask daughter to do it  but this time did it  myself it is well explained with easy to follow instructions. The phone fits comfortably in the hand,is a good size,screen resolution is good, and it takes a good picture. You can have the sound at different levels which is good for those struggling to hear. It also can have the wording changed so it's good for eyesight.",
            "The most exciting  moment is i can alert both t my daughters  with one call   as disabled  amazing Open package impressed with  phone screen size then  charged it . I found it exceptionally  easy instructions to understand  clear choices  large font yes choice hearing   modes  yes easy. \nI am so impressed  \nPluses font\nEmergency  contact\nSize screen\nChoice of hearing sources ie hearing aid \nYes tick all my boxes pleasantly surprised",
            "It has Large icons and easy to read text. A manual home button. Emergency alert button on the back for peace of mind. Sits nicely in your hand . Easy to use for phone calls, send texts, an easy to use camera. You can download and use other apps, Face Book, Alexa etc. It is great for video calls. Has assistant built in so you can tell it to call / video call or search using your voice."
        ]
    }
}