{
    "930/2606": {
        "remotekey": [
            "930/2606"
        ],
        "item_category": [
            "HONOR 20e is a stunning phone with powerful photographic functionality. The 24MP + 8MP + 2MP triple AI rear camera can capture all your photos with ease. The HONOR 20e has a fashionable look with a 6.21 inch Dewdrop display. Powerful chipset and 64Gb storage give it a superior performance. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "85 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "99%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "17 February 2021",
            "17 February 2021",
            "11 February 2021",
            "10 February 2021",
            "10 February 2021",
            "10 February 2021",
            "5 February 2021",
            "4 February 2021",
            "3 February 2021",
            "2 February 2021",
            "2 February 2021",
            "2 February 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "26 January 2021",
            "20 January 2021",
            "19 January 2021",
            "13 January 2021",
            "13 January 2021",
            "13 January 2021",
            "6 January 2021",
            "6 January 2021",
            "6 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "4 January 2021",
            "3 January 2021",
            "3 January 2021",
            "2 January 2021",
            "2 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "2 December 2020",
            "2 December 2020",
            "1 December 2020",
            "26 November 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "18 November 2020",
            "18 November 2020",
            "12 November 2020",
            "11 November 2020",
            "11 November 2020",
            "10 November 2020",
            "10 November 2020",
            "7 November 2020",
            "4 November 2020",
            "31 October 2020",
            "22 October 2020",
            "21 October 2020",
            "21 October 2020",
            "21 October 2020",
            "13 October 2020",
            "13 October 2020",
            "8 October 2020",
            "7 October 2020",
            "6 October 2020",
            "6 October 2020",
            "6 October 2020",
            "1 October 2020",
            "23 September 2020",
            "23 September 2020",
            "16 September 2020",
            "16 September 2020",
            "16 September 2020",
            "15 September 2020",
            "9 September 2020",
            "8 September 2020",
            "8 September 2020",
            "26 August 2020",
            "20 August 2020",
            "19 August 2020",
            "12 August 2020",
            "11 August 2020"
        ],
        "review_title": [
            "Love the blue",
            "Fantastic product",
            "Beautiful colour",
            "honor phone 20e 64gb",
            "My phone looks fab..easy to set up and use",
            "Awesome Phone",
            "looking good fabulous",
            "Amazing phone for the money.",
            "Great",
            "Performs exactly as expected",
            "The phone is great and looks nice.",
            "Value for money",
            "great phone",
            "i like honor because i already used mobile of hono",
            "Phone great and fast",
            "Phone",
            "An absolutely amazing mobile phone..",
            "Looks amazing",
            "Phone is good an nice color",
            "Great for the price",
            "The phone works brilliantly",
            "Honor 20E",
            "Excellent phone",
            "Nice phone",
            "",
            "Great budget mobile",
            "Sim free Honor 20e",
            "Fantastic phone for price",
            "Just as good as any android",
            "Perfect",
            "Fantastic size",
            "",
            "My new Huawei Honor 20e is great phone for less",
            "Brilliant",
            "Phone looks great and I would definitely recommend",
            "Great looking mobile.",
            "Looks stylish and very easy to use",
            "Seal broken",
            "It's a phone with good camera",
            "Better Then Expected",
            "",
            "Great phone",
            "Fantastic budget phone",
            "Good looking phone and easy to use",
            "Girl that served me was fiiiiiit",
            "Best cheap smartphone",
            "Phones is great",
            "Good looking phone",
            "Honor mobile phone is the best",
            "Very pleased with the phone",
            "LOVING THIS PHONE",
            "Great mobile for little money, I love it",
            "Entry budget smartphone",
            "Phone is great.",
            "Ease of use",
            "Everything you need and more.",
            "Pleasantly Surprised",
            "Goood phone.",
            "Unplanned purchase...",
            "Very happy",
            "Honor 20 came faulty",
            "My phone is great. Screen very clear. Easy to use",
            "Honor phone",
            "my phone is fast, easy to use ,great phone for a g",
            "Amazing value",
            "Love the phone and everything about it.",
            "Very good phone ti appears. Early days.",
            "Excellent at this price",
            "",
            "Great phone for the price",
            "This Phone is Amazing!",
            "Great mobile",
            "",
            "My phone is fabulous and so easy to use",
            "works fine",
            "Great for price",
            "Good screen, Fast. Bargain",
            "Am honored",
            "Phone is amazing",
            "SIM Free HONOR 20e 64GB Mobile Phone - Black",
            "Good phone, great price",
            "Honor phone",
            "Fantastic",
            "Looks really nice",
            "Excellent Phone"
        ],
        "review_text": [
            "This Honour 20e is so right for me. It is so nice I can't wait to show all my friends and colleagues",
            "Well this mobile phone has most of the gizmos of the top of the range at a fraction of the cost. Unbelievable for speed on the Internet, great storage, excellent cameras, I could go on forever but you might get bored then not read my review. Only slight downside so far is I have the fitbit app installed and this does use up battery power. That being said my phone has never ran out of charge. This is a very safe buy, a budget priced mobile giving top of the range features.",
            "Brought this for my daughter excellent in every way great memory beautiful colour very fast internet connection picture quality and sound is great definately getting myself one",
            "very good phone for a very good price",
            "Brilliant phone..as good as more expensive brands..easy to set up and use..good camera and storage space..design is good",
            "Fantastic phone, highly recommend from someone who uses a Samsung daily.",
            "Best phone ever used it's fantastic worth the money and it has a free  case",
            "Simple to use accepted Google account...it does what all phones do. Only thing not impressed with is the micro USB charging port...seems fine now but I find the design is always flimsy on anything not just phones. Would be better if it was upgraded to include USB-C port.",
            "Great fone I can't fault it, I would definitely recommend it to anyone, camera brilliant very easy to use",
            "Fabulous lower range phone for the money.",
            "Had no problems with setting up the phone, worked perfectly fine with no difficulties. Using it now and I absolutely love it. Would recommend!!",
            "Sim free mobile, which is ideal, as I have a contract SIM card, great camera quality for the price, price was unbeatable, even comes with a basic case, but none the less I’ve never had that with any other phone, good quality, thank you",
            "It's a great phone for the money. Clear sharp pics from the camera and no need to buy a memory card. Storage is great",
            "honor mobile i like most because this mobile have not any problem so its better then other",
            "Great and fast delivery",
            "Excellent service excellent product",
            "Can't actually believe what a good phone this is.. why pay so much when the Honor 20e is priced so good.. does everything what some of the expensive phones do. Beautiful design, came with a back cover too which was a bonus.. Thank you Argos",
            "The phone looks amazing is a great colour and very easy to set up and use",
            "I bought this phone for my son,he is happy .He said that he have everything, Good quality of camera, phone apps working really quick. I recommend that and price is really good.",
            "It's a good economy phone, if you consider the price then you will it is great for the price.",
            "It's better than a Samsung phone and works better to.",
            "Quick delivery by Argos. \nCompetitive price. \nPhone has a long battery life and looks nice and sleek. \nIt’s early days that’s why I gave it a 4 ⭐️ \nWill be 5 ⭐️ if lasts long.",
            "Got this phone for my son after he broke his last phone, he likes the design, easy to use and navigate, I liked the fact it came with screen protectors and a case. The colour is vibrant, with a nice sized screen, picture/screen quality is very good. This is an idea phone, at a reasonable price. Would recommend",
            "Nice phone, very easy to use.",
            "good for the price, nice color",
            "Was bought for a Christmas present and they absolutely love the phone would recommend to anybody who's looking for a great working phone that has everything you need in your hand.",
            "A good nicelooking phone with NFC, fast 2.2 kırın processor, ample internal memory with 64gb, Runns on Google +Google play store , only hasn't got a pull down memory from the sensor. So you will need to use the conventional pull down method, wich is not a problem, touching the screen and pulling down with you finger, Honor e20 ia an excellent phone , Battery is good The camera does not have the spec as a higher flag ship phone, but still in terms of performance it delivers.",
            "Unbelievable phone for the price my kids love them",
            "As good as any android on the market at a fraction of the price!",
            "Awesome phone I'm really happy with it",
            "I bought the phone for my husband for Christmas its a good size and he really likes it its a beautiful phone",
            "excellent phone. very quick click and collect, Argos staff following social distancing well",
            "Got this after water damaging my Samsung A40, which is more than twice the price. So naturally I was very sceptical if this will be as good as the specs indicate. So far it has performed much better than my expectations. The operating system, performance and built-in apps, camera, in short every thing is great.",
            "It does everything that other mobiles do. It comes with case and screen protector which saves you money and it is worth the price",
            "Brilliant phone for someone looking to enjoy a smart but budget phone. It has great camera and most of the quality of a smart phone. I would indeed recommend.",
            "Phone has a good spec for the price and a large clear screen.",
            "I bought this for my son for Christmas, it's good value for money and does take pretty good pictures which was surprising so I would recommend this phone.",
            "Unfortunately I had to return it on the same day as it wasn't well packaged, the seal was broken as if the box was opened before.",
            "Works well, easy to use, has play store, lots of features you get on more expensive phones, good battery life, only draw back is it still uses a micro USB.\nGo and buy one, you won't regret it for the price.",
            "Really nice phone for the price, looked at many reviews and looked at the specs of equivalent brands, found this one to be the best. Glad I made the right choice",
            "Great item would definitely recommend",
            "Bought for adult son as early Christmas present after his older phone different make died, I had never heard of Honor phone, but he looked up all information on internet and chose this one, really pleased with it, easy to set up, fast charging, lovely big screen. Can use his sim free card from old phone, plus a different one too which holds lots of photos, can use to watch TV programmes downloaded onto iPad so far has said best one ever had and would definitely recommend to friends etc.",
            "Fantastic budget phone that offers everything you'd need. Have performance, camera and display. Purchased for my GF and she loves it. She previously used an iPhone and prefers using an android phone now.",
            "Wanted a new phone and saw this one. Easy to use and navigate. Brilliant.",
            "It's a phone, it's alright, does what it ways on the tin, I think Ronseal might have made it",
            "Great value for money and very well priced. Large clear screen for streaming video",
            "Easy set up and great value for money",
            "Wanted a new phone as didn't want to enter another contract. Easy to use and does the job I wanted it for.",
            "Bought this for my son, and he loves it.\n\n He has gone through a few phones, but this one, he said, is easy to use, nice large screen, and what he loves the most, is the compatibility with all apps. No lagging and the battery life is pretty decent.",
            "Found it easy to set up. Enjoy the screen size lots of features",
            "I just love this phone. I ordered a second one as a Christmas gift for my 16yr old daughter and she's over the moon. Nice design, features and battery.",
            "Great mobile phone, easy to use, fantastic xameras, better that all iphones. Recommended",
            "Nice display res and brightness, but if you check carefully you can see ghosting around selfie camera cutout.\nIts not extra big so you can comfortably hold in one hand.\nIt have 4GB ram plus 64gb memory (thats a must for 2020 phone)\nBatery life is not great but its okay, with normal usage expect 10-12 hours.\nUnfortunately only 10W charging speed.\nCameras are poor but dont forget its entry level smartphone.\nI think for the price there are better choices but this phone will not disappoint you",
            "Quick and easy to use\nLovely phone and the colour is great too",
            "Bought for my dad who uses 2 sins and excellent user experience.",
            "For the money I don't think you can do better. Nice design, works fast and battery life is reasonable. Doesn't feel overly big. Full access to Google apps.",
            "The phone had a great spec for a very competitive price. I have paid a great deal for less from other manufacturers, so I was a little skeptical but decided to try one out. I have an Honor Magic book which is brilliant so stayed with the brand. Features and fuctionality are impressive. Screen is bright and fast and battery life great. Mine was fitted with a screen guard and came with a case. What's not to like?",
            "Bought this phone to replace my old Samsung. Fast and easy to use not to bulky to carry around love it",
            "Due to clumsiness, previous phone unusable (badly cracked screen) so replaced with this. Previous phone also Honor - using Phone Clone, transferred everything from old to new in minutes, seamless swapover: brilliant! Cameras are good enough and data/call performance just fine. Could have done without the expenditure, but Argos Card helped spread cost & phone itself does all I need it to. Only annoyance is my clumsiness, but only me at fault there - phone & Argos customer experience both great",
            "Good modern mobile, super fast delivery",
            "Couldn't even try it properly, some application getting switched on it self and screen get frozen when that's happened.\nUnfortunately sended back on the same day.",
            "Bought my phone from Rustington argos. Very easy and helpful. Phone was just as I had imagined. Very pleased with my purchase",
            "Really good value phone. Does everything I need from a phone. Good camera too",
            "Highly recommended, small price big phone, excellent value . excellent battery life ,fast great storage great camera all round bargain",
            "Such a great phone for the price\nCan't find any fault anywhere",
            "Amazingly fast and prompt delivery, arrived well packaged.",
            "Easy to set up. All features are okay. Pick up collection was very quick. Good for the price. Like Samsung phone I will say",
            "I fancied a new phone as my old one was 3 years old so I went for this. It's a lot quicker than the honor 6x, has loads of storage space nice screen good camera and all the features I wanted. Generally I am pleased with the phone the only downside is that the extra processer power drains the battery sometimes more than I would hope but there are options to rein it in and save power of required. Would recommend highly.",
            "Definitely wonderful phone. I liked!!",
            "Great phone takes really good pictures easy to set up and use looks nice",
            "This phone is an absolute bargain for the price I paid for it. It's quite fast, is packed with many features and has really good cameras. If you are on a budget and are looking for a phone which does everything and more, then this is definitely the one to go for.",
            "That's why I bought 2",
            "it's alright for the price",
            "It’s a fantastic phone, plenty of storage and a great camera. It’s so slim and smart and very easy to use",
            "for a cheaper phone that i would usually go for, i am impressed!\nfast and responsive, battery life seems great aswell, couldn't ask for much more for such a low price",
            "Amazing for price really fast internet connection good camera quality",
            "Excellent budget phone. Can’t argue with the price",
            "Lovely color great camera and useful apps,   not to difficult to hold, nfc and fingerprint scanner, my first honor phone, very easy to use and good vivid screen for watching movies not tried playing games yet, comes with a rubber case but no screen cover, fairly quick to charge lasts all day and a headphone jack for your headphones.",
            "Amazing value for the price would recommended to family and friends",
            "I bought this phone for my son as a birthday present and he is absolutely thrilled with it. Best phone ever. Would highly recomend.",
            "Very good, does exactly the same as my Samsung slllgalaxy did for less price.  Good price as well.  Design and layout is good, with a quality camera",
            "I've got this phone to replace a previous model I put in the wash by mistake.\nI'm amazed by the specs and how cool it looks. Fast, awesome Camera. Everything you need.",
            "Great phone for the price",
            "Does absolutely  everything  you need in a phone looks nice easy to use and really  good value one of best on market sorry no pic bought  as gift",
            "If you want a great phone that does everything like the top brands this is a no brainer I've had iPhones all my life this was my first experience with honor and I can honestly say worth every penny design is great large screen size and excellent camera the battery can go 2-3 days on a full charge I highly recommend this mobile phone"
        ]
    }
}