{
    "869/7329": {
        "remotekey": [
            "869/7329"
        ],
        "item_category": [
            "Go beyond the light with the Reno4 Pro, seeing more than you ever could no matter the light levels. Explore new perspectives with the Ultra Night Wide-angle Video to capture night time content from all the right angles, use Cinematic Mode to set professional parameter adjustments and let your phone do all the heavy lifting with the powerful Snapdragon 765G chipset. Upload and share your content faster than ever with 5G whilst curing battery anxiety with the SuperVOOC 2.0 flash charging technology, fully charging your battery in 36 minutes. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "4 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "3",
            "5",
            "5"
        ],
        "review_date": [
            "19 July 2021",
            "13 November 2020",
            "11 November 2020",
            "11 October 2020"
        ],
        "review_title": [
            "Oppo Reno 4 pro 5g",
            "Feels amazing",
            "Camera is incredible. Space black design is gorgeous!",
            "Worth reviewing"
        ],
        "review_text": [
            "I had Oppo Reno before and I knew I can count on Oppo. Fantastic phone.",
            "I went for this because I don't like big bulky phones. This is so slim and feels great. It has a textures glass back which doesn't scratch or get any marks on it so it always look super clean.\\\n\\\nCamera is awesome, battery is great and it is really snappy. Very happy with my purchase.",
            "So thrilled with my purchase - the design of the space black version is super cool and feels very premium. Already had 2 of my family now wanting one too!",
            "I never write reviews for anything but wanted to thank OPPO in the only way I knew how! This phone is class, I've spent too much time on Samsung's paying over the odds for a camera that is no match to this phone. Thank you so much for OPPO for helping me get more for my money than I would have elswhere!"
        ]
    }
}