{
    "753/1424": {
        "remotekey": [
            "753/1424"
        ],
        "item_category": [
            "iPhone SE is the most powerful 4.7-inch iPhone ever. Featuring A13 Bionic, the fastest chip in a smartphone, for incredible performance in apps, games, and photography. Portrait mode for studio-quality portraits and six lighting effects. Next-generation Smart HDR for incredible detail across highlights and shadows. And all the advanced features of iOS. With long battery life and water resistance, it's so much of the iPhone you love, in a not so big size. "
        ],
        "summary_star_rating": [
            "5"
        ],
        "no_reviews": [
            "24 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "13 April 2021",
            "13 April 2021",
            "9 April 2021",
            "20 January 2021",
            "12 January 2021",
            "6 January 2021",
            "1 January 2021",
            "20 November 2020",
            "21 October 2020",
            "2 October 2020",
            "9 September 2020",
            "8 August 2020",
            "22 July 2020",
            "22 July 2020",
            "24 June 2020",
            "17 June 2020",
            "9 June 2020",
            "3 June 2020",
            "3 June 2020",
            "3 June 2020",
            "28 May 2020",
            "27 May 2020",
            "26 May 2020"
        ],
        "review_title": [
            "Excellent",
            "Great phone",
            "Phone is fab, great camera",
            "Amazing phone for a fab price",
            "Excellent working",
            "Great product!",
            "Brilliant Phone",
            "A good upgrade from 2016 version",
            "Big things in a small package",
            "My new iPhone Se is great",
            "My new iPhone SE 2nd Gen is great",
            "Bought for my wife and she loves it.",
            "",
            "Awesome!",
            "",
            "Great piece of kit",
            "Absolutely amazing better than expected",
            "IPHONE SE",
            "Upgraded from 6 and I love it",
            "My new SE is great",
            "Fab",
            "iPhone SE is great",
            "Looks great",
            "Have around week all good."
        ],
        "review_text": [
            "No problems have arisen",
            "Great phone worth the money",
            "Brilliant phone. No issues at all. Fabulous camera",
            "Amazing phone with most features that other high end phones offer at a very affordable price. Would definitely recommend.",
            "Excellent working in general",
            "After a lot of research, I have determined that iPhone SE is pretty good for its price. It is still quite expensive especially whilst being marketed as a budget phone but given the price of other phones with similar services, I would go for the SE.",
            "This phone is great for eveyday use",
            "Still too early to say if battery life is OK. Migration from old to new phone very easy but the \"how to's\" have to be looked up online - nothing included in the box.\nBought as a gift - recipient seems very happy with it.",
            "Nice phone, great colour but the finish is so sleek it slips out my hand, so a cover and screen protector is a must. Memory on this is amazing, lots of room for my photos and app’s",
            "Very pleased with my new iPhone Se - so easy to transfer my contacts and data over from my old iPhone! Love it!\nCollected from Argos the next morning- brilliant!",
            "Very please with my new iphone which was easy to set up. I use a lot of apps, so went for the 256gb model, which is brilliant.\nAs always, Argos was quick and efficient obtaining the correct model and it was easy to collect from their local outlet.\nThoroughly recommended.",
            "Does everything my iPhone XR does other than face recognition. Cracking little phone.",
            "Not to small not to big,perfect for a woman hands but also recommended for everybody",
            "Absolutely thrilled with this phone! Can not fault it in any way shape or form! The classic design, the features, the specs, even the colour (white) absolutely timeless classic that will be as good if not better than the original iPhone SE which still stands up against most phones in the present day also. No need to spend ££££ on the latest iPhone when this phone does everything the same for half the price yet still has the same Apple logo we all know and love! Thankyou Apple! Thankyou Argos!",
            "Phone is easy to use and lovely clear graphics",
            "This is an ideal phone for me. Really quick, good all round performance and excellent value for money. The perfect update from my previous iPhone SE (2016).",
            "I purchased this from Argos as it was possible for me to collect it the next day, even on a Sunday which is A very good service. The phone itself exceeded my already high expectations of it with the very good battery life and large storage. Good to know that they were still reliable even in such dire times of this pandemic. Couldn’t ask for anything else honestly, hands down best customer satisfaction.",
            "iPhones just keep getting better",
            "Great upgrade from the 6 only sad thing is no headphone jack",
            "Love the phone, works just like my old one only faster! Was able to download all my contacts and apps very quickly with no hassle! The camera is amazing. I like the fact it fits in my hand/pocket to take photos. Really worth the money",
            "Great service and tracy was lovely and friendly when collecting my item",
            "The iPhone SE is great. It’s literally a brand new phone with all functions of the latest iPhone 11 or XR. It’s super fast and practical. The only thing I miss and don’t like is not having a headphone jack. It will be something to get used to. But the camera quality is great. It’s also lightweight and the design is nicer and more modern than the old SE",
            "A great handset . High quality specs. My daughter loved it.  I like Apple iPhones. Very liable.",
            "Have around week all good. Present for husband."
        ]
    }
}