{
    "848/2967": {
        "remotekey": [
            "848/2967"
        ],
        "item_category": [
            "iPhone 12 mini packs big features in a 5.4-inch design. Incredible low-light photography with Night mode on all cameras. Cinema-grade Dolby Vision HDR video recording, editing and playback. Powerful A14 Bionic chip. 5G capable and new MagSafe accessories for easy attach and faster wireless charging. It's big news for mini. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "25 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "23 June 2021",
            "23 June 2021",
            "20 May 2021",
            "19 May 2021",
            "5 May 2021",
            "29 April 2021",
            "28 April 2021",
            "21 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "14 April 2021",
            "24 March 2021",
            "16 March 2021",
            "23 February 2021",
            "16 February 2021",
            "20 January 2021",
            "20 January 2021",
            "6 January 2021",
            "9 December 2020",
            "2 December 2020",
            "2 December 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020"
        ],
        "review_title": [
            "Mrs",
            "steve jobs loyalist",
            "Perfect size phone",
            "Excellent phone and has features that I can use",
            "Nice iPhone 12",
            "Works well",
            "Daughter loves new phone",
            "iPhone 12 mini",
            "Love my mini phone!",
            "Great phone, not too big",
            "Look super fantastic",
            "Is looking very fantastic",
            "",
            "Love it!!",
            "Great phone",
            "It is so good.",
            "Silky smooth phone",
            "A very competitive price",
            "Very good I am so happy",
            "iPhone 12",
            "iPhone 12 mini",
            "iPhone 12 mini",
            "Great Features in a smaller package",
            "My iPhone 12 mini does the job it’s made to do.",
            "Lovely neat iPhone mini"
        ],
        "review_text": [
            "Excellent I'm glad I bought this mobile",
            "I've been clinging onto my 7 because I hate bigger phones so yep its great",
            "Really glad I bought this phone it’s the perfect size, fits easily into a pocket and isn’t too heavy.  Face recognition is great, and screen size great.  This phone is faster than my iPhone 8 Plus and works seamlessly with my iPad pro and Apple Watch.",
            "Bought to replace an older iPhone which gave me good service but needed upgrade hence chose iPhone again for quality and service if required",
            "Small and great quality in photos , and the size is just perfect! I love my mini12 iPhone! I highly recommend",
            "Works v well and is fast most of the time, but not always. However, I never like the Apple software, v user unfriendly, hard to find certain features, lack of (a) undo button, (b) delete letter forward (given that it is hard to operate on a small screen), (c) counting mobile data usage, (d) confirmation / ok, eg, when a phone No. is touched, it calls immediately without asking to press OK. Anyway, the camera is superb. I would not have  iPhone if I did not need FaceTime.",
            "We purchased this phone for our daughter she loves it and despite it being called mini it’s still the same screen size as her current I phone 8",
            "Nice little phone. Emphasis being on little as I didn’t realise how mini it was. My mistake, but it works great",
            "This phone is perfect, wanted an iPhone for ages but wanted one small enough to easily carry out and about. Really happy with it.",
            "I’m really pleased with my new iPhone, especially as it’s the roughly same size as my old iPhone 6 so I can use the same case. It’s also allowed me to access apps I couldn’t before, and the camera is better quality. So, though paying for it hurt, I’m glad I did it.",
            "Very excellent product and excellent Argos customer service",
            "I am so happy with my service very happy",
            "Traded up from iPhone 5s 12 mini is all it says it is the speed is spot on and despite issues with battery I’ve read about I find it more than enough.Camera is unbelievable so much you can do with it. Would recommend this phone to anyone.",
            "Absolutely love it. I have been searching for a small smart phone and here it is!",
            "The extra screen space is really good and the new face recognition to unlock your phone is brilliant! Extra bit of security. Battery life is brilliant and it’s a great size",
            "It was my special day because i was purchasing the iphone 12 mini. when i just see and it was so nice and the camera pixel is so clear. I am very happy",
            "Small phone perfect size in my opinion, graphic quality superb. If you’re an Apple user it’s easy to use. And it’s a good looking phone.",
            "Beat all on price, in stock was able to collect within 2 hours. Very professional approach to covid 19 face/space routine. Staff very friendly and helpful. Exceptionally quick pick up in store. Will use again.",
            "Price r good I like it and service is lovely",
            "Very good display very fast a good product",
            "Very fast and smart.",
            "Not sure if its what I expected, the biggest disadvantage is size far too small",
            "I wanted a phone which has the latest Apple hardware with all their current features. I was a little concerned about the smaller battery but it lasts the day on moderate use.",
            "My iPhone 12 mini is perfectly adequate, and I only have one complaint. The battery does not hold the charge as long as I would expect. Therefore I am expecting the battery will need replacing in the not so far off future. I gave my iPhone 6 to a family member because the battery was running down too quickly for my liking. But my iPhone 12 mini battery runs down just as fast. But I’m still happy with it because it is an upgrade.",
            "Cracking mobile phone really compact plenty of nice features, was waiting for a phone of this size."
        ]
    }
}