{
    "877/9254": {
        "remotekey": [
            "877/9254"
        ],
        "item_category": [
            "Awesome is for everyone. Life just got a little more awesome with the sleek and stylish Galaxy A42 5G. Enjoy an amazing camera for capturing your favourite moments, a 6.6\" Infinity-U Display for binge-watching your favourite entertainment, and a Long Lasting Battery that will keep you going. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "57 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "93%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "23 June 2021",
            "23 June 2021",
            "9 June 2021",
            "2 June 2021",
            "27 May 2021",
            "23 May 2021",
            "9 May 2021",
            "6 May 2021",
            "6 May 2021",
            "6 May 2021",
            "5 May 2021",
            "5 May 2021",
            "5 May 2021",
            "4 May 2021",
            "29 April 2021",
            "27 April 2021",
            "24 April 2021",
            "21 April 2021",
            "21 April 2021",
            "17 April 2021",
            "17 April 2021",
            "14 April 2021",
            "14 April 2021",
            "13 April 2021",
            "12 April 2021",
            "7 April 2021",
            "5 April 2021",
            "5 April 2021",
            "4 April 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "30 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "17 March 2021",
            "16 March 2021",
            "14 March 2021",
            "10 March 2021",
            "10 March 2021",
            "9 March 2021",
            "3 March 2021",
            "3 March 2021",
            "16 February 2021",
            "13 February 2021",
            "12 January 2021",
            "9 January 2021",
            "7 January 2021",
            "6 January 2021",
            "5 January 2021",
            "3 January 2021",
            "31 December 2020",
            "26 December 2020",
            "8 December 2020",
            "17 November 2020"
        ],
        "review_title": [
            "Great features",
            "Fast and good for its price!",
            "Great features",
            "Easy to set up and use",
            "Great",
            "Great features",
            "So far, so good",
            "Love my new phone",
            "Great phone",
            "Fast and easy to use",
            "Amazing",
            "",
            "Excellent phone",
            "Easy to use phone",
            "Best phone I've ever had yet",
            "Good overall",
            "",
            "Galaxy A42",
            "Does the job",
            "The perfect phone",
            "Great phone",
            "Great phone",
            "looks good and is a big step for me.",
            "My phone look great",
            "Great phone for the price",
            "Very pleased",
            "I am very pleased with my phone battery last 2 day",
            "Value for money.",
            "Great apps and features some of the apps are reall",
            "Screen",
            "Pay little for good phone",
            "Samsung A42 G5 mobile",
            "Just the job",
            "Huge memory and very fast",
            "Doea everything we needed",
            "I love this mobile, there is no different like s 2",
            "My phone look great.",
            "Excellent for the price.",
            "great my son was super excited",
            "Samsung A42",
            "Good value for money",
            "Excellent phone",
            "Great device",
            "Nice",
            "",
            "Looks great for a replacement phone",
            "Samsung galaxy A42",
            "Its looks stylish",
            "Nice",
            "Great phone for the price.",
            "Good staff",
            "Very nice and wonderful technology in my mobile.",
            "Fabulous phone looks great!! Easy to use",
            "It feels handy",
            "Very bad",
            "Worst phone with 720p display and cost is too high",
            "Great"
        ],
        "review_text": [
            "I bought this phone about a month ago and I am very pleased with it.",
            "I bought this 1-2 months ago and it's smooth without any lag! Can't believe your getting so much value for a budget priced phone! Definitely recommend!",
            "Great phone ,but  did not came with ear phone",
            "Bought for my son. Even though when I ordered it through argos I literally had to wait  one week which is disgusting in this day and age . So argos service is poor . \nThe phone on the other hand is excellent. Cant fault it .Great apps,easy to use .",
            "I bought the product few weeks ago and I am happy with that.",
            "Great videos and pictures and games. Good to watch YouTube on the phone",
            "Super phone with great range of features including 5G. Purchase recently still to make the most of phone's functions. So far so good",
            "I love this phone the camera is perfect I haven't even used all the different options  yet but the quality of the pictures are excellent.  I love the fact you can move most of the aps to the sd card.  I have so much space I am not worried about fill this phone up.  The size is perfect as it has a lovely large screen that makes playing games and looking at Facebook easy.  It's really easy to use.",
            "Love this phone. Easy to use and great for the price",
            "V easy to use, fast too. Don't do games or films on the phone so won't be able to comment on those. I paid Vodafone (staff very helpful) to transfer stuff from the old phone to this one, but there is a free app online that you can DIY. As it is not the top range phone, v difficult to get accessories. It is 5G, let's hope the phone will last.",
            "Good price for a good quality of this samsung phone",
            "Very good purchase and easy to navigate",
            "Excellent any body can buy this phone.one time chargeing long time use.",
            "The setting up of the phone was so easy to do and didn't take very long. The phone is also great to use. As the screen is so large, it makes reading anything on it very easy to do.",
            "Best phone I've ever had. Camera is amazing and the battery lasts long",
            "It is a good phone for someone who doesn’t really know how to use smartphones and it is very easy to use.",
            "good one and awesome product",
            "Easy to set up. Accept memory cards. Good camera. Long life battery.",
            "This phone is good value for money and is a great upgrade for me from my old A6",
            "I desperately needed a new phone and friends & family recommend a Samsung. After looking at professional reviews for the A42 I thought I'd take the leap. I'm so pleased I did it everything I want in a phone. Easy to use, does what I need and the camera is fantastic.",
            "For the price it is a good responsive phone + 5G ready can't ask for more.",
            "Had thus phone a few week's now and it's great,, battery life is exceptionally good,use it all day n still have over 50% when I get hoke, camera takes brilliant photos and so many other features to mention,, gets a thumbs  up and 10/10",
            "I'm still learning how to drive this beauty.",
            "Love this Phone look good and as everything that I need. I recommend this product",
            "Bought this as my old phone was running out of stored memory. Did quite a bit of research prior to buying and decided on this one. The features are what you would expect from samsung. Great camera and only need to charge the battery every couple of days. Set up was quick and easy and being able to automatically transfer all contacts and Apps was a bonus. Great amount of memory also.",
            "Got this phone to update from A30s. Lot better and just been upate to Android 11.",
            "Love my phone easy to use chargers in 2 hours and last for 2days plus. Takes brilliant photos connected easily to my computer and does all the things I want. It is a little bit bigger than my last Samsung but I have not found that a problem fits easily in my hand and face recognition works every time.",
            "After replacing my s10 with a A42 5g I was expecting a down grade on features, not so.\nScreen resolution, sound and cameras on this phone are just as good, battery lasts a good two days for me, a high user.\nOnly let down is the lack of wireless charge ability. We'll worth the money.",
            "It's a better phone overall then my a41 the features seems to be more advanced",
            "Phone is great.. screen is huge great for watching TV or music..",
            "Nice phone. \nOrder online and get it at the shop right away. \nGood service. Know disappointment..",
            "Was the mobile doesn't receive text doesn't send text",
            "Needed to upgrade my phone due to maxing out internal 32gb memory on essential apps. Required future proof phone, with good  memory, fast, excellent camera especially for macro work and 5g compatible. The phone ticked all the boxes, so far really pleased.",
            "Love this phone. Lots of room for apps and storage. Only issue is the shutter speed on the camera is slow which causes you to miss the moment. Especially with children and pets that move a lot. The phone is over all good value.",
            "Bought for my son who is absolutely delighted with it. Does everything he wanted a phone for.",
            "Reasonable price tha",
            "Very nice to set up and use",
            "Entry level 5g but as a base model its fantastic, it has made my life easier. I use my phone to help support with mental health issues, I need it to do near enough everything that people take for granted. Very fast operating system, loads of memory, very easy to use,which is a massive positive for me. another brilliant phone by samsung.",
            "as described from Samsung great smartphone",
            "Great device. Efficient, easy to use and awesome camera !",
            "The phone has a lovely big screen and very large memory for lots of apps. I think the shutter speed on the camera is too slow however. Also the keyboard is slow and frustrating",
            "Bought 4 of them.  In many ways better than my year old S20+.  It has reasonable camera (out of the box, no need for the ongoing camera updates). It has 3.5mm accessory jack, expansion card slot (that S21+ doesn't have) and relatively fast processor.  The low display resolution doesn't mean, that your photos, or video clips have low resolution.  You can always watch them in hi-res on your tablet, or laptop.  The low screen resolution equals to lower power consumption and longer battery time. The A42 5G super amoled screen in general use (games, Youtube), is no different, from hi-res screen in my S20+.  In fact after my purchase of first A42 5G, I have reduced the resolution of my other phones, to reduce the time they spend on high speed chargers.",
            "Very happy with this phone. Good battery life, and much more storage than my old Galaxy, and I was able to quickly, and easily, transfer everything straight over from my old phone.\nTakes good, sharp photos and videos.",
            "Very nice hand set . I am really of this mobile set . I will tell my friend to buy this. Argos service is excellent.",
            "Very happy with this phone.",
            "Great phone easy to use fast at charging up and very easy to use.",
            "Easy to use. Seemless transfer of apps from old phone. Clear display & excellent camera",
            "It's very nice phone ,it has excellent camera, so many features,colours best ,I will buy for my wife again",
            "Best for price and 5g",
            "Looks good, great screen picture quality. Great phone for the money.",
            "this phone is very realistic and sophistic I really love it when I bought from you so that I prefer to say many thank you for you asking me reviews",
            "Very reasonable price and affordable to everyone.",
            "Fab phone camera takes beautiful photos.\nScreen is bright and colours crisp.\nKeyboard easy to use.\nNavigation around phone is simple.\nLove this phone would definitely recommend it!",
            "The phone is beautiful with superb features",
            "Very bad quality phone . Specially it is too difficult to take screenshots , up and down volume etc its totally rubbish.",
            "Bad phone dont even think of buying  720p disply what samsung was thinking no one knows",
            "loving everything! Nice service came quick and served me good!"
        ]
    }
}