{
    "215/4631": {
        "remotekey": [
            "215/4631"
        ],
        "item_category": [
            "Just the right amount of everything. Shoot 4K videos, beautiful portraits and sweeping landscapes with the all-new dual-camera system. Capture your best low-light photos with Night mode. See true-to-life colour in your photos, videos and games on the 6.1-inch Liquid Retina display. Experience unprecedented performance with A13. Bionic for gaming, augmented reality (AR) and photography. Do more and charge less with all-day battery life. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "59 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "98%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "21 April 2021",
            "18 April 2021",
            "2 April 2021",
            "31 March 2021",
            "30 March 2021",
            "24 March 2021",
            "24 March 2021",
            "16 March 2021",
            "10 March 2021",
            "3 March 2021",
            "3 March 2021",
            "9 February 2021",
            "13 January 2021",
            "12 January 2021",
            "17 November 2020",
            "27 August 2020",
            "26 August 2020",
            "20 August 2020",
            "18 August 2020",
            "11 August 2020",
            "8 July 2020",
            "1 July 2020",
            "1 July 2020",
            "1 July 2020",
            "25 June 2020",
            "16 June 2020",
            "27 May 2020",
            "26 May 2020",
            "19 May 2020",
            "13 May 2020",
            "13 May 2020",
            "7 May 2020",
            "5 May 2020",
            "5 May 2020",
            "7 April 2020",
            "24 March 2020",
            "24 March 2020",
            "18 March 2020",
            "4 March 2020",
            "4 March 2020",
            "25 February 2020",
            "22 February 2020",
            "18 February 2020",
            "12 February 2020",
            "6 February 2020",
            "4 February 2020",
            "29 January 2020",
            "28 January 2020",
            "22 January 2020",
            "31 December 2019",
            "27 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "14 November 2019",
            "29 October 2019",
            "15 October 2019",
            "8 October 2019"
        ],
        "review_title": [
            "My iPhone 11 is fabulous",
            "Great phone",
            "My new iPhone is great",
            "Really nice phone, no regrets",
            "",
            "iPhone 11",
            "Not exactly I thought of it.",
            "Looks fab, no problems at all.",
            "As you expect typical apple quality but...",
            "I like it ,! So it’s got to last me a while !",
            "",
            "10",
            "Still overpriced",
            "My phone looks fantastic",
            "Good nice",
            "Super",
            "My IPhone is great.",
            "Features are amazing.",
            "Brilliant Birthday Present",
            "Brilliant phone",
            "iphone 11 is great",
            "my iphone 11 is the perfect phine",
            "It looks nice",
            "Brilliant phone",
            "iPhone 11 - Does the job",
            "Beautiful Phone",
            "Volume and battery are not great",
            "Very good picture quality",
            "Exellent like it",
            "Iphone 11",
            "So worth the upgrade",
            "Sleek and charges fast",
            "I phone 11",
            "This is my first i phone i ever had tje experince",
            "Amazing Phone",
            "good features",
            "The Iphone 11 is great so easy to set up.",
            "",
            "Easy transfer",
            "Just what I wanted",
            "Just brilliant",
            "Enjoying the features and prolonged battery life",
            "Upgrade",
            "iPhone",
            "Excellent upgrade for my iphone",
            "Just a nice phone.",
            "Great phone",
            "Love this phone",
            "Amazing phone",
            "Best ever!",
            "Best phone ever",
            "Looks good, features work well",
            "Absolutely Fantastic",
            "Iphone 11",
            "",
            "What an Amazing phone",
            "It was easy to transfer data to this phone",
            "Brilliant phone",
            "5***** Product"
        ],
        "review_text": [
            "One the best things I ever brought!",
            "Great phone ticks all the boxes for me",
            "I have nothing to add just to say i like my new iPhone",
            "I purchased to replace my iPhone XS, which decided to leave the earth unexpectedly. \n\nI really like the colour and design, and it’s really responsive. The camera has a slight improvement on its predecessor so I’m happy with that, but it pretty much works the same as my other iPhone. \n\nPrice tag is expensive, but to be fair it was less than my last one so I’m overall pretty happy with it.",
            "Excellent phone highly recommended",
            "Fantastic phone can’t fault it battery lasts well and easy to use",
            "I was disappointed with my purchase because there was no ear piece and no charging head only a cable.",
            "Perfect condition, easy to use and safe to pickup! Thanks Argos!",
            "My issue is with Argos! I called (took ages & many automated messages) to get through to an advisor to request a vat invoice as this wasn’t available online & she said she would email it! I still haven’t received it & the thought of the drawn out call again to customer services is filling me with dread!!! Phone was perfect though!",
            "I like it , it hasn’t got a home button , but I don’t mind that, you lean how to use it as you go along ! It’s going to have to last me a while now as I can’t keep buying new phones .. they are expensive.",
            "Best phone I've ever had",
            "Nice I likeI like this phone is really nice can’t",
            "Apple continue to have their unfair stronghold on retailers, dictating the price. (This product is the same price wherever you purchase it from).",
            "everything was great",
            "Good nice one better",
            "As I upgraded from iPhone 7 and it’s realy hood quality as i was expecting",
            "I was getting fed up with my iPhone 8, because you had to charge it every day. The iPhone 11 is a wonderful improvement, and I get 2 days plus without having to charge.",
            "It’s a good phone.Easy to set up.Camera system is very good.",
            "Very good battery life and the screen is high quality. Only downside is that there is no jack to lightning adapter in the box but they do provide Apple wired earphones with the lightning adapter. Overall a great phone but would rather the price be lower.",
            "Upgraded from my 6s, great product.",
            "Love my new phone. Previously to my new phone I had the iPhone 8 plus. \n\nThe iphone 11 seems to have a lot of improvements. The camera is great. Slight changes to usual commands such as taking screenshots. Facial recognition is a great feature. \n\nHighly recommend.",
            "the phone works perfectly and i am very happy after upgraded the phone...",
            "Easy to use close to home",
            "This is the best iPhone I’ve had so far, it’s faster then my old one (iPhone 6s) and the quality of videos is amazing.",
            "I bought this as a gift for my fiance after she smashed her phone. \nShe's very happy with it. No negatives, good size, weight, features. \nRecommended",
            "I upgraded from an IPhone 6s 64gb to this and now I see the big difference in terms of all the features.Enough storage and more features and nice camara.I would recommend.",
            "It works well and feels good.",
            "I live it, it's good quality",
            "Very nice phone easy to use",
            "Great value for the money and an excellent price",
            "Amazing product, design is amazing and the battery life is brilliant. It can last me 2 days on a single charge and charges quickly as well. \nWould definitely recommend to anyone needing a new phone.",
            "It is an amazing phone and worth the price",
            "Not much to say fantastic camera great battery life and one of the fastest chips in a mobile and ease to use good size in your hand little bit pricey but that’s what you pay for quality one of the best I phoned out there best purchases I’ve ever made very happy",
            "This is my first i phone i ever had tje experince Was wonderfull",
            "It’s such a beautiful phone, the colour is stunning and it works amazingly. Great upgrade\nPricing wise I’m not impressed or unimpressed. It’s the same as you could buy in any other company. But it’s great anyways. Would recommend.",
            "The features are good it was easy for husband use he is severely sighted for him he found easy just to get to use the touch cause there is no home button and special it can change to bold letters",
            "Easy to set up ,Would recommend to a friend",
            "I recently got the product and it’s fabulous",
            "I was surprised at how easy it was to migrate. Put the phones together and it does it for you. Very good!",
            "Looks great and does the job",
            "Just feel awesome to be back on IOS. Works great no problems or complaints till now",
            "Loving my updated iPhone 11 from previous iPhone 7. Apple products always high quality and easy to operate. Very pleased with my purchase.",
            "My previous phone was an old iPhone 16GB storage, so I am loving 256GB of storage. The phone is nice to handle, photo quality is good, and Face ID is a nifty little feature for unlocking the phone, logging into apps etc. Phone battery lasts me all day, with lots of use on social media apps, messaging, FaceTime, YouTube, and listening to my music library. \nSo far so good",
            "First class product, highly recommended.",
            "Very pleased, upgraded from iphone 6s. Well worth it.",
            "I bought this phone as an upgrade to an IPhone 8 that I've had for a while.\n\nI chose the 11 rather than the 11 Pro/Pro Max because it has an led screen. The other two have oled screens that can strain my eyes (a problem with many phone users.)\n\nThe phone is largish, but still easy to use in one (man's) hand. It's light, the screen is bright and easy to read in sunlight and the battery life excellent.\n\nOverall a very nice phone, pricey but to me worth it as it should last for a few years.",
            "The battery life is so much better than my last iPhone",
            "I was not sure about changing from android to iPhone a few things I love about this phone compared to android and a few things I’m not sure about but it works fine I don’t regret buying this it’s great took a while to sort out as not used to it but I would definitely recommend",
            "I bought this as replacement of my iPhone 8. Its amazing, so much storage. Working perfectly.",
            "iPhone at it’s best. Fantastic battery life best ever! Loving the face id. Highly recommended 5*",
            "My daughter love her new I phone 11 .",
            "Good phone ! Bit on the pricey side! Works well ! Good camera !",
            "This is the fastest iPhone I ever had, battery life is impressive and I’m happy I got iPhone11 instead of the iPhone11 Pro which is ridiculously expensive for the 3rd Camera and is even smaller with 5.8” screen... iPhone 11 is all the way better with 6.2” screen!",
            "I wanted to update my 64gb iPhone se after having  it for over 3 years the phone that appealed to me the most was the iPhone 11 it does everything I want at a price I was willing to pay and it’s got the extra memory I was looking for in 256gb of memory all in all it’s a brilliant phone.",
            "I would recommend this shop to everyone.",
            "This phone is great. Its all good. There is no don'ts",
            "Don’t charge until it has completely died \nPut the screen on dark mode as it gives you more battery life.",
            "I bought this as upgrade from a 6s and the difference in battery life is amazing! I can use it all day and still be on 70% battery at the end of the day. Great camera as well plus all the usual iPhone features. Fast and easy to buy online and collect from my local Sainsbury’s, only the red was available but happy with that.",
            "Great product. Easy available"
        ]
    }
}