{
    "869/8029": {
        "remotekey": [
            "869/8029"
        ],
        "item_category": [
            "The Find X2 Neo is a super slim super lightweight 5G smartphone. With a quad rear camera set up with Ultra Steady Video 2.0 for incredibly smooth videos. 5G connectivity and a 90Hz refresh rate display with pin sharp FHD+ resolution for truly immersive entertainment. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "13 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "60%"
        ],
        "review_rating": [
            "1",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "1 August 2021",
            "23 June 2021",
            "31 May 2021",
            "31 May 2021",
            "1 April 2021",
            "3 March 2021",
            "13 January 2021",
            "11 October 2020",
            "11 October 2020",
            "30 September 2020",
            "30 September 2020",
            "30 September 2020",
            "30 September 2020"
        ],
        "review_title": [
            "Faulty",
            "Great features at very good price",
            "Actually the best",
            "",
            "It's expensive for his performance",
            "",
            "Fantastic for price and specs.",
            "Pleasantly surprised!!",
            "Love how light it is",
            "I have always been an iPhone user and quite honestly I was apprehensive to even change",
            "Always had Samsung phones up until this, but this blows them away!",
            "X2 Neo",
            "Find X2 Neo"
        ],
        "review_text": [
            "Lovely packaging! Super-looking phone and  it felt fantastic in my (female) hand: large but comfortably-fitting. HOWEVER! The phone would set up. I went round in circles, following the instructions without success. The main screen language was Chinese and the English instructions were misspelt. There was no instruction manual and I couldn't find one on-line. The website just took me to glossy adverts for the 3 Oppo models and, as far as I could see, nothing more. I completely lost faith so opted for a refund.",
            "I bought this one week ago and I'm very satisfied",
            "I'll admit I was skeptical...I had never heard of Oppo and I had no expectations but I have been pleasantly surprised! The colours are amazing, the phone is excellent to use and the customer service is outstanding. I'm an Oppo convert.",
            "",
            "I use all day data, this is my job, so the battery rezist just 3 hours if you use full capacity",
            "Phone has all the lastest android function",
            "Oppo Find X2 Neo is on the same length as the premium Samsung S20 for half the price.\n\n90hz refresh rate.\nSuperior Dolby Speakers \n12 GB Ram\nHD+ Display\nSnapdragon \nFast charger \nClean software \n\nHighly recommended!",
            "A was given this handset by my employer to replace our I Phones and must say I wasn't happy. I have always been an I Phone user and wasn't looking forward to learning a new system. \\\nHow shocked was I, when I  found it easier than expected to get on with? The size is great, what first looked like a big phone fits surprisingly well in the hand. The battery great and the charging is so fast. It has an amazing Camera set up, very easy to use, and when I looked at the price? well, I was pretty blown away. My upgrade is due on my own phone and I have been looking at the Reno 4 Pro. My only disappointment is the color options and case choices. However, you have a convert",
            "I always choose my phone on design, I like having a big screen because I can see the keyboard better but this often comes with a heavier phone. Not in the case of the X2 Neo, its so light and fits in my pocket! I had a small problem understanding Android as I'm an Apple user for everything else but I used the live chat on the OPPO website and they ironed out my thinking. So much easier!",
            "I have always been an iPhone user and quite honestly I was apprehensive to even change. However, after a recommendation from a family member I was introduced to OPPO and I certainly won’t look back. The camera is simply amazing but my favourite is the super-fast charging (which is just the best when you are always on the go!). We as a family are now all OPPO users! \\",
            "Always had Samsung phones up until this, but this blows them away! Took a photo in low light and it genuinely looked like I took it in the day. Storage is really generous, design is super premium (love the orange leather) and the charging time is truly impressive, it’s so fast! Really handy for that quick charge every couple of days.\\\nCouldn’t recommend this handset highly enough!\\\nDefinitely will get an OPPO device in the future.\\",
            "I had a Nokia phone which I had for years so this was quite the upgrade I love it simple to use, looks really amazing too charges really quick too.",
            "Love my brand new Find X2 Neo. Looks good, great store space and really clear camera. Upgraded from Samsung S8+ and the difference in camera quality and overall speed of the phone is impressive. However I’d say my favourite feature is the fast charger, I plug my phone in for half a hour and I’ve plenty of battery for the rest of the day."
        ]
    }
}