{
    "869/8263": {
        "remotekey": [
            "869/8263"
        ],
        "item_category": [
            "The OPPO Find X2 Lite is power house with 5G connectivity and a 360 degree antenna support to make sure you always have the best coverage. As well as a 48MP main camera, in a quad rear camera sety up including an 8MP ultra-wide and two 2MP portrait lenses. Fast charging for a full charge in just 56mins. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "20 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "95%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "28 July 2021",
            "28 July 2021",
            "21 July 2021",
            "16 July 2021",
            "13 June 2021",
            "8 June 2021",
            "27 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "31 March 2021",
            "24 March 2021",
            "17 March 2021",
            "3 March 2021",
            "23 February 2021",
            "16 February 2021",
            "10 February 2021",
            "21 January 2021",
            "20 January 2021",
            "13 January 2021"
        ],
        "review_title": [
            "Similar to Samsung.",
            "Nice new phone",
            "Great phone at a bargain price.",
            "Good Customer Service",
            "Value",
            "Great",
            "Battery let it down",
            "OPPO Find X2",
            "Fab",
            "Phone",
            "Phone",
            "Picture quality is very good Nd very fast . I like",
            "Good value",
            "Very nice",
            "Excellent phone",
            "I bought for my wife as a present. Very good phone",
            "Very good 5G phone, worth",
            "This phone is Good and quick to respond",
            "Amazing phone",
            "I don't recommend",
            "Great mid range phone"
        ],
        "review_text": [
            "Similar to Samsung. Great price for what it can do. Love it battery lasts a day way better that Samsung battery life.",
            "The phone is easy to use and has plenty of storage. Camera takes great pics and it also is very fast to charge up. Great purchase",
            "Superb phone.  Very good battery life.  Charges In minutes.  Only problem is phone is too easy to mute.  Control would be better on left hand side.",
            "Good quick customer service. Girlfriend very happy with phone and would recommend.",
            "Great phone for the price, easy transfer from old phone & nice look and feel",
            "I bought this a few weeks ago and I am so happy that I did it, long-life battery, update to Android 11, and hyper-fast CPU",
            "Very good phone. It has everything I need. Works perfectly so far. The only issue I have with it is battery - lasting barely one day of moderate use. Fast charge and fast discharge.",
            "very good smartphone  I'm Bute for my friend for gift",
            "Simple The Best !!!!",
            "It's a perfect android phone and easy to use",
            "It's a perfect android phone and easy to use",
            "I like it more than my  iPhone . It’s more faster than iPhone",
            "Fast charging and snappy performance.\nAlso has a awesome antenna for good signal strength.",
            "All good for me, all you have to do is just buy it & keep using it, you ll never be tired",
            "This is a really good mid-range phone. it comes with everything in the box including a case,charger,headphones,screen protector.also charger is a very fast charger full charge around half an hour.good battery life.it works just as good as the more expensive phones if not better.also good camera.feels slim and sleek good in the hand lightweight very fast phone.only downside no 90hz screen,no memory card slot, but for most people 128gb should be enough. overall good value for money.",
            "Bought as a present for my wife. Very good phone for a price big enough memory fast reliable.",
            "Very good 5G phone and high performance camera , worth",
            "First when got this phone I found it’s good for multi tasking and quick to respond so far so good",
            "Cannot fault this phone at all. Love the pearl white, full charge in less than 30 minutes. So bright and easy to use. Love it",
            "You pay to much for nothing ,it's not worth it.",
            "Needed quickly as trusty s10+ died on boxing Day, next day delivery! great phone, great camera, fully charges in under 50 mins from 0%. Screen is bright and sound is good. 8gb ram means nice and snappy. 128gb storage is handy too. Would definitely recommend!"
        ]
    }
}