{
    "220/0640": {
        "remotekey": [
            "220/0640"
        ],
        "item_category": [
            "Three cameras. Unlimited possibilities. Shoot amazing videos and photos with the Ultra Wide, Wide and Telephoto cameras. Capture your best low-light photos with Night mode. Watch HDR films and programmes on the Super Retina XDR display — the brightest iPhone display yet. Experience unprecedented performance with A13 Bionic for gaming, augmented reality (AR) and photography. And get all-day battery life and a new level of water resistance. All in the first iPhone powerful enough to be called Pro. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "127 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "97%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "8 June 2021",
            "22 April 2021",
            "20 April 2021",
            "17 March 2021",
            "26 November 2020",
            "18 November 2020",
            "5 November 2020",
            "3 November 2020",
            "28 October 2020",
            "27 October 2020",
            "8 October 2020",
            "3 October 2020",
            "30 September 2020",
            "17 September 2020",
            "16 September 2020",
            "16 September 2020",
            "27 August 2020",
            "25 August 2020",
            "19 August 2020",
            "18 August 2020",
            "12 August 2020",
            "12 August 2020",
            "11 August 2020",
            "8 August 2020",
            "5 August 2020",
            "5 August 2020",
            "5 August 2020",
            "5 August 2020",
            "5 August 2020",
            "4 August 2020",
            "30 July 2020",
            "29 July 2020",
            "22 July 2020",
            "22 July 2020",
            "22 July 2020",
            "22 July 2020",
            "22 July 2020",
            "22 July 2020",
            "21 July 2020",
            "21 July 2020",
            "24 June 2020",
            "19 June 2020",
            "17 June 2020",
            "9 June 2020",
            "2 June 2020",
            "2 June 2020",
            "23 May 2020",
            "19 May 2020",
            "14 May 2020",
            "11 May 2020",
            "7 April 2020",
            "7 April 2020",
            "25 March 2020",
            "25 March 2020",
            "15 March 2020",
            "13 March 2020",
            "10 March 2020",
            "4 March 2020",
            "26 February 2020",
            "19 February 2020",
            "18 February 2020",
            "12 February 2020",
            "12 February 2020",
            "4 February 2020",
            "30 January 2020",
            "30 January 2020",
            "29 January 2020",
            "29 January 2020",
            "29 January 2020",
            "28 January 2020",
            "23 January 2020",
            "15 January 2020",
            "15 January 2020",
            "14 January 2020",
            "14 January 2020",
            "14 January 2020",
            "14 January 2020",
            "8 January 2020",
            "7 January 2020",
            "7 January 2020",
            "7 January 2020",
            "7 January 2020",
            "4 January 2020",
            "3 January 2020",
            "2 January 2020",
            "2 January 2020",
            "2 January 2020",
            "2 January 2020",
            "2 January 2020",
            "31 December 2019",
            "31 December 2019",
            "30 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "4 December 2019",
            "3 December 2019",
            "28 November 2019",
            "27 November 2019",
            "26 November 2019",
            "23 November 2019",
            "20 November 2019",
            "20 November 2019",
            "19 November 2019",
            "19 November 2019",
            "16 November 2019",
            "13 November 2019",
            "13 November 2019",
            "12 November 2019",
            "9 November 2019",
            "6 November 2019",
            "6 November 2019",
            "5 November 2019",
            "31 October 2019",
            "30 October 2019",
            "30 October 2019",
            "29 October 2019",
            "24 October 2019",
            "22 October 2019",
            "2 October 2019"
        ],
        "review_title": [
            "Great phone",
            "great battery",
            "",
            "Beautiful phone",
            "iPhone 11",
            "Amazing services! I am very pleased!!",
            "Great phone and so much more",
            "Great phone for everyone",
            "Looks fab",
            "Fabulous and excellent",
            "Outstanding phone",
            "Excellent",
            "Phone is excellent",
            "Very easy to use",
            "smart and nice",
            "My IPhone 11pro is amazing",
            "iPhone 11 Pro",
            "Phone is fabulous. What a purchase!!!",
            "My phone 11 pro looks amazing and works great",
            "",
            "The phone is perfect",
            "my phone looks great",
            "Good, but less batter life.",
            "Phone looks great and performs perfectly",
            "Best of the best",
            "Fantastically fast new I phone",
            "Amazing phone I’m loving it from every angle.",
            "So easy to set up. Just hold near to old iPhone",
            "Perfect gift for my son’s special birthday",
            "Amazing iPhone 11 Pro",
            "Favorite one",
            "Brilliant phone",
            "Excellent Iphone",
            "Great Phone",
            "Great upgrade from an iPhone7",
            "My kettle looks fab ad boils fast",
            "My kettle looks fab and build fast",
            "Great Phone",
            "Perfect for the job",
            "Amazing",
            "Fabulous and great colour!",
            "iPhone 11pro 256g",
            "Top phone",
            "Gods",
            "Excellent phone!",
            "My iPhone 11 Pro is ace",
            "Amazing",
            "",
            "There is very good fast and easy to use it",
            "Excellent phone",
            "High quality phone",
            "The phone is absolutely fab",
            "",
            "Fantastic phone, fantastic service.",
            "Excellent item",
            "Amazing phone, just does what it’s supposed to.",
            "Love it!!!",
            "IPhone 11 Pro great",
            "Excellent products no complains",
            "Takes amazing pics, battery lasts all day",
            "Great phone",
            "My Iphone",
            "My iPhone looks fab and designed great",
            "Love my new 11 pro Massive upgrade from my 7plus",
            "",
            "Great decision for the greatest product",
            "",
            "Brilliant",
            "Night shot is awesome",
            "My iPhone looks great",
            "iPhone 11 Pro does what it says on the box",
            "",
            "Apple are clearly ahead of the game.",
            "My phone is the best",
            "iPhone 11 pro",
            "Make a teenager very happy",
            "Great phone! Camera is Amazing",
            "My phone looks beautiful and I just love it",
            "iPhone 11 pro - outstanding camera",
            "Awesome colour",
            "Lot’s of features",
            "Gold iPhone 11 Pro",
            "",
            "All is wonderful",
            "No comments but so wonderful",
            "It looks nice",
            "",
            "Very good phone",
            "Good phone and good quality",
            "Amazing phone",
            "Loved my phone",
            "Couldn’t be happier",
            "Great iPhone",
            "Very good phone",
            "My iPhone 11 pro",
            "Fantastic phone",
            "Great feature to transfer data",
            "My phone is excellent and looks very nice",
            "Great price, fantastic product, happy happy happy.",
            "Perfect",
            "My iPhone 11 Pro has the best camera of them all",
            "Love this phone.",
            "Very good",
            "",
            "Excellent",
            "The phone is perfect",
            "",
            "",
            "I like my new iPhone it's-look fabulous",
            "",
            "This phone is wonderful, I love it!",
            "",
            "",
            "iPhone 11 Pro",
            "This iPhone takes amazing quality pictures.",
            "It’s the latest Apple phone",
            "The best phone made in ages",
            "Great Purchase",
            "",
            "iPhone 11 pro looks fab and cool",
            "",
            "Looks fab !",
            "Nice Nd gud",
            "Excellent update",
            "I love the new cameras and this new battery",
            "Its a brilliant phone with lovely features.",
            ""
        ],
        "review_text": [
            "Great quality phone as usual, display is brilliant, camera is also great, battery life is pretty good, bit pricey but so much more than a phone these days.",
            "I bought this item last month and I don't regret buying it. The features on this iPhone help me to take great photos and see high definition videos.",
            "The phone is amazing, very good product, plus very beautiful design",
            "I bought this phone like two weeks ago, previously i had android phone but because of the pictures of my work i had to change it. I just love this phone. The pictures are beautiful and the system is great as well. The battery is amazing to. I can recommend this for everyone",
            "Good device.\nFast processor",
            "Life savers! When you are out of phone! Fast order, fast pick up!",
            "Hvaing upgraded from an Iphone 8 this has been a huge improvement. In true Apple style the process of moving all my apps and contacts across was a breeze and I was up and running in under 20 mins. The camera is incredible for such a small peice of kit, allowing me to take some very nice shots at night. \n\nI've found the battery life to be plenty long enough for what I need. Overall very happy",
            "I love it’s design and size. Good battery life, as always easy to use. Everyday surprising me with new features. Well recommended",
            "Recommend to anyone1",
            "Fabulous good design easy to use great value and great service",
            "Brilliant phone. Great quality, camera is insane. I can even take a great picture and my camera skills are rubbish.",
            "Excellent love it. Always using iPhone",
            "Perfect design, camera quality is excellent",
            "The price matches the quality.",
            "I'm satisfied of my shopping, using with this phone is easy & comfort.",
            "Best iPhone so far. It makes me realise how good Apple products are.",
            "I ordered the phone in the late afternoon and the morning after was already available for collection. \nI recommend Argos, best price I could find for a new iPhone pro.",
            "Buying with Argos was easy and fast. Perfect transaction and the item arrived earlier than expected. So happy I choose to buy it at Argos and using Argos Card, which is even better.",
            "A great customer service and helpful. I love the phone, the camera, picture quality, design, colour, battery life and I just satisfied everything about it. I recommend this product to anyone. Argos is really reliable and one of the best.",
            "Very good phone I would recommend it the features are very good",
            "The phone is perfect it is definitely worth the money and the description matches it 110%",
            "the phone is great does everything and more",
            "Cameras are good, but it is very hot if we use mobile data, battery is not so good as expected.",
            "It is great looking, expensive but still a good price well worth it",
            "Went from 8 to 11 and I really like it. Feels faster than an already fast phone. In some apps you can really see the improved graphics even the XR's A12 would have brought, but I like the A13 processor in the iPhone 11 series for the improvements on the low power cores that it brings. My daily routine that would get me 4 and a half to five hours now only takes me down to 60% battery. The increase in RAM from my iPhone 8's 2GB to the 11's 4GB also sees fewer of my apps being closed",
            "The service was amazing , got it the next day . The camera quality is amazing as well as battery that lasts me days . Great purchase",
            "Ordered my new phone 11 pro \nFrom Argos, very good and fast service from Argos as always.\nAlways love shopping from Argos it’s very easy simple and hassle free.",
            "Lovely phone to handle and easy to transfer data from my old iPhone. The colour is more like grey than green.",
            "My son had been moaning about his,old phone for ages so it was the perfect gift for his special birthday. Argos had the exact model he had been looking at. It was very easy to place the order and it was delivered on the day and time I had requested. Excellent service",
            "The iPhone 11 Pro is by far the best iPhone I have ever owned. Highly recommended !",
            "Favorite phone i ever had",
            "All round top quality phone, excellent camera and features.",
            "Excellent product. Looks sleak & arrived on time",
            "This is a great phone, especially the camera and portrait function. Battery lasts all day which is great you don't have to carry a charger or battery block.",
            "This was an upgrade from an iPhone 7. The battery life is so much better and has been lasting around 1.5 days with moderate use. The camera takes really nice photos with great depth to the images. Love the Face ID and Apple Pay is great. \nThe phone is quite a bit heavier than an iPhone 7 probably due to the much improved battery life.",
            "Hopefully this will stop the spam from Argos now",
            "Am I getting paid for doing this?",
            "It is a great phone and the camera is as good as a professional camera. Argos sold it at a great price too!",
            "It is as the reviews say. I have had quite a few iPhones over time as well as Galaxies but this is the best one yet.",
            "Best price\nQuick delivery",
            "Very easy to order and super fast delivery",
            "Well happy what more can I say",
            "Upgraded from a 7, no issues so far. Only worth paying if you want a good camera",
            "God fast esy frendli",
            "Purchased this as an upgrade to my iPhone 7.\n\nVery fast, excellent screen and general build quality, as you'd expect from an Apple product and for the price. \n\nThe camera on this is exceptional, its actually better than my actual camera - only difference is my actual camera has better quality over a greater zoom distance - but thats as you would expect. \n\nCame with a fast charger, which charges the phone a lot quicker than standard, and the battery life lasts well to!",
            "My iPhone 11 Pro is great. It’s easy to use, face recognition allows easy access and allows me to conveniently pay with Apple Pay.",
            "Best phone... loved it",
            "Good design\nGood camera",
            "Nothing bad , everything like i was expect from it , is brilliant thanks",
            "Amazing product, excellent customer service. Would recommend.",
            "As expected amazing phone!",
            "The phone is absolutely brilliant the camera is great",
            "Perfect, working like Robots .",
            "Great phone. Amazing camera - so glad I went for this model. \n\nHave to also comment that the service in Argos was AMAZING. My first phone had a fault and they exchanged no problem. Will use Argos again for sure",
            "Excellent bit of kit",
            "Product was brilliant, must have been an off morning for the lady behind the counter.",
            "As always a fantastic Apple product. Easy to use, battery life much improved. Service from Argos was fantastic.",
            "The iPhone battery life, design and colour is great",
            "I am using iPhone for 20 years have no problem with any product is best",
            "I really like the phone. My previous device got snatched out of my hand by a man on a bicycle, so I had a range of options given by my insurers. I went for an exact replacement as the 11 Pro fully meets my needs - super fast, truly amazing photos & videos, battery lasts a full day easily.\n\nMy insurers sent me to Argos - not a choice I would make in the future following the abysmal experience I had - limited store stock in faraway stores, no home delivery, archaic nonsense collection process.",
            "Incredible camera & great battery life",
            "Just upgraded from Iphone 6 which I bought it 5 years ago. The best Iphone I ever had. Battery life is very good just charging it every 2 days and very fast. I love it. Will recommend to everyone. I like the design and the features.",
            "Easy service \nThanks Argos a lot",
            "Really do love this phone. The camera is the reason I brought this to take lots of pictures of my daughter ❤️  \nFound myself taking lots of pictures now. Great memories. \nGood solid build great screen. \nNice to have a smaller phone and not loose and screen size from the 7 plus.",
            "because it came with a problem and it was not solved",
            "Amazing product  and price, Argos is fantastic with its Argos card .",
            "Very good, works well good quality.",
            "Upgrading from a 5c, a bit like going from old black and white telly to flatscreen HD",
            "New cameras and night mode are fantastic. \n\nBattery life is much improved too.",
            "My iPhone looks great. And it takes great images and it’s one of the best iPhones I’ve ever had and very easy to use.",
            "Very good just think it’s a bit expensive",
            "I am happy with the product",
            "Apple are still ahead of the game when it comes to mobile phones.",
            "Excellent phone recommended",
            "Great new model iPhone the cameras are pretty impressive and the new midnight green colour is cool\nExpensive phone but if your an iPhone fan like me then it’s a must have treat",
            "Lovely phone, really easy to use and loads of features",
            "Really happy with the phone absolutely nothing I don’t like. The camera is amazing.",
            "I love everything about my phone and I would definitely recommend it and with argos buy now pay later makes it more easier for me overall am happy with my iPhone",
            "The triple lens camera and features on this latest model are great!  A few innovations like face recognition make it even better to use",
            "Love the midnight green, it’s subtle and more like a grey. As for everything else, it’s an iPhone, it’s quicker than my previous but everything else is just the same as what you would expect from an iPhone!",
            "Definitely recommend",
            "Improved battery life and cameras and speed of functions are all great additions. Comes with faster charger to .",
            "Good price and good product. Quick delivery.",
            "Hi wonderful Phone the best for 2020",
            "Happy happy happy so good phone love it so much",
            "I love shop from you.\nAlso get buy now,pay later option.\nIts wonderful.\nAfter that i have also tell to my friends\nHe also have buy the same device from argos store",
            "Nice phone, very confortable in hand, premium quality.",
            "Triple cameras on the back with 256gb of memory and better quality of the pictures, with better processors, make the IPhone 11 Pro one of the best phone on the market.",
            "Have had the phone for almost a week, can say it is perfect just as described.",
            "The iPhone pro was bought for Christmas for my daughter from her uncle. She was over the moon with her present and loves everything about her new phone. I would recommend the iPhone pro over the pro max as the size is just right for holding. The pro max is more of a small tablet size, so not so good for putting in your pocket.",
            "I bought the iPhone 11 the phones brill at but I wish I had bought the pro Max instead however I’m still really happy to have purchased it",
            "Best phone about at the moment",
            "Coming from an iPhone 7 it was a big jump. Great build quality and design. The two stand out features for me are the cameras and battery life. Charging it to 100% on Tuesday evening and with regular usage by Thursday evening I had 51% left on my battery.",
            "If you are upgrading from an older phone like the 5SE or the 6 (which was the case for me)  it is worth the money spent. The cameras take amazing photos and the software stabilisation is excellent. Don’t go, if you can, for the 64GB version - 256 GB are required if you want to use the full potential of photo and video department because high resolution can take several hundreds of GigaBytes. Fast and secure 3D, large and amazing screen and much more make this phone great.",
            "Midnight green 256gb iPhone - Wow, superb. Amazing, super fast and all features and design easy to use, top iphone\n\nTop iPhone and rather keep this than my wife",
            "Best iPhone yet by far",
            "Looks good and love the feature to transfer data from the old to new phone without having to use iTunes. Little bit bigger than my last one but getting used to it.",
            "iPhone 11 Pro is nice and designed is excellent",
            "Class leading product, superbly made giving fantastic photographs.",
            "Best camera on an iphone or any phone iv had in the past battery last all day and more",
            "The battery is very good as before the camera is the best",
            "Waited until my last phone was on its last legs before investing in a new one. Wish I had gone for it sooner. The camera is excellent. The face recognition makes it very easy to use. Love it.",
            "Very nice and good size very comfortable very comfortably phone I love the phone",
            "We all know that when it comes to value for money Apple are not the ones to deliver that.  But it does have their ineffable design and charisma.  Incidentally my promised nectar points have not appeared , not sure whether to point the finger of blame at nectar or Argos for that.",
            "The 11 Pro is a perfect pocket sized powerhouse. The new camera features are outstanding, and so far at least, the advertised boost in battery life over previous iPhone models is noticeable .",
            "However the product that I bought was mis selected but the customer service was very helpful and changed it for me",
            "Fantastic product , i’ Very happy",
            "Very happy with service x",
            "Long time I am dreaming for this iPhone and my dream come true.its make fabulous pictures and videos,very quick and easy working for",
            "No problems so far with this product",
            "Currently this phone is ok, I have a great price but I hope it is worth promoting",
            "Now I understand when in some cases,emerald can be worth more than diamonds\nIt is a most beautiful color that I saw before!!!",
            "Very happy with my purchase.",
            "Great phone would totally recommend",
            "I’m very happy with this purchase, the battery lasts me the all day, and it takes amazing pictures. \nI’m glad I decided to buy it.\nThe staff at Argos was fast and friendly.",
            "Amazing new phone it’s Apple so amazing quality from a premium brand , if you want a phone that works chose Apple",
            "I’m very happy with this phone, it’s features and the battery life is unreal! The quality of pictures are amazing! Best purchase.",
            "Best phone i have ever had in terms of design and features.",
            "I love it and I wish I bought it sooner",
            "The best feature of this phone is the camera which is absolutely stunning! really perfect Is abolutly amazing. Evrething is very nice a beautiful camera and battery long last life.",
            "The best feature of this phone is the camera which is absolutely stunning! The battery lasts for over 2 full days.",
            "I really recommend the phone !",
            "Very easy to use . Nd battery life really gud for now .",
            "The iPhone 11 pro is an excellent update to an already brilliant phone. At first I wasn’t sure on the look, with the 3 camera lenses, but I must say it’s grown on me and I now find it to be a very good looking phone.\n\nThe quality of the cameras is excellent for a mobile phone. Also the battery life is much improved and definitely noticeable. With my normal average use I’ve found I can get 2 days use from a full charge - which was unheard of on my previous iPhone!",
            "Best phone , i love the new cameras and how fast it is",
            "It comes with a very nice camera clarity. Features are lovely. Brilliant phone. Loved it.",
            "Best Buy!! Looks and feels great. And performance is unbeatable. :)"
        ]
    }
}