{
    "918/3162": {
        "remotekey": [
            "918/3162"
        ],
        "item_category": [
            "Have an epic visual experience with the ultimate AI quad-cam & Vast Display with the Alcatel 3X. Capture the full detail of your experiences with a 16MP AI quad-camera with a 5MP wide-angle lens and 2MP macro and depth lenses. View the content that captivates you on the immersive 6.52-inch HD+ Vast Display with liquid-smooth 2.5D glass. Fluid-fast performance and a 5000mAh battery lets you enjoy HD streaming, gaming and more for longer and smoother. Super-cool design with dual-sided glass polish that complements any look. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "36 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "19 May 2021",
            "21 April 2021",
            "8 April 2021",
            "8 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "1 April 2021",
            "31 March 2021",
            "26 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "16 March 2021",
            "27 January 2021",
            "14 January 2021",
            "5 January 2021",
            "2 January 2021",
            "17 November 2020",
            "4 November 2020",
            "3 November 2020",
            "22 October 2020",
            "21 October 2020",
            "20 October 2020",
            "20 October 2020",
            "14 October 2020",
            "13 October 2020",
            "8 October 2020",
            "7 October 2020",
            "6 October 2020",
            "30 September 2020",
            "30 September 2020",
            "15 September 2020",
            "9 September 2020",
            "29 August 2020",
            "18 August 2020"
        ],
        "review_title": [
            "Slot of phone",
            "Treated myself to this mobile",
            "Neat not to heavy mobile",
            "The phone is not heavy and works fast",
            "Great budget phone",
            "sim free phone",
            "The phone is excellent and does all its said to do",
            "Even better than I thought.  Really good pics.",
            "Excellent phone",
            "Great phone for the price",
            "Great phone",
            "Brilliant",
            "This phone is worth the money,easy to set up.",
            "Alcatel 3x",
            "Phone is brilliant",
            "Phone came in with protection, not too heavy, look",
            "Phone is very good",
            "The phone is ok.",
            "Genuinely top class smartphone.",
            "Excellent",
            "",
            "Fantastic Phone Alcatel 3X",
            "Great phone for money and takes good photos",
            "Great phone rubbish charger",
            "The Alcatel 3x 2020",
            "Excellent phone + brilliant battery life",
            "Great phone",
            "My new phone Alcatel 3X black worth for money",
            "Best phone ive had",
            "My new phone is really stylish and battery lasts l",
            "Nice looking phone",
            "Works well !",
            "My Alcatel phone is fab. Definitely worth the  mon",
            "My mobile looks good and performs well.",
            "Great value for money",
            "My  Alcatel 3X 64GB Mobile Phone - Black"
        ],
        "review_text": [
            "Slot of phone for the money.",
            "The SIM Free Alcatel 3X 64GB Mobile Phone is a `very good quality mobile and very fast as well, lots of options to use WiFi, Bluetooth, and a socket for what you want also has a speaker option. Well recommended, comes with a soft cover for the lower part of the phone (Back) area, nice touch.",
            "Easy to use mobile, great features and good value in money",
            "The phone design is similar to the new expensive models, is quite light and is working fast,no lag.",
            "Great budget phone does all I need it to do at a cheap price thanks Argos being SIM free is an added bonus as well.",
            "good sim free phone very slim and light does everthing needed .battery is not brilliant but if you light user on calls works well",
            "I needed a phone to accommodate my two lines and with large memory space, both I got in this Alcatel 3X and more. It's so sleek.",
            "Really good price brill phone love it my pics are so good and the screen is massive .",
            "Good value phone with great battery life. Cameras are brilliant, especially having AI",
            "Love this phone Super fast and amazing battery life",
            "Good phone. Easy to use but not as easy as an I phone. Bought as a spare phone. Does what it says on the tin",
            "It's a all round brilliant smart phone. Haven't got one fault. Went out and brought my son one too!",
            "Great purchase\nLight weight \nGood camera \nEasy set up \nSim free",
            "really fast phone, long battery life, impressed so far with the overall operation",
            "Brilliant phone highly recommend battery life is brilliant and love the camara plus it's not to pricey",
            "Setting everything up with the old phone was easy. Very good phone. Battery is ok",
            "The phone is very reliable and battery lasts long I'm very happy with my phone wish I bought it earlier",
            "I didn't found earphone in the box this item does have?",
            "Absolutely top class phone that is genuinely great value. Exceptional camera, \npreloaded with tons of apps. If you're used to Android it's s doddle to use. Multiple security options. Massive HD+ screen that I can see without my reading glasses. Comes with a silicone case in the box. Honestly pleased as punch I bought this.",
            "Excellent I bought to my kid birthday gift",
            "The phone seems great and really pleased that I was able to secure this phone at a great price given that it benefits from the latest operating system.",
            "This is my first android phone. \nIn a word an amazing phone Alcatel 3x.\nJust love it, cause all in one phone. \nBest for the price, \nVery faster with \n4GB RAM.",
            "Wood definitely say worth its money and have purchased second phone.",
            "Phone is faultless for the price, charger shorted out after three weeks.",
            "The Alcatel 3x exceeds all my expectations",
            "Brilliant phone great value! Can easily last me 2 days on battery even with quite a lot of usage :) the camera is amazing too.\nNice little surprise of a jelly case in the box that wasn't listed on the website :) overall 10/10!",
            "Great phone.... Love the fact that I can use face recognition instead of pin. Good storage space. Quite fast for most things, the odd game gets a bit laggy, but it's not really a gaming phone... So that's OK. I've tested it out with loads of games and 99% work great. Screen size is big enough to use for games and video, but not so much that it feels bulky.",
            "5stars for this product",
            "Its the best mobile ive ever had and the price was very low alcatel phones are as good as top range phones anyday",
            "Extremely good to be that price",
            "Great phone,large letters/numbers.\nEasy to use,sits well in hand whilst using",
            "Available to collect when promised. This phone has Android version 10, which is good ! (watch out that some retailers are selling this same phone with Android version 9). Happy with the performance so far. The battery life is great !",
            "I am going to buy this for my husband too. Always bought iPhones but honestly this is just as good and for the price and has loads of features.",
            "I would highly recommend this phone. It’s preform very well.",
            "High performance compared to the price",
            "It is a good phone for the price. Overall great performance and battery storage on the phone I have."
        ]
    }
}