{
    "879/0099": {
        "remotekey": [
            "879/0099"
        ],
        "item_category": [
            "The New HUAWEI P30 Pro rewrites the rules of photography: the Leica quad camera and the latest light fusion technology create breathtaking photos, with picture perfect light and definition, in extreme low light and night time conditions. The P30 Pro's 50x telephoto zoom breaks the boundaries of telephoto photography, enabling you to capture real detail. Great for taking wildlife and sporting photos from a distance. And the 32MP (f/2.0 aperture) front facing camera enables you to take super HDR selfies. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "126 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "98%"
        ],
        "review_rating": [
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "8 June 2021",
            "21 April 2021",
            "25 March 2021",
            "24 March 2021",
            "23 March 2021",
            "9 March 2021",
            "24 February 2021",
            "24 February 2021",
            "9 February 2021",
            "3 February 2021",
            "3 February 2021",
            "2 February 2021",
            "26 January 2021",
            "19 January 2021",
            "14 January 2021",
            "31 December 2020",
            "31 December 2020",
            "4 December 2020",
            "2 December 2020",
            "11 November 2020",
            "27 October 2020",
            "14 October 2020",
            "7 October 2020",
            "23 September 2020",
            "16 September 2020",
            "16 September 2020",
            "15 September 2020",
            "9 September 2020",
            "8 September 2020",
            "12 August 2020",
            "6 August 2020",
            "8 July 2020",
            "7 July 2020",
            "1 July 2020",
            "27 June 2020",
            "24 June 2020",
            "23 June 2020",
            "17 June 2020",
            "16 June 2020",
            "16 June 2020",
            "11 June 2020",
            "7 June 2020",
            "3 June 2020",
            "2 June 2020",
            "1 June 2020",
            "29 May 2020",
            "27 May 2020",
            "20 May 2020",
            "20 May 2020",
            "20 May 2020",
            "19 May 2020",
            "13 May 2020",
            "8 May 2020",
            "8 May 2020",
            "6 May 2020",
            "15 April 2020",
            "15 April 2020",
            "8 April 2020",
            "26 March 2020",
            "25 March 2020",
            "24 March 2020",
            "18 March 2020",
            "18 March 2020",
            "18 March 2020",
            "18 March 2020",
            "17 March 2020",
            "4 March 2020",
            "4 March 2020",
            "27 February 2020",
            "26 February 2020",
            "26 February 2020",
            "25 February 2020",
            "18 February 2020",
            "7 February 2020",
            "5 February 2020",
            "29 January 2020",
            "28 January 2020",
            "22 January 2020",
            "15 January 2020",
            "9 January 2020",
            "8 January 2020",
            "2 January 2020",
            "2 January 2020",
            "2 January 2020",
            "31 December 2019",
            "31 December 2019",
            "30 December 2019",
            "29 December 2019",
            "28 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 November 2019",
            "20 November 2019",
            "12 November 2019",
            "28 October 2019",
            "24 October 2019",
            "22 October 2019",
            "9 October 2019",
            "8 October 2019",
            "25 September 2019",
            "11 September 2019",
            "28 August 2019",
            "20 August 2019",
            "16 August 2019",
            "13 August 2019",
            "7 August 2019",
            "6 August 2019",
            "1 August 2019",
            "31 July 2019",
            "23 July 2019",
            "17 July 2019",
            "16 July 2019",
            "30 May 2019"
        ],
        "review_title": [
            "Does everything",
            "Excellent mobile",
            "Phone faulty",
            "Really a nice thing",
            "Looks fab",
            "Fantastic",
            "Very good",
            "I bought 2 phones Huawei P30 Pro",
            "Good",
            "good buy",
            "New phone looks good and works great.",
            "Great Phone",
            "p30",
            "",
            "Excellent looks",
            "Fabulous phone",
            "Great, lovely phone but...",
            "Looks fab",
            "Happy with my new phone",
            "The phone works really well! I love it!",
            "Amazing works good photo Amazing",
            "Nice",
            "Fantastic phone,takes great photos,easy to set up",
            "Top Spec Smartphone",
            "For my wife",
            "Incredible!",
            "Amazing high end phone",
            "Phone looks fabulous",
            "Profile transfer from old Samsung was seamless",
            "It looks nice",
            "Huawei p30 Pro",
            "The best",
            "Excellent",
            "Lived up to my expectations",
            "Superb battery and camera",
            "Fab Phone",
            "Takes shiny and new to a new level",
            "Excellent Camera and battery life",
            "Great phone",
            "",
            "Best phone ever.",
            "An amazing phone with a great battery life",
            "My phone is amazing",
            "Fabulous phone",
            "Excellent phone!",
            "Nice",
            "The phone is very flash love it",
            "Nice phone I’ve ever had I my life, fast charger",
            "The smartphone which I wish",
            "Recommended",
            "Fantastic phone",
            "Performance and looks, this phone has it all.",
            "Hauweii pro 30",
            "The best",
            "Bateri life is perfect",
            "It's the best phone ever",
            "This phone is amazing camera straordinary",
            "",
            "The phone is amazing",
            "Great phone with good camera",
            "Very pleased with phone",
            "Amazing Camera",
            "My phone is amazing!!",
            "Fabulous phone and great deal",
            "Best phone I've ever owned",
            "Great phone developed with sence for detail",
            "The battery life",
            "Nice",
            "Love the phone.",
            "Very nice look good to",
            "Easy to use",
            "Brilliant Phone",
            "",
            "Great phone",
            "The student has surpassed the Master",
            "Quick Charge",
            "Amazing phone",
            "Good phone I like it",
            "The phone is very good",
            "Battery/camera",
            "Great Phone must buy",
            "May Phone îs amazing",
            "Quality",
            "Was very fast",
            "I love my new Huawei P30 pro.",
            "Fab",
            "Great phone and great price",
            "Charges fast and has a long battery life also the",
            "Huawei does not disappoint!",
            "Great deal!",
            "Great phone",
            "Huawei Pro P30",
            "The best phone what i have",
            "Phones looks good",
            "camera is great, the night time mode is excellent",
            "Great phone moved from iPhone should have done it",
            "Fantastic phone",
            "Chrusmass present - best mobile",
            "",
            "The phone has a very good camera and long batteryl",
            "",
            "Fantastic phone, great camera and battery life",
            "It was a phone bought for myriend but she seems it",
            "HUAWEI good investment",
            "Phone look fabulous",
            "Photos looks amazing",
            "Best phone so far...  Briliant photo quality...",
            "bets phone",
            "Best phone till date",
            "GOOD LOOKING",
            "Good",
            "The best phone in my opinion",
            "Huawei p30 pro excellent phone couldn't be happier",
            "Competitive price, fantastic camera, super battery",
            "",
            "Looks fab and have an amazing camera",
            "Great phone",
            "Amazing phone, I love it!",
            "",
            "Really good camera",
            "",
            "New phone",
            "",
            "Amazing phone , battey lasts long",
            "Excellent phone",
            "Brilliant!"
        ],
        "review_text": [
            "Bought this for a friend who loved the model and wanted a spare as newer models have been barred from using Google.",
            "I bought this for my daughter, she loves it, great phone couldn't fault it. I love it too waiting on Argos getting them in again , so I can buy another for myself, thank you Argos. Hurry Argos get more in please.",
            "Cost over £500 and had to return it because it was faulty. Battery wouldn’t charge at all. In fact it was a load of rubbish! Cheap and tacky. Oh well , back to my iPhone !",
            "My first impression when I opened a box was: wow, it is too big. But after a week of using it became OK and comfortable. Let me point the really important things:\n\n-It is amazingly fast, smooth animations etc. I can not even look at my old phone now. Just gorgeous.\n-Screen resolution could be higher comparing to iPhoneX and even my old Sony Experia Z. Some jitter when scrolling is also annoying.\n-Camera is good in zoom (separate wide anglular + good zoom), but in terms of color can be better",
            "Easy to use got everything you need",
            "Love it can't fault it if only all Huawei mobile was like it .more productions please Argos",
            "Super very nice batariy good",
            "I bought from Argos 2 phones Huawei P30 Pro and they are amazing xx\nThe price is worth it and Argos can give you a lot of opportunity to make the payment easier for you.\nI recommend Argos 5 stars+",
            "The huawei p30 pro it very fast and very good",
            "Excellent phone. So pleased. Bought as surprise for wife. Great.",
            "So far so good, nice phone and it works.",
            "This is my 2nd Huawei P30Pro.\nGreat Spec and looks really nice too",
            "the battery life is the best and the camera is superb",
            "Great all functions.",
            "Very good phone....stunning looks, hardware is good... Easy to use..",
            "It's fast, battery lasts long and charge quick.\nAmazing",
            "This is a really good phone. I have bought it for my wife and she is so happy. She had Samsung Galaxy S7 before and she said Huawei P30 Pro is much better then Samsung. The only one thing is driving us crazy... Her new phone is talking in chinese (?) every time when she received a WhatsApp message! Even when she silence her phone! Tried to change it in settings, but we couldn't.",
            "Looks fab ..........",
            "It met my expectations, camera is perfect.",
            "The phone looks great and the price was good.\nI really like it and I will recommend it to my friends!",
            "Į love it photo very good batery for 2 days. Į love it",
            "Very nice phone camera is the best",
            "Fantastic phone, easy to use, good battery life, brilliant photo quality",
            "Love this phone, Excellent quality and great camera.",
            "It was a gift for my wife and she’s very happy with her huawei",
            "I am still in awe at the Features of this Phone. The Battery easily lasts Two Days on a Single Charge, and the Camera is to die for... Especially the Night Shots.\n\nThe P30 Pro is Fast and Lightweight, with s Large Suite of Sensors. Argos also kindly gave After Sales tech support, so one needs not worry about anything",
            "Brought this phone to replace my honor play that I got a year a year ago, the photos from this phone are amazing and battery life is incredible for a top tier phone.\n\nThis is the last one to have access to Google apps for now, and this was the reason why I went for the p30 pro",
            "I really happy about my new phone\nCamera is good quality \nBattery life is very long",
            "Profiles & data transfer from old Samsung was seamless, achieved by wif-fi putting phones next to one another. Very slinky phone, excited about the camera. Not sure about the position with the Google Playstore Apps but will find out no doubt. Loads of features. Early days.",
            "Very good product and nice",
            "I love this handset.\n\nBuild quality is great. \nExpandable memory. \nLovely screen. \nOnly one speaker, but it is loud, and I always use Bluetooth headphones anyway.",
            "It's a very good phone",
            "Fantastic phone for the money I couldn't be happier with my purchase",
            "After extensive research I opted for the Huawei P30 Pro after years of using Samsung phones. I am extremely impressed with everything.  The camera quality far exceeds the Samsung S10. The phone is very fast and call quality is brilliant.",
            "I decided to replace my Samsung S7 edge with the Huawei mainly on the strength of the camera. I was not disappointed the camera is stunning.  Battery life is extremely good too. Currently lasts for two days between charges.  I'm not 100% sure about Huawei's user interface but it's Android so you expect differences between manufacturers.  Fingerprint security and face unlock is fast and accurate.",
            "Does everything I want and more, crazy cool features, sick camera, battery life for days and looks really slick.",
            "The style of the phone is nice, not sure what the curved screen is achieving, makes screen covers less convenient.\nThe camera is great and actually the main reason I went for this model so not disappointed at all.\nThe phone is SO slippy! In pockets, on surfaces etc. P20 Pro came with a cover & a screen cover on it & this came with neither.\nRuns smoother than P20 Pro and still is supportee by Google unlike P40.",
            "The main reason for this phone being great is the camera. It really is that good. 50x zoom that's actually clearer than an S10 at 8x zoom. Pictures in virtually no light that appear with colour as if it was daytime. 128gb is a brilliant amount of storage. The rest of the phone however is basically the same as the mate 20 pro. Same cpu, same screen, same storage, both have reverse wireless charging, in display fingerprint and wide angle lens. \nBattery life is incredible as ever.",
            "Wanted a good camera phone for wildlife and have not had it long enough to test its capabilities, but the battery life is excellent and all the functions seem to be responsive and operate smoothly. I am not too worried about looks and have it in a waterproof defender case. There are virtually no instructions other than charging, so you will have to go online to work out the features.",
            "My wife has one for one year and is very good .\ngood batery. nice pictures",
            "I used P20 PRO before. This phone is just incredible. Battery life is amazing,usually last 2 days.",
            "I love it from the moment I opened the box, this amazing colour, crystal, just wow. Coming from Samsung my whole life I was a little bit afraid if it was a good decision to change and literally I couldn't make a better choice. Setting up was easy, the camera is brilliant and battery life amazing. Has many cool features that probably never ever I will use, but who knows maybe one day I will need them and they are there.The charging time is very good. So happy with my phone. Baby",
            "Ok so I have had the phone a little while and I love the colour of it. The battery life it really good it is quick and easy to get started. Is a good phone would definetly recommend to a friend.",
            "This is by far the best phone I've had, camera is amazing with so many features, battery life is fab, and it's got wireless charging capability too so glad I stuck to Huawei brand I would definitely recommend it.",
            "Absolutely would recommend this phone battery life is great, easy to use, fantastic camera with many fab setting to create a magnitude of really pretty images. Collected the next day in store.",
            "Very nice and fantastic phone",
            "First time use Huawei phones not used to it yet but loving it ,planty of future and mentioned the battery last over 2 days and also different to lot of others",
            "Good quality . Great price. The Features are great especially the camera I love it. I Recommend it. Its worth to buy.",
            "It is the best smartphone",
            "Good quality I am satisfied.",
            "Very happy with the purchase, very happy with the quality of the photos and very happy about the battery life!\nThank you!",
            "What a fantastic upgrade, seamless performance, looks and feels great, and an out of this world camera! Defo recommended to anyone who wants an outstanding mobile phone!... Upgraded to this flagship from Samsung S.",
            "Was always an apple girl, but needed a change, photo's to me where never great , heard about this & thought I would give it a go. I can honestly say I have not been disappointed, crystal clear screen , great battery life , & razor sharp photos . Plus I paid some of the phone with my nectar points , which brought the price down by £50 , Love it",
            "Good quality and price",
            "It's bateri life is amazing. Really long.",
            "The price is fine, the quality is the best of this product.",
            "Bought this phone a month ago best option ever made",
            "This phone is a wonder....Worth the money",
            "The phone is absolutely amazing. I am really happy of my choice. The delivery was at time.",
            "Great phone, with UI that made transition from iOS to Android easy.",
            "Very easy to use, very responsive, good battery life, excellent photos, comfortable to hold",
            "I am so impressed by this phone. It takes amazing photos and the screen is incredible too. Excellent value.",
            "It is an amazing product and the extra fast charging cable is extremely beneficial and useful. The camera is exceptional and the 128gb storage is plentiful. The display is crisp and sharp and I've got no complaints at all. Huawei are stepping up their game.",
            "Great and stylish phone, good value and good offer. Would recommend",
            "By far the best phone I've ever owened - the camera alone is brilliant! Love rubbing it in the face of apple users",
            "Bought it mainly for my business as a work presentation tool and this is exactly what i have been looking for. Camera is great! Can use my photos straightaway without any modification",
            "The battery of this mobile last 24 hours or more amazing. And tne picture quality outstanding.",
            "Nice..............:)",
            "Love the colour. The phone is easy to use. The battery is great just wish it the battery ran out little slower. I'm very pleased with the camera. I went from a iPhone to this and so happy that I've gone to android.",
            "Good price would recommend",
            "No dos and don'ts straight up does what it states it should do",
            "Very Happy with my purchase and the service I received at Holborn Argos!!",
            "Great phone, after always using a competitors phone, I have to say it is fantastic and would recommend to anyone.",
            "Purchased a P30 Pro when I damaged my mate 20 pro, not dissatisfied in anyway, so good value and an upgrade on the mate 20 pro",
            "Chinese manufacturer with impeccable quality and design. Yes they are standing on the shoulders of giants without a doubt. It does not take a genius to note that that the design steals from Samsung, however the back of the phone with it's ultimate AI Camera the phone still becomes its own name and overall design. Great for digital artists and photos. \nVerdict: Once upon a time the West provided blueprints to the east, quality and design while China copied. Huawei is top quality Chinese Made",
            "Sim Free reasonable Price",
            "Best phone I haver had. I was an iphone user for long years but this is by far the best camera I ever seen. The zooming out is amazing.",
            "I like Good phone new phone more gp",
            "Argos services are good.",
            "Great camera's which is what I was looking for very user friendly. Charging battery takes very little time. Very sleek design",
            "I wanted a phone that delivered excellent photos and had a good battery\nI didn't want to carry a camera & my phone whilst on holiday etc & I was always charging my battery because it went flat so quickly.\nThis is the best phone / camera I've ever owned 128gb internal memory & it also accepts SD/Micro cards\nThe Snaps are truly amazing quality & Super-fast charging fully charges in 30 mins\nGoogle play store works perfectly fine\nYou will not be disappointed",
            "IT îs amazing. Bateri live woow",
            "Perfect phone, good battery perfect camera!",
            "Good price,they send it very fast..thank you!",
            "This phone is amazing. The camera is better than the one on the iPhone 11 max which I have. I like the Android running system too. Would definitely recommend it.",
            "An amazing phone.  Very fast.  Great",
            "Had the p30 pro upgraded to the p30 pro\nLove this phone. \nHad a good price too.",
            "Don't buy it straight wait for it be on sale",
            "I decided to purchase new huwaei due to camera potencial and im not disappointed. Quality of pictures is amazing, there are enough options to substitute reflex camera, additionally design is absolutely fabulous, so is battery life. Overall Im recommending",
            "The phone is a great deal. It comes with competitive features and reasonable price. It works perfectly, from the biometric features detections, internet exploring, multimedia and camera features. I really like it and I am thinking of “updating” my other phone to Huawei from Argos.",
            "The phone is really good, it was a present for my husband. I just thought the zoom in the camera would be better, as I found it to grainy in low light conditions...",
            "Good clear LED screen and cameras, long battery life quick response to apps",
            "I have before P20 Pro and is the best phone what i have, after 1.5year still battery work 2days, this P30 Pro is update with big step and working perfect, camera 5stars, battery as well.\nCamera from that phone is the best from all phone in 2019",
            "Give it to my bf for as he loves it pictures are amazing phone is great",
            "What a great phone, its got top end spec and deserves its accolades. Simple get the Huawei watch to go with it. I did and have no regrets",
            "Great phone, reserved on line and collected same day",
            "My son loves his new phone so much. I was worried about him moving to an android phone from an IOS but this phone is so easy to use. It has a lot of fantastic features that my son keeps talking about.",
            "It was a Christmass gift for my Mrs. She love the colour and design also she go to huawei p30 pro from samsung s8+ and was no problem at all to start use it and get familiar with new new one. Battery last for 2 days, perfect photos, easy to use... 100% recomend this mobile to everyone",
            "Most beautiful mobile I've ever had",
            "The phone is light and has a long battery life. The camera is very good takes great photos",
            "Good gift for me thank you",
            "Bought this phone as a Christmas gift, the receiver was over the moon, great battery life and a fantastic camera among many more! Service was top class from Argos! Thanks a million!",
            "Good, my friend is pleased with it",
            "Great phone very big and slippery silky smooth back would recommend buying waterproof protector. The camera is ace and on point would definitely recommend",
            "Excellent phone battery time excellent",
            "For the price you will not finde better phone compering to iPhone 11 Pro max or Samsung s10 plus",
            "Highly recomend!\nBest photos ever from all phones I had before....",
            "recomendet best phone best photos",
            "Super battery lasts easily through the day. Nice fit in the hand and most importantly the camera its just wow.. Worth the buy.. Will not disappoint.",
            "WHEN SWITCHING FROM SILENT TO SOUND need to scroll the control up or it will still \nbe  on silent and calls will be missed",
            "Fast purchase, perfect employee",
            "Fast, amazing battery, beautiful display",
            "I have no negatives to say about this phone. The huawei p30 pro is an excellent phone sharp camera fast charging excellent battery life, a must have for huawei lovers or if want an amazing phone",
            "I've read a lot about this phone before my purchase, my main reason for purchasing was the amazing battery life and fantastic camera. This product has met all my expectations and more. I've always been lucky enough to have top branded smartphones but the P30 pro has to be the best so far.",
            "I\"m happy now but this phone\nVery good use to phone \nThanks huawei",
            "Amzing camera\nVery good battery \nNice design",
            "Amazingly fast, nice step up from the note 8, both are great phones but the huawei is a great all rounder. The note does have a better screen but it becomes less noticeable when you're not looking for the difference in resolution.",
            "Perfect camera, takes perfect photos. Battery life seems very good. Fast charging and a lot more. I am still don't know most of the things still learning but I'm in love with it.",
            "Very satisfied, I recommend that",
            "I used so many phones I can honestly say Huawei made the best phones from the market, best cameras, best battery life, best optimisation on software. All the phones are good this days and non of them are perfect but Huawei are the best out there, and the pictures are just unbelievable.",
            "5 Star product, long lasting battery and amazing camera quality",
            "Crystal clear screen, quick processor. Better than expensive rivals.",
            "Best camera and battery smartphone.",
            "Amazing device and  camera.\nMuch better than Samsung :)\nBattery  last longer and charge faster\nMenu easy to scroll, kinda like apple but better. \nNo crashers.",
            "Excellent camera\nSuper fast charging \nOutstanding battery life \nLooks fab",
            "I'm really pleased with the phone! Great interface, display and camera."
        ]
    }
}