{
    "851/7540": {
        "remotekey": [
            "851/7540"
        ],
        "item_category": [
            "Real-time Eye AF for humans and animals, plus more innovative technology from Alpha cameras. Game enhancer, ultra-fast performance, a 120Hz refresh rate display and a 240Hz touch scanning rate The perfect size to fit in your hand or pocket yet packed with the very latest Sony technology. 21:9 CinemaWide FHD+ and HDR OLED display with leading colour accuracy. Qualcomm Snapdragon 865 5G Mobile Platform and reliable 4,000mAh battery. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "14 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "93%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "19 May 2021",
            "27 April 2021",
            "14 April 2021",
            "17 March 2021",
            "3 March 2021",
            "20 January 2021",
            "13 January 2021",
            "1 January 2021",
            "25 October 2020",
            "16 October 2020",
            "16 October 2020",
            "15 October 2020",
            "12 October 2020",
            "12 October 2020"
        ],
        "review_title": [
            "So easy to use",
            "My phone is brilliant",
            "Phone is great",
            "A very good phone with a nice quality camera.",
            "Great display",
            "Great Phone",
            "Amazing and superb",
            "Very bad",
            "Fantastic 5G Phone",
            "Stylish, Durable, Totally Functional!",
            "Not just a phone!",
            "Very impressed!",
            "All Round Winner.......Five Stars.",
            "So Much Technology & Mind Blowing Performance"
        ],
        "review_text": [
            "I bought this three weeks ago and delighted with it. Easy to set up even for a oldie.",
            "The phone is very fast",
            "Phone looks good works fine, battery is good and got it on sale which was a bonus",
            "I purchased my phone on line it arrived sooner than expected and on my special birthday. The price was competitive and with the additional Nectar points - win win.",
            "Looks great and is really powerful.",
            "I bought this phone because my other phone wasn'tt working properly and I needed an upgrade. I've been using this phone for a few weeks and I love it.",
            "I'm a very happy with this product",
            "Very bad servis in Argos\nVery bad battery\nPhone haven't got wireless charging.",
            "Having used the new Xperia for a few weeks now this is definitely the best android phone I have used. \nMy previous phones have been a Samsung S10 ans a Huawei P30 Pro but the Xperia is a far better all round phone than both of those.\nFor a start it's easier to use in one hand and a lot lighter and fits in your pocket unlike other bulky handsets. \nBattery life is the best I've seen on a mobile easy lasting me 3 days with heavy use and over week on light use. \nThe 21:9 OLED screen is super bright and has crystal clear definition, games and movies look amazingly slick and apps load up in rapid time. \nMusic wise both streaming Spotify, youtube and mp3 files sound superb with dolby atmos and the Bluetooth connection to my headphones has been excellent with no drop outs plus the phone has a 3.5 headphone jack which is most welcome.\nThe camera only has 12mp but takes brilliant close up and wide angle pictures and the telephoto lens is up there with the best other smart phones on the market in my opinion. Shooting 4K Cinema video mode is very very good and the auto focus on moving images is sublime. \nAnyone considering a new 5G smartphone needs to seriously look at this new Xperia it beats all the competition by some margin. \nWell done Sony.",
            "Stylish, durable, totally functional; Yes, this is the latest premium smartphone from Sony. Measuring just 158 x 68 x 8mm and looking every bit as good as I expected, with smooth, sleek deepest black lines and pleasing format that falls into the palm very nicely. It is clear this is a very high quality device from the moment you pick it up.\n\nClad in super strong Gorilla Glass, it’s probably a lot stronger and hard wearing than such a shiny slim package would indicate. After only a few days I stupidly (accidentally!) dropped mine from about 1.5m onto a solid concrete floor and, when I plucked up the courage to look what damage I had done, there was nothing to see, no dented edges, no split glass, just a gleaming new Sony looking back at me!\n\nRegarding buttons and sockets, everything appears logical and easy to use with one hand, with volume, power, Google Assistant and camera shutter buttons on the right edge. The SIM tray is on the left edge and can be conveniently removed with just your fingernail. I’m pleased a 3.5mm audio jack has been retained because I love to use my headphones, the Dolby Atmos sound makes the most of movies, plus DSEE Ultimate makes my previous music files sound great. The front stereo speakers sound good and clean.\n \nThe USB C charging socket is where it should be, at the bottom edge. Whilst talking about charging, I found a full charge is achieved surprisingly quickly using the included 18W fast charger, reaching about 50% in half an hour. Battery life has been a very pleasing 2 days on average with fairly high usage, and when stamina mode is enabled even longer again.  There is no wireless charging, but for me that’s no loss providing battery life is good and charging fast when required.\n\nI particularly liked the fingerprint sensor combined with the power button on the right edge, so much more convenient than other layouts I have experienced.\n\nSetting up is typical Android, Simple! Importing all my previous apps, data etc. from my old phone was as a doddle using Google Drive backup, inserting my SIM and then restoring to the new device.\n\nThe 21:9 full HD OLED screen display measures 6.1 inch with ultra-fast refresh rate of 120 Hz. Based on Sony Bravia technology, quality is fantastic, which must be as good as any available and makes everything look so clear and sharp. It’s great for wide screen movies and gaming. I had no problems viewing the bright screen from various angles. I also liked the split-screen multitasking, which suits the taller display.\n\nMy Sony came with 8GB RAM and 128GB storage, more than enough for my needs. Processing is super-fast with nothing showing sluggishness or lags.\n\nI’m not a budding photographer, but love the camera options from the more basic to Photo Pro level for those who want a more profession feel with controls to match. The triple lens camera features Zeiss optics. I found the real time auto focus works well on humans and my horses! All photos looked very natural in colour tone, something I liked. I’m still exploring the Photography Pro mode, which is very powerful and suited to the more advanced user. Pictures I have imported from my old phone show all the metadata that was somehow missing previously, bringing new options to managing those older images and my new fantastically sharp shots. \n\nVideo filming can either be with the standard software or the 4k 120fps Cinematography Pro mode, which I found rather sophisticated. So you definitely have to know what you are doing in this mode!\n\nDay to day, I have found the Xperia 5 II a delight to use and with looks to match. I find myself thinking ‘how do they cram so much into this wonderful small package?’\n\nIf you fancy an Android Phone that’s as good as it gets, than take a look at this sleek handset – you won’t be disappointed! \n\nSummary:\nGreat Look & Feel\nStrong as They Come\n21:9 120Hz Display\nHeadphone Jack\nSuperfast Performance\nLong Battery Life\nExtended Features for Professional Users",
            "Where do I start? If you just want a mobile phone in order to make and receive calls, texts, messages and e-mails then this phone will do all of these very easily, but you could purchase other models which will be almost as good for a lot less money. \nHowever, if you want your mobile phone to do all of the above but also to watch films/documentaries on, to play video games on and to take stunning pictures and videos on then this is the phone for you.\nThe phone was extremely easy to set up, and I transferred my apps and contacts from my existing android phone in a matter of minutes. The phone is slim, lightweight, feels high quality and can be easily used with one hand. There are an array of buttons down the right hand side, and my only criticism is that I occasionally press the Google Assistant button in error, and cannot find a way to disable it at present.\nThe picture and sound quality are incredible. I first watched a David Attenborogh documentary on Netflix, and the picture was simply stunning, it almost seemed 3D at times. The stereo sound perfectly compliments the picture, and is fantastic for a small phone, plus you can use the headphone jack to avoid annoying people nearby! When watching a film I turned on the Dynamic Vibration setting which gave a real cinematic experience.\nThe camera and 4k video camera are both extremely easy to use, with all the controls shown on screen beside the view of the picture being taken. There are a choice of normal, wide angle and telephoto lenses, and there is a  button on the bottom right hand side to press to take a photo, just as on a SLR camera, so much easier than having to touch the screen. The picture/video quality is extremely high quality,  and were clear and in focus when cast to my 55\" smart TV. There are so many features with the camera that I am still experimenting and learning.\nThe 128 Gb storage the phone comes with should be more than adequate for most people, particularly if you regularly download pictures and videos to a storage device. However, you can add a micro SD card if you require more storage. \nThe fingerprint scanner button on the right hand side provides great security and is easy to use, and allows very quick access to the phones various functions.\nScrolling through Apps and pictures is very easy and smooth. Turn on the 120Hz screen refresh rate for enhancing screen use.\nThe battery easily lasts all day and more, and can be quickly recharged with the fast charger supplied.\nAll in all, a fantastic device which is much more than a phone, and I cannot recommend it highly enough,",
            "So the phone, it’s a sleek piece of kit right from the off. The glass front and back just looks and feels excellent in the hand.\n\nIt’s slimmer than my previous phones but somehow I much prefer it when it’s in my hand. \n\nI’m a long term iPhone user since 2007, so this was a completely different experience for me and it did take me a few days to adjust to the changes that my muscle memory had ingrained in me. \n\nIt took no time at all to set up, the google functions were a bonus as it’s my primary use on my laptop so all my details clicked into place. With being an iPhone user I transferred my data, photos, videos, apps via Google drive having done a backup and then off I went. Was surprised just how effortless this was.\n\nI immediately loved the cleanness of the screen and the apps, I didn’t realise just what I was missing out on from such a simple change.\n \nThe screen is just excellent, I’ve already streamed a few films and tv series testing it out. The sound quality with the front speakers and Dolby Atmos is just next level. I even let my dad watch a video to test the virtual surround without telling him and he looked at me confused but impressed and couldn’t figure out how it was possible on the phone.\n\nI’m still figuring a lot of things out and I do miss some of the features and functionality of an iPhone but then I’d now say the same about the Xperia and the Android operating system.\n\nWhile i’m not fantastic at photography I already like the functions and ease of use. The cinema and camera pro apps really take the functionality up another level. I let my friend see them and they dived right checking it all out and said they’d teach me how to use the functions of the apps properly. \n\nAs you can see from on of my pictures, I’ve been on the go since 6am for work, making calls, texting and accessing social media regularly and the battery life in my opinion is as good as I would expect. \n\nPlus the phone jack is perfect for me as it’s on the top of the phone so perfect in my pocket and I can finally use my headphones properly!\n\nI’ve yet to test the 5G, I’m three network and they support it, but it’s just not in my city at the moment, but I’ll be making a trip soon so will know how it performs in time.\n\nFor a first time android user and Xperia user I’m impressed.",
            "Sony has done it again with this flagship phone,it actually has a headphones jack(hurray).Love that you can use with one hand so comfortable to hold and the finger print sensor on the side is very convenient to use.All the features packed into this size of phone is truly amazing,learn how to use professional photography and video awesome quality standard for Sony of course as well as excellent quality audio.The connectivity options are some of the best on the market atm.Great for gaming,streaming and also video conferencing picture quality is awesome.There is so much more I could say about this phone, but I feel you should experience it yourself Sony build quality and excellence in electronics put this phone up there with the best.Try it yourself it’s a winner.",
            "My review of the Sony Xperia 5 II.\n\nI was really keen to use and explore this Sony smartphone for a couple of reasons, firstly, not being an Android user, I wanted to see how easy it was to understand and use it. Secondly, I wanted to experience the Sony features reportedly packed into this smartphone. \n\nUnboxing and first impressions.\n\nThe phone is sleek, looks fabulous and a lot thinner than I was expecting, it is, however, sized perfectly to allow it to be operated using one hand. The operating buttons are all conveniently placed along one side with a USB charging port on the bottom side with also the retention of a 3.5 mm headphone jack socket on the top of the phone. \nThe smartphone is coated in a protective Gorilla glass making it feel really solid. This could be very useful as I find the phone very slippery both to hold in the hand and also when placed down if not on a level surface it does tend to move very easily with gravity. I suppose this could be addressed by adding some sort of a cover to the phone, for peace of mind at the very least.\n\nPower Up and Initial Set Up.\n\nOn powering up the smartphone lead me through the setting up process, which really was straightforward to understand. There were plenty of help screens and prompts with as much or as little help as you needed in order to get you underway and start to use the smartphone. What came across from the very start was just how fast and responsive this smartphone is – it really was lightning fast. \nThe more I have explored the more customisable I have found it to be. From screen refresh performance to prolonging battery life. All designed in making the use of this smartphone tailored to your own preferences whilst maximising its performance for you.\n\nFeatures.\n\nThis smartphone really is packed with Sony technology, there is a very long list of features and specifications but the ones that stand out for me are the stunning OLED display. The display makes icons stand out, so they are easily seen and found, coupled with the optimised refresh rate makes for smooth transitions between apps and screens making the phone an absolute pleasure to use. The reproduction of colours is fabulous, but when watching 4k content the quality of the display just blew me away. \nThe 21:9 display is perfect for watching cinematic movies the high quality and immersive sound make it an easy and enjoyable experience when watching feature length movies on this device. You have a range of audio options to maximise your viewing and listening experience with this smartphone. For me, the Dolby Atmos sound enhancement feature is the standout feature here, it really takes your listening experience to the next level.\nIt’s nice to see that the headphone jack plug is still present. This gives me the choice of using either my wired headphones or connecting my Bluetooth speakers / headphones to the smartphone, giving me the best of both worlds. Again, there are sound optimisation features when using headphones with this Smartphone. \nBattery life appears to be good and long lasting. There is no wireless charging yet with this smartphone but to me that is no problem. \nThis smartphone has a flexible battery protect system to prevent issues when charging from a traditional wired charger, especially if left plugged in for long periods of time.\nThis smartphone has a lot of onboard storage, but this can be expanded with the use of a micro SD card up to 1TB. If you don’t use the micro SD card there is space for a second sim card, allowing you to use this one device for both a work and a personal smartphone. No need for two devices.\nI really like the split screen mode ability to use two apps at once they both fit onto the one screen nicely. \n\nBuilt in Camera.\n\nI already use Sony cameras, so I was particularly looking forward to seeing this in use on this smartphone. Sony really have brought their excellent camera technology to this smartphone. Features that you will find on their professional models of mirrorless cameras are here for you on this device.  You take a picture using the top button.  Features like the autofocus with real time eye tracking, and excellent feature that performed flawlessly when photographing moving objects like my dog as she does not like to sit still! The smartphone produced pin sharp images with a balanced exposure. Using burst mode allows up to 20 images to be taken per second almost guaranteeing you getting the picture you wanted. \nThe camera has a choice of user modes so you can let the camera do the work for you in terms of settings if you like or you can take control of the settings and get a bit more creative in your photos. If you take an image and it’s not quite right when reviewing your images, the smartphone has a really good image enhancement features where you can make things even better during postproduction. \nIncluded on the smartphone is a Photo Pro app, which transforms your smartphone into a virtual Sony Camera, with all the options to change camera settings there for you on screen just like on a camera. Again, you can choose the auto user setting and let the camera do the work for you, or you can use other settings allowing you to take control of the camera. Low light performance is particularly good, and there are also choices of taking your photographs as a Jpeg image or a RAW file (ideal for any creative postproduction work you may want to do on your image). Bear in mind storage for your images as RAW images tend to be a lot larger than Jpeg ones.\n\nIf video is your thing this smartphone also includes the Cinema Pro app. This allows you to take cinema quality video, again with user setting options allowing you to choose your look and feel of your video.\nThe quality of the built-in camera and video recording features together with the three Ziess lens (wide, normal and zoom) makes this smartphone a perfect choice for anyone who is (or wants to be) creative within the photography and video world. You will not be disappointed with the quality of the images produced from this smartphone.\n\nGaming \n\nI am the first to admit that I am no gamer, but the installed mobile version of Call Of Duty gave me the chance to give it a go. Whilst not very good at it I have to say the experience of gaming in terms of the quality of the images on screen and sound was brilliant. I had optimised the screen performance for gaming and switched off the notifications for an undisturbed gaming session, which I thoroughly enjoyed. There is also the option of attaching this smartphone to a PlayStation controller for an enhanced experience in gaming.\n\nNot Forgetting.\n\nAnd of course, this smartphone also makes and receives telephone calls, and sends and receives messages. The apps used were all connected quickly, and the voice and sound quality were very good. The keyboard is well laid out with numbers as well as letters displayed making is much easier and quicker to use. The keyboard has a positive feedback response, so you know when you have properly typed a number or a letter.\n\n\nFinal Thoughts.\n\nI have loved getting to know this smartphone. Whilst I am still finding my way around the Android operating system, the Sony Xperia 5 mark 2 is jam packed with top performing Sony technology, too many to mention in this review. Having seen some of it in action I can say that, in my opinion, this device is streets ahead of others in terms of performance giving an amazing user experience. The screen graphics reproduced are superb in conjunction with the rich sound quality, not forgetting the high-quality camera and associated applications makes this device one that I would have no hesitation in recommending. \nI have attached some images that I hope will assist (not taken on the Sony Xperia smartphone), not sure they do the actual quality of the screen display justice."
        ]
    }
}