{
    "940/8555": {
        "remotekey": [
            "940/8555"
        ],
        "item_category": [
            "Power up your visuals with a 6.52-inch HD+ Vast Display and a 13MP AI Triple-Camera backed by intelligent performance. Real-time display enhancement and an immersive display pull you in to the experience. Enjoy smarter photography that removes the guesswork out of getting the perfect photo with AI Face Tracking, AI Scene Detection, AI Filter and Best Shot. Get a faster, smarter and more effortless experience with Alcatel 1S' simple setup, intuitive interface, fast access and a 4000mAh battery with smart power management to keep it going all day. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "29 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "96%"
        ],
        "review_rating": [
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "4 July 2021",
            "30 June 2021",
            "24 June 2021",
            "24 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "23 June 2021",
            "10 June 2021",
            "9 June 2021",
            "9 June 2021",
            "7 June 2021",
            "6 June 2021",
            "5 June 2021",
            "2 June 2021",
            "2 June 2021",
            "29 May 2021",
            "29 May 2021",
            "28 May 2021",
            "19 May 2021",
            "19 May 2021",
            "4 May 2021",
            "28 April 2021",
            "27 April 2021",
            "22 April 2021",
            "20 April 2021",
            "13 April 2021"
        ],
        "review_title": [
            "Great",
            "Good features",
            "The screen started lagging 3 weeks after using it.",
            "1st non Samsung phone",
            "Easy to use.",
            "Excellent phone",
            "Alcatel 1s",
            "Great phone",
            "Happy with pone",
            "Great all round phone",
            "Super great value smartphone",
            "Great phone",
            "Great Camera",
            "smart looking smart phone!",
            "Easy to use",
            "Cracking budget phone",
            "Hubbie's new phone",
            "Review of alcatel 1S",
            "Great size",
            "Perfect",
            "Just made for me",
            "Amazing Quality phone",
            "Simple, inexpensive, latest Android 11 update",
            "I looks fab",
            "Alcatel 1s",
            "I bought it for my son",
            "Brilliant phone",
            "Exactly what I needed",
            "A surprise buy."
        ],
        "review_text": [
            "Bought it as a father days gift and they love it and they said it's great phone",
            "Bought this item one month ago and am very pleased with this",
            "The screen started lagging 3 weeks after using it and stopped responding properly.",
            "On 1st opening the box was struck by how big it is. Unfortunately its too big for any of my pockets and is a tight fit in phone pocket in my handbag\nRelatively easy to set up by following instructions on the phone. Relatively easy to use once I got used to the function of the buttons. Camera is quite good with clear images.\nPersonally having always had Samsung phones I still prefer them but if looking for a cheaper alternative then this may be for you",
            "Great phone with excellent battery capacity. Easy to use features with up-to-date Android 11.",
            "I am really pleased with this phone. Easy to use. Best phone I've ever owned.",
            "Quite happy with my purchase. Very good phone for that price. Battery is ok. Comes with some extra useless apps which take a lot of space.",
            "Bought for a friend and they are happy with it as it has a very good battery life and other features",
            "Bought to replace my old mobile found it a little hard to use at first  but got ther",
            "I Bought this after breaking my contract phone, has all the features of my contract phone for a very reasonable price. Will happily continue to use it for the foreseeable future.",
            "This is a really good phone when familiarised with its features and configuration. Haven't yet found anything negative, and provided you buy it for simple \"normal\" use it will do the job admirably. The camera is perfectly good, battery life seems to be above average and pleased with that. I can't comment on the fingerprint or facial recognition security as I simply use a PIN number (personal choice), but it's quick and easy. The only downside is there is no user manual, however, if you need one, then it can easily be downloaded from their website. I have given this 5 stars simply because (a) it ticks all the boxes for me and (bh) it didn't cost a fortune. I find it hard to fathom why people find it necessary to spend countless hundreds of pounds buying into expensive I-phones or Samsungs.",
            "Easy to setup nice big phone great for watching videos on it fast speed no laging would definitely recommend its just as good as my old Samsung great battery life also quick to charge good storage looks great doesn't look Cheap",
            "This is a really good basic phone for the price you couldn't ask for more, it's a nice looking phone although a little on the large size for my handbag but that is just my opinion, the camera quality is excellent the battery life is good,it does everything I need from a phone but I will admit I'm not that savvy with technology but would make a great first time phone for teens, good value for money",
            "i have been using the phone for about a week , it really compares with some off the expensive mobiles i have used in the past.\ncamera is very good, takes very nice videos.\nscreen is crisp and clear with good colour.\neasy to get around the apps .\ndownloading apps and games is quick and efficient.\nnot a heavy phone to handle and fitted in my hand comfortable.",
            "I am 76 years old and am delighted with the facilities on this phone.  I am not very technically minded but followed the instructions on the screen quite well.  I had a hiccup with my Google Account but my son in law soon found what I had done wrong and corrected it.  It is easy to handle and looks good.",
            "When I got the phone it was really easy to set with a clear guide to help me through and to ensure all my favourite features and apps were ready for me to use.It has finger print and face screen unlock which I was surprised but happy to see, as wasn't sure this would be there considering such a low cost for the phone. They both work really well and have had no problems.It has acreally nice large screen so it's great when I've been browsing and watching videos and it has a really clear screen.Considering it's what you would class as a basic phone because of the price, I'm really happy with it cause it's very simple to use, charges really quickly. Not is doesnt have all the extra bells and whistles compared to very expensive phones but if you dont need all that then this is a treat phone and I'm really happy with it.One negative I would say would be that the camera isn't all that good as the photos are not very clear, but if you're just taking general photos then it will be fine.",
            "Bought it for my husband, doesn't use a mobile much so this was a great price, does what he needs it to. He loves the size, very clear",
            "I found it best to use a case with this phone as it only has a thin screen frame, so without a case its so easy to accidentally catch the screen.\nI have been using this phone now for a good few days and I am quite amazed at how good it is for the price, everything works seamlessly. \nI really like the Focus mode. Just turn it on to pause any app/apps that would normally distract you while revising or working on a project and hay presto no interruptions. You can even set a “focus” schedule every day.\nMy last phones have constantly pestered me for passwords. Now with the Alcatel’s fingerprint sensor life has been made so much easier it works instantly, just think no more passwords “Perfect”.\nSetting up Face recognition was the fastest I have ever done (full marks).\nThe battery life seems great, really, really like the dedicated ‘Hey Google’ button it responds even faster, just press the button and ask the question. \nI’m already using the Dual Sim facility and compass. \nIt has Android 11 even has split screen facility that allows you to keep your eye on WhatsApp and read your emails on the same screen….\nWell worth the money.",
            "This phone is ideal especially for elderly gents like myself.It is much slimmer and easy to hold.i like the layout of the apps.the phone is fast and the charge lasts longer.the three cameras are great too.chexk my garden and my tank.",
            "Very happy & satisfied !! great phone & low price",
            "Simply delighted with this phone. As a pensioner, the size is just perfect! The camera produces fantastic pictures in comparison to my last phone. Love the 32GB storage as I can upload my favourite videos and music. Can select just the apps that I want on my screen. All in all, this must be the best phone that I have ever had and so easy to use. Thank you Alcatel.",
            "I would highly recommend this model phone to everybody, it is a very quick phone and very well built with a great large screen, no lagging at all just pure power at an amazing very cheap price.",
            "Bought for someone who just uses phone, text, Internet, video streaming in Sd and isn't bothered about camera.  Is perfect for this sort of use. Didn't have a lot of bloatware and upgraded itself to latest android version.  Seems to work well, quite intuitive for basics.",
            "The phone is easy to use and really well made",
            "Very good purchase with a low price, i use it as business phone and done the job well so far.",
            "I send it already to my son",
            "Brilliant phone for an affordable price. Only slight problem is that the fingerprint scanner doesn't always work until you put on your phone to the lockscreen wallpaper but I guess for the cheap price you can't expect everything to be perfect but can't complain",
            "A great price for a smart phone and does everything I need",
            "Now this was bought as a fill in cheap phone while i could get new contract but, ill be keeping this for awhile its was a surprise buy and in a good way battery life is very good and its fast and loads apps well and has a bright screen not the sharpest, the only thing i would say that lets it down slightly is the finger print scanner bit hit and miss tap screen or pick up too wake would have been a nice addition but face unlock is excellent and quick good buy for any age and not too heavy."
        ]
    }
}