{
    "943/6936": {
        "remotekey": [
            "943/6936"
        ],
        "item_category": [
            "The power to get more done with Qualcomm 5 SoC that gives OPPO A74 5G the ability to empower you every day, whether taking photos or browse. And with 6GB of RAM and 128GB of ROM, it moves faster and stores more. Experience Every Color with 100% coverage of the DCI-P3 gamut, bringing you a rich and accurate color experience that looks as vivid as what you see in real life. With 18W Fast Charge, A74 comes with a rapid charging solution for a life in motion, so you will never feel slowed down and its premium design simply exceeds expectations. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "21 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "2 August 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "23 July 2021",
            "1 July 2021",
            "1 July 2021",
            "10 June 2021",
            "9 June 2021",
            "9 June 2021",
            "8 June 2021",
            "8 June 2021",
            "8 June 2021",
            "5 June 2021",
            "3 June 2021",
            "3 June 2021",
            "1 June 2021",
            "31 May 2021",
            "30 May 2021",
            "28 May 2021",
            "28 May 2021"
        ],
        "review_title": [
            "OPPO A74 5G - Did I make the right decision?",
            "Fantastic oppo Great Value",
            "Amazing phone",
            "Great phone",
            "Great phone",
            "Great looking phone",
            "Great phone for the price",
            "Oppo A74",
            "Great phone",
            "B PAUL",
            "Good phone for a great price",
            "Oppo A74 128GB 5G mobile phone",
            "Real great phone easy to use",
            "Great value for money",
            "Great phone",
            "Can hold it with one hand and type :)",
            "As good as the big names",
            "Amazing phone for great value!",
            "Great phone, easy to use and 5G!",
            "Great phone!",
            "A really good value android"
        ],
        "review_text": [
            "Following extensive reviews of possible higher spec, lower end smart phones, I decided on the A74 5G Oppo phone, turned out to be an excellent choice, so far.  Highly recommend this manufacturer and model.",
            "Great phone for the money, good battery life, takes really good photos and videos, and everything you'd expect from a high end phone on nicely priced phone",
            "Bought this phone a month ago and it is the best phone I ever purchased. Better than Samsung for sure",
            "I bought this one month ago and I am happy with this phone. It has great features and good for playing games and watching videos on.",
            "Took a risk buying a phone we have never heard of ,my son loves it , much better than his iphone",
            "[This review was collected as part of a promotion.] Decent phone but it could be better. camera isn't that good at night time. screen is good with good colors and games feel responsive due and the battery life is really good. Overall a decent phone but not amazing!",
            "[This review was collected as part of a promotion.] I have been using my Oppo A74 5G for over one month now and have really enjoyed the experience so far. Crystal clear screen and fast processor make for a good user experience. Love the camera and photo editing options. Great purchase given the price point.",
            "Very pleased with my phone it's very quick and responsive, camera is very good also and would defo but again",
            "Great phone\nGreat navigation",
            "I bought this end June it's working well no any problems at all",
            "[This review was collected as part of a promotion.] OPPO is quite new to the UK market so coming in with a 5G handset at a great price is amazing in itself. I was expecting some watered down version of Android but I was very surprised at how responsive and fluid it felt. I love the gradient colour of the casing - definitely makes it stand out. Camera packs a punch, definitely not a superstar camera but does it’s job and more.",
            "This was bought as a replacement to my venerable Motorola G3 phone. I had been informed that, where available, it's refreshing to use the improved bandwidth of 5G. This certainly delivers in spades. Having also owned one of the most popular brands I'm happy to say this is up there with them.",
            "It does what you expect from a phone, good battery",
            "I bought this phone almost in the half price than the equivalent model of well-known famous brand. So happy for my choice!",
            "[This review was collected as part of a promotion.] Great looking phone, very light and nice stylish finish. The resolution is very high and the camera is good as well, you can take beautiful pictures with both cameras.  Really fast and with good features.",
            "[This review was collected as part of a promotion.] After 1 month of using this phone, my experience is excellent.\n\nHassle-free use, very fast, with good quality photos and videos (see pic below), without being something revolutionary of course. As for the screen, it is excellent and relatively large (6.5) and what I really really like is that it is slim and I can hold it with one hand and type (I really have a problem with huge phones). With very vivid colors, good resolution and refresh rate at 90Hz.\n\nThe 5000mAh battery, I would characterize it as one of the best – it lasts twice as long as my old phone and more. Its charging is quite fast (18w), not the fastest on the market, but fast enough, I think it would satisfy most users out there.\n\nVery quick in its processes as a combination of RAM (6 GB) and snapdragon works perfectly.\n\nIts speaker is more than satisfactory, it has great volume and clear sound. Also, the quality of calls based on my experience is exactly as it should be, without a single problem.\n\nConclusion: I recommend it to anyone who wants to buy it, I do not think they will be dissatisfied.",
            "[This review was collected as part of a promotion.] This phone is as good as the big name brands but at a fraction of the cost. easy to set up and transfer data from previous phone.\nHolds 2 sim cards for those that need a work and a home mobile, and has plenty of storage for media.Takes great photos with its multiple cameras.\nThe speaker is clear so music sounds good, no distortion or echos. Quick to load Internet and 5G ready.  \nIts a well made quality looking phone that even the teenage daughter is happy to have - and we know how fussy they can be..",
            "[This review was collected as part of a promotion.] This is an amazing phone, it has nothing to envy compare to other bigger brands. The camera it’s amazing the screen size it’s perfect to watch series and movies on the go, the battery life it’s really good and it also charges super fast for those days when you are in a hurry. I will definitely recommend this phone to family and friends it’s just amazing and at a great price!",
            "[This review was collected as part of a promotion.] Really good, this phone has so much power, all things considered. No bloatware really, just Android how it should be. Great for gaming, 5G worked as expected and camera is on point too. Not the BEST camera, but fine for todays standard.",
            "[This review was collected as part of a promotion.] This is my first android phone and I won't look back... it has lived up to the hype. The phone ticks all the boxes, large high quality screen, phenomenal camera (no need to carry a digital camera with this around!) and large memory that can hold all the pictures I need..which complements the camera. The dual sim is also really handy as I travel abroad a lot with work. Quality build and overall a great product.",
            "[This review was collected as part of a promotion.] Before this I had always owned an iPhone, however once trying this phone I immediately fell in love with it. It's a really good value phone, has great battery life and a good camera. I was surprised by how fast this phone is, especially because of the low price, it's great to be able to open and use as many applications as you want without the phone feeling slowed down.\n\nThe design is nice, fits easily in your hand but has a big enough screen to watch a video on it and enjoy it."
        ]
    }
}