{
    "780/3231": {
        "remotekey": [
            "780/3231"
        ],
        "item_category": [
            "In addition to easy calling and messaging, this stylish bar style phone enables you to use WhatsApp and Facebook over WiFi and high-speed 4G LTE networks. The large 2.8\" display and the widely separated, high contrast keys make everything you see and do all very easy, including taking great photos and videos with the 3MP camera. Other features include enhanced audio with HD voice, easy navigation, a torch and an assistance button, as well as reassuring safety features such as support for Response by Doro with GPS positioning. "
        ],
        "summary_star_rating": [
            "3"
        ],
        "no_reviews": [
            "8 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "63%"
        ],
        "review_rating": [
            "5",
            "4",
            "4",
            "2",
            "3",
            "4",
            "1",
            "1"
        ],
        "review_date": [
            "20 May 2021",
            "5 February 2021",
            "8 January 2021",
            "4 January 2021",
            "29 December 2020",
            "19 December 2020",
            "26 May 2020",
            "26 May 2020"
        ],
        "review_title": [
            "Great product",
            "The phone looks good",
            "It depends who it's for",
            "Is there a market for this phone?",
            "Handy little phone",
            "Above Basic but staying simpler",
            "Really disappointed",
            "Doro 7010"
        ],
        "review_text": [
            "I bought this phone for my 85 year old Mum to replace an old phone. The large keys, text size and straight forward operation were exactly what was needed. Highly recommended",
            "Phone is great for elderly and young children. Making texts and sending texts is very simple. Has a reasonable camera. Works with WiFi for WhatsApp and Facebook. Has a clear screen for games. The only thing is that I, personally dislike, is the keyboard. My fingers tend to hit two at a time so making me take longer to form a text. On the whole I would recommend it.",
            "This is a simple mobile which is easy to use, it has a good screen that is bright and easy to read, the sound is good as well, it is also very easy to navigate around the menus so anyone who isn't in need of a smartphone will find this phone very useful",
            "Compact, proper telephone keypad, nice feel. Good call quality. Reasonable camera. 'Response' button for emergencies. Twin sims for hols. Useful for a spare or emergency phone. Limited social media and browser. Good sound quality.\nPoor screen definition, lower signal strength, menus not intuitive, navigating difficult, fiddly to setup, writing from numeric pad is hard, battery life short.\nDoro target audience was the elderly, this won't do. Even children will find it hard to setup and use.",
            "Handy to have as a spare in case you lose or brreak your main phone. Lightweight, access to Facebook & Whatsapp, also has a decent camera. As it is sim free you can use any sim. Ideal as a starter phone for a child.",
            "This little unit retains the simplicity of earlier DORO mobile phones now offering advanced functions with the exception of a touch screen control. Would suit adult users not wishing to get fully immersed immediately current technology. Apologies for very poor photos but current phone is failing.",
            "I was really excited to get this phone for my Mum. It’s her 3rd Doro si we knew it would be as good as her others ....or so we hoped.  The preloaded apps wouldn’t open as it kept saying the clock setting had an issue.  Nothing would sort it out. I spent 5 hours on it.  It will be going back as soon as the store reopens.  Not happy that faulty goods can’t be returned yet.",
            "Great handset, let down by an awful user interface.\nBought it for my mother, she will find it very difficult to use. Even though it was apparently designed for people like her."
        ]
    }
}