{
    "320/4559": {
        "remotekey": [
            "320/4559"
        ],
        "item_category": [
            "Aznu is a new way of buying that premium branded phone you always wanted, but at a much more pocket-friendly price. With Aznu, you get a refurbished phone with the same camera, features and processor, plus a brand-new screen and a 12-month warranty. You also have the knowledge that buying Aznu helps reduce landfill and waste. We include a Sim tool so it's easy to pop your old card in, a year's worth of Norton 360 VPN Virus and Spam protection, and a cable and charger so it's ready to go! If it looks like new, it must be Aznu. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "5 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "80%"
        ],
        "review_rating": [
            "2",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "23 June 2021",
            "5 May 2021",
            "14 April 2021",
            "31 March 2021",
            "24 November 2020"
        ],
        "review_title": [
            "Looks ok",
            "Phone",
            "Looks and operates like Brand New",
            "Love the slim feel",
            ""
        ],
        "review_text": [
            "Looks ok but screen sticks constantly and keyboard sticks as well. Also very slow on internet.",
            "Samsung 7 edge. Perfect phone and company",
            "The purchase of this phone was to replace the original I has punched from Samsung several years ago.\n\nThe AZNU phone really does look and operate as Brand New but at a fraction of the cost. it arrived quickly and came very well presented in a bespoke box complete with charger and has a 1 year warranty.\n\nYou will not find a better second hand or reconditioned mobile phone.  AZNU will exceed your expectation if my experience is anything to go by.",
            "Lovely love samsung and really quick my bestie",
            "This was a refurbished phone supplied by Aznu, Argos's partner. It came beautifly boxed with charger and sim extractor tool and looked factory fresh from Samsung. So far it gas lived up to its flattering eviews. If anyone is looking for a reasonably up to date phone without the ridiculous market prices then Argos ans Aznu are for you,"
        ]
    }
}