{
    "943/6895": {
        "remotekey": [
            "943/6895"
        ],
        "item_category": [
            "A crisp, flat screen stretches across the front, while a gentle curve arcs around the back, forming a premium look that exceeds expectations. With a 90Hz refresh rate and 180Hz touch sampling rate, graphics flow smoothly and responses happen instantly. A powerful battery keeps your phone going longer without constant recharging, powering 13 hours of video viewing, 27 hours of call time, and 40 hours standby. You can stretch that last drop of power further with Saving Mode and with Super Nighttime Standby, only 2% of battery power is used up. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "15 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "31 July 2021",
            "30 July 2021",
            "27 July 2021",
            "25 July 2021",
            "16 June 2021",
            "9 June 2021",
            "8 June 2021",
            "3 June 2021",
            "3 June 2021",
            "29 May 2021",
            "28 May 2021",
            "28 May 2021",
            "28 May 2021",
            "26 May 2021",
            "19 May 2021"
        ],
        "review_title": [
            "Great product for the price",
            "Amazing",
            "Love it !",
            "Beautiful Colour Mobile Phone",
            "Fantastic piece of kit",
            "Fantastic",
            "Pleasantly surprised",
            "A lovely budget phone",
            "Amazing camera and video quality",
            "What a nice surprise",
            "A great Andriod phone",
            "Absolutely amazing",
            "Solid Android Phone to rival the big boys",
            "Exceptional phone.",
            "Great phone and camera"
        ],
        "review_text": [
            "Just as good as any major branded phones",
            "I bought this not long ago and it’s been amazing and I can not fault it at all",
            "Great phone, great price and plenty of free accessories. No complaints here!!",
            "I bought this new phone and I am really very happy because my old phone was constantly charging and I knew it is time to get a new one.  Thank you for giving me a new one.",
            "[This review was collected as part of a promotion.] I have previously always had an Apple or Samsung smartphone so I wasn't entirely sure what to expect from the A54 but so far I have been absolutely thrilled.\n\nBoth the size and weight feel good in my hand while the 90hz screen is excellent for streaming 5g video on the go.\n\nI'm a big fan of the android operating system after converting from Apple some years ago so happy that is all set up and ready to go.\n\nUsed for some light gaming and all has run smoothly for me so far, and also the battery life has held up well while being used for longish stretches of video/gaming.\n\nOverall I think its a great phone and a strong competitor to other smartphones on the market.",
            "Great service and phone",
            "[This review was collected as part of a promotion.] Surprised how good this phone is. Good screen size. Easily fits into the hand - my thumb could reach anywhere on the phone. Also has amazing battery compared to other brands. Would happily recommend it to anyone.",
            "[This review was collected as part of a promotion.] I am in love with my new oppo A54 5g. Its a lovely budget phone with sleek design and  features that the big brands offer. It has a dual sim with a very beautiful display and a good brightness level,  perfect for watching videos and stuff. It has a shiny surface with a very easy interface, All the application icons are easy to setup , customise, Rearrange, delete and can be tidy-up single handedly. Swiping down and Dragging up is quite easy because it has a good screen size.\nAnother plus feature is the fingerprint sensor on the power button for lock and unlock. It has a face recognition feature too. The camera has a good result having a different modes and a good resolution option. Selfie is very clear like the big brands phone. The best think about this phone is its battery that runs longer usually for complete 2 days. The charging is so fast and quick too.\nThe phone is also perfect for those who like gaming. It has a variety of gaming inbuilt tools too (pro gamer mode). I recommend this phone.",
            "[This review was collected as part of a promotion.] So I have always been a certain brand person so was dubious about trialling a different brand that if I’m honest have never heard of before. \n\nI needn’t have worried. The Oppo is amazing. It’s so quick and responsive to commands, is very easy to set up and honestly so user friendly it knocks the other brands out the park! \n\n The smooth sleek design is so comfortable to hold even when the phone is on the larger side. Makes it so much better for when I’m watching videos I’m streaming online. \n\nThe quality of photos and videos your able to take is unreal! Every little detail is caught perfectly! Each little detail is so vibrant that the colours pop! The clarity is great! \n\n Overall using the phone takes a few minutes to adjust but honestly don’t let that put you of. Once you’ve got the knack you’re away! I honestly hope to see more versions of this brand as to be frank the time and care that has gone into this is far superior to others I have used in the past. I have now changed my work phone to use this phone as is so much better to be use!",
            "[This review was collected as part of a promotion.] I've been using this phone for the last couple of weeks. My previous phone was just over 2 years old and was the best android phone available at the time. Going from that to a phone I had never heard of before I'll admit, I didn't have high expectations! I expected it to be just about on par from what I had come from, but to my surprise, it was far superior in just about every way. The size difference shocked me, it is so much bigger, the screen size is enormous and crystal clear. Photos are so sharp and the video is also. Anyone currently using an android Phone will be instantly familiar with the controls. \nPut my sim in, logged into my account and clone phone done the rest. Before I knew it I was almost on my old phone, a very easy experience that even a novice can handle. My only gripe is the speaker location. It's fine watching videos but if your playing a game, due to the way you have to hold the phone to use the controls, your hand blocks it so you end up with no sound. If it wasn't for that I'd give it 5 stars!",
            "[This review was collected as part of a promotion.] I have used this phone if you have ever used any custom version of android or stock android before you will pick this up in no time it feature packed but if you just want a phone and text machine it will do that too, the camera offer great features and have a reasonable zoom comparable to any I've used to date. the screen clarity is amazing and it responds really well to touch my 11 Yr old daughter has also used it and works well for gaming and watching videos which I'm sure if you have kids you'll know is all they want it for I will happily replace all my handsets for this at the next opertunity as its both kid friendly and more tech savvy friendly if you need it. Charge time is roughly 1.5 hours to 100% which is also important and final it still has a headphone port which considering that amount of companies moving away from this is a plus given how much I like my old headphones",
            "[This review was collected as part of a promotion.] Absolutely amazing phone. It’s sleek, trendy and beautiful. \nThe screen is vibrant and just stunning to look at, perfect for videos gaming and surfing the web on. \nIt’s fast and doesn’t lag at all. \nThe camera takes stunning pictures and videos. \nCharges up very fast and the battery lasts for a very very long time with moderate usage. \nWould absolutely recommend to anyone looking for a new phone.",
            "[This review was collected as part of a promotion.] The Oppo A54 looks sleek and holds well in the hand. Boots up quickly and has all the apps and gadgetry that you would expect from a modern Android Smart phone.\nCamera works great and has all the filters I will need day or night.\nBattery holds a good charge and with average use all day, holds out well. \nOverall really impressed with the device, and just goes to show that the 2 big brands aren’t the only ones that can make good smart phones!",
            "[This review was collected as part of a promotion.] Been an iPhone user since the iPhone since. This is the first android handset I’ve used since then. \nI’m loving it. The screen is gorgeous. The cameras are very good. The phone is very fast and overall an exceptional phone. Especially for the price.",
            "I brought this two weeks ago and it's a solid phone, battery lasts all day and the camera is top quality. Comes pre installed with screen protector and case. Worth the money and is such an unusual colour, very eye catching mobile"
        ]
    }
}