{
    "869/8225": {
        "remotekey": [
            "869/8225"
        ],
        "item_category": [
            "The OPPO Find X2 Lite is power house with 5G connectivity and a 360 degree antenna support to make sure you always have the best coverage. As well as a 48MP main camera, in a quad rear camera sety up including an 8MP ultra-wide and two 2MP portrait lenses. Fast charging for a full charge in just 56mins. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "13 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "92%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5"
        ],
        "review_date": [
            "28 July 2021",
            "28 July 2021",
            "21 July 2021",
            "21 July 2021",
            "16 July 2021",
            "8 June 2021",
            "28 April 2021",
            "13 April 2021",
            "3 March 2021",
            "9 February 2021",
            "3 February 2021",
            "21 January 2021",
            "20 January 2021"
        ],
        "review_title": [
            "Nice new phone",
            "Great phone at a bargain price.",
            "Great OPPO",
            "Good Customer Service",
            "Value",
            "Battery let it down",
            "Good phone for price.",
            "Great phone",
            "Excellent phone",
            "Excellent mobile .",
            "Oppo find x2",
            "Amazing phone",
            "Fabulous phone"
        ],
        "review_text": [
            "The phone is easy to use and has plenty of storage. Camera takes great pics and it also is very fast to charge up. Great purchase",
            "Superb phone.  Very good battery life.  Charges In minutes.  Only problem is phone is too easy to mute.  Control would be better on left hand side.",
            "I bought this phone one month ago and I am very happy I choose OppO is what I expected !!",
            "Good quick customer service. Girlfriend very happy with phone and would recommend.",
            "Great phone for the price, easy transfer from old phone & nice look and feel",
            "Very good phone. It has everything I need. Works perfectly so far. The only issue I have with it is battery - lasting barely one day of moderate use. Fast charge and fast discharge.",
            "I've had this phone for a week now, transferred all okay except my photos photos this was due to the QR scan not being recognised. Good volume compared to my old phone, runs on android 10 with color 7os which i do not like. It took me some time to alter the ring and notification sounds to the ones i wanted using Zedge. Battery lasts about 1 and half days dependant on use.. No slot for SD card and one slot for nano sim. Comes complete with charger, C type cable, ear phones, and case.",
            "My first android phone after refusing to pay silly money for flagship brands any longer. I decided to take a risk on this and couldn't be happier! I was impressed to find it even comes with a clear case in the box as well and a screen saver already fitted to the phone, the included charger is super fast and it works just like a phone should. Pictures and video are clear, I have zero complaints and think this brand is now leading he way in affordable tech.",
            "Bought this phone few weeks back. Have been excellent so far. Fast charge, charge holding back for more than a day even with continuous use. The response time is great and the OS is brilliant.\n\nWill recommend this phone.",
            "Fab extraordinary mobile",
            "Got scammed. Price dropped 2 days after purchased.",
            "Cannot fault this phone at all. Love the pearl white, full charge in less than 30 minutes. So bright and easy to use. Love it",
            "Great phone very fast and responsive\nbrilliant camera and sound.\nI live in a weak mobile phone area, but with this handset I always get 2 bars and sometimes 3, never miss a call. This is due to the aerial being all around the screen.\nCannot fault this phone and cheaper with similar spec than a Samsung which I have always purchased, but Oppo for me in future"
        ]
    }
}