{
    "848/0457": {
        "remotekey": [
            "848/0457"
        ],
        "item_category": [
            "iPhone 12 Pro. Superfast 5G. A14 Bionic, the fastest chip in a smartphone. Pro camera system for next-level low-light photography. It's a beautiful leap forward. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "61 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "98%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "1 August 2021",
            "30 July 2021",
            "30 July 2021",
            "24 June 2021",
            "23 June 2021",
            "23 June 2021",
            "9 June 2021",
            "9 June 2021",
            "2 June 2021",
            "20 May 2021",
            "6 May 2021",
            "28 April 2021",
            "28 April 2021",
            "28 April 2021",
            "27 April 2021",
            "27 April 2021",
            "20 April 2021",
            "14 April 2021",
            "4 April 2021",
            "26 March 2021",
            "25 March 2021",
            "24 March 2021",
            "23 March 2021",
            "20 March 2021",
            "19 March 2021",
            "16 March 2021",
            "10 March 2021",
            "9 March 2021",
            "9 March 2021",
            "4 March 2021",
            "3 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "26 February 2021",
            "25 February 2021",
            "25 February 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021",
            "19 February 2021",
            "18 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "16 February 2021",
            "16 February 2021",
            "16 February 2021",
            "16 February 2021",
            "13 February 2021",
            "10 February 2021",
            "10 February 2021",
            "10 February 2021",
            "10 February 2021"
        ],
        "review_title": [
            "More faster",
            "Amazing and does everything it should do",
            "Great product",
            "Sue42",
            "Amazing phone",
            "Best iPhone ever",
            "Great device",
            "Great product",
            "Example",
            "Mrs",
            "It’s iphone so always goos",
            "What can i say iphone 12pro is just amazing",
            "Everything okay",
            "Fab phone",
            "The mobile is absolutely fabulous",
            "",
            "It looks good and spec's are great.",
            "iPhone 12 Pro - perfect",
            "Great product so far!",
            "",
            "My phone looks gorgeous",
            "Great phone",
            "iPhone 12pro",
            "Amazing Camera",
            "Daughter livs her new phone. Great camera.",
            "Is a beautiful phone, I love it",
            "The feeling of it, it’s awesome",
            "Excellent phone",
            "Great Phone",
            "Thanks",
            "Like the look of the camera bump!",
            "The phone looks incredible",
            "Amazing phone!",
            "good",
            "iPhone 12 pro",
            "Very good",
            "Superb phone and camera",
            "Great iphone",
            "My IPhone 12 Pro is a perfect fit in my hand",
            "Perfect upgrade",
            "Amazing",
            "The phone look fab",
            "Works perfectly!",
            "Excellent quality for money",
            "Happy as Larry",
            "Verry nice pictures",
            "Best iPhone yet - Awesome camera!",
            "Best",
            "Great Phone!!! Don’t think about it just get it!!",
            "Good",
            "iPhone 12 Pro amazing phone.",
            "",
            "The phone is fabulous.",
            "Great phone, much improved over my iPhone 6s.",
            "iPhone 12 Pro",
            "iPhone 12 Pro. The faster iPhone I have ever had",
            "Three camera quality is remarkable.",
            "New phone loving it",
            "Great phone",
            "Great phone!",
            "New iPhone 12 Pro is great"
        ],
        "review_text": [
            "I love apple product so convenient to use.",
            "Purchased for my daughter and she’s yet to complain as kids always do. A great phone with great features",
            "I brought I phone 12 pro recently. Its really worth the amount I paid. Its the bestest phone I ever brought",
            "I had bought this as a birthday present. He was really pleased with the phone.",
            "I bought this IPhone 12 pro and I’m absolutely happy that I did it! Working smoothly and fast phone!",
            "I am very happy. I brought it 1 month before. And I love it.",
            "Strongly recommend. Perfect phone",
            "The new phone is great, arrived quickly and is spot on!",
            "It’s very good stuff and very good condition",
            "I buy last week very gud love it,it has great features",
            "Good speed good looking good speed",
            "Everything is goodd.    Gooddddddddddd",
            "I bought my second iPhone from Argos now. Collection time was shorter than anticipated which is great. The phone works perfectly well and I have no problems with..",
            "The phone is great no complaints bar using the wallet feature using face recognition instead of the old finger print feature - not great as wearing masks in shops",
            "I like this phone and the colour, I was waiting quite long to get this phone, thanks argos",
            "Amazing phone very fast",
            "It is very good and camera is perfect",
            "Lovely phone and brilliant to be able to buy at Argos during lockdown. Easy purchase, Covid awareness great. Phone as expected and love it. Camera/video is epic.",
            "Does what it should, large screen and super produt!",
            "Worst phone battery is terrible 5G is not good. Hate this phone wish I never upgraded so not reccomend",
            "It’s really fast And efficient. We have fun together when we use from phone. I recommended this product.",
            "Easy to set up from old iPhone, amazing camera.",
            "All around perfect phone. Looks great in flesh too very shiny and pacific blue is by far the best colour apples released to date looks amazing! However it is expensive and all iPhones are pretty much the same so unless ya phone breaks I wouldn’t break the bank. Cameras awesome on this one too.",
            "This Iphone is expensive but It is faster and better camera! Also no charging plug in it. Good for Vlog",
            "Covid restricting meant shop only clicks and collect. \nQuick, easy and safe collection. Thank you.",
            "I love my new phone, I like the new colour",
            "Nice colour, i missed the iOS system. Fab",
            "Excellent phone, great camera quality and speed.",
            "Really great phone , ticks all the boxes",
            "It’s nice phone but no have a charging plug witch is not good",
            "No issues get used to the operating iOS. \nJust like my last iPhone but faster and better camera!",
            "It was a present for my husband birthday and he really really liked it .The phone looks incredible and has great features .",
            "Great product, recommend!",
            "perfect, amazing, good, love it, best phone",
            "Got phone for the missus for v day she loves it and says it’s best phone yet.",
            "This service is very good thank you for letting me buy this",
            "Easily on of the best phone on the market. Easy to use and the camera I amazing.",
            "Great iPhone size is a little big for complete one handed use but a good compromise between the mini and the max absolutely love the lidar camera and this is the main reason for getting this 3D printing now has a new life",
            "The iPhone 12 Pro is a perfect fit in the hand compared to previous iPhones and the 5G is very fast. Amazing camera as well. A perfect phone.",
            "Excellent upgrade to my old phone, Apple have really levelled up.",
            "I love this phone, was ready to collect straight away. 5/5 stars.",
            "Iphone regardless is very expensive but still best phone in the market who love apple priduct. Camera is amazing .",
            "Nice and easy pick up, ready for collection 2 days earlier than expected !",
            "The phone is very fast and is excellent quality for the price",
            "My iPhone arrived a few days early, pleased as punch. First class service kept me well informed with emails. Couldn’t fault the service I received.",
            "I like this phone! :)",
            "My 3rd iPhone (came from an iPhone 8).\nVery well styled (nice flat style band around the edge).\nThe materials are premium quality, and the handset feels reassuringly heavy (chassis made from “surgical grade steel”).\nThe camera picture quality and AI is superb, especially the handling of low light.\n\nPros:\n- Camera quality\n- Well styled\n- Quality feel and finish\n\nCons:\n- OLED screen not as vibrant as previous iPhones with Super LCD screens\n\nOverall, very happy and highly recommended.",
            "All i want! I recommend this Phone! ❤️",
            "Super fast phone, great bit of kit, shame it doesn’t come with a charger, the cable in the box is not compatible with any old Apple Charger, it’s USB Type C, apart from that it’s amazing phone.",
            "Ordered online and collected next day",
            "I upgraded from a iPhone XR and it’s the best thing I have done. \nAmazing camera. \nVery phone fast doesn’t freeze. \nEverything works well. \nGames are working fine with no freezing. \n\nOnly downfall is you don’t get a plug/headphones in the box no more but not a problem to me.",
            "a very successful phone and a good price",
            "The phone was perfect and impeccable experience with Argos.. order was ready on time and properly packed and handed over.",
            "If your an apple person you will love this, the extra camera really lets you get different perspectives on shots. As always intuitive to use, face recognition not so great when wearing a mask though. Great battery life and more speedy  responses between tasks.",
            "Brilliant phone and the camera is superb",
            "Very good iPhone and it’s price is quite reasonable. \nI can recommend the everyone.",
            "The size is very appropriate \nCamera quality is something one should go for \nBattery life is very good \nPhone is extremely fast\nThe texture of phone is better than iPhone 11 which doesn’t slip from hand",
            "Loving my new phone and glad I can pay monthly",
            "A bit expensive has a lot of storage space and the photo quality is incredible.",
            "Would highly recommend",
            "Really impressed with this. It runs smooth and the camera quality is fantastic- a massive upgrade on my iPhone 8. \nMore importantly, I thought Argos were great and would recommend ordering through them to anybody looking at getting a new phone. I ordered it on a Friday night (maybe 19:30?) and I collected it Sunday morning. The service was exceptional."
        ]
    }
}