{
    "827/2665": {
        "remotekey": [
            "827/2665"
        ],
        "item_category": [
            "The Galaxy Note20 puts productivity and play in the palm of your hands. It's got Microsoft Office integration, so you can create, upload and download documents on the go. You can even take notes with S Pen and convert them to Microsoft Word, at a touch. A pro-grade camera lets you take stunning shots and 8K video – then edit them to perfection. It's serious about gaming too, with console level gameplay and controller compatibility. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "79 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "72%"
        ],
        "review_rating": [
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "3",
            "3",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "2",
            "5",
            "4",
            "4",
            "2",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "3",
            "2",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "19 May 2021",
            "4 May 2021",
            "27 April 2021",
            "21 April 2021",
            "16 April 2021",
            "2 April 2021",
            "30 March 2021",
            "10 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "15 February 2021",
            "23 January 2021",
            "18 January 2021",
            "31 December 2020",
            "28 November 2020",
            "16 November 2020",
            "9 November 2020",
            "3 November 2020",
            "28 October 2020",
            "16 October 2020",
            "15 October 2020",
            "12 October 2020",
            "12 October 2020",
            "12 October 2020",
            "11 October 2020",
            "11 October 2020",
            "10 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "9 October 2020",
            "7 October 2020",
            "30 September 2020",
            "29 September 2020",
            "23 September 2020",
            "22 September 2020",
            "22 September 2020",
            "22 September 2020",
            "21 September 2020",
            "21 September 2020",
            "18 September 2020",
            "16 September 2020",
            "15 September 2020",
            "28 August 2020",
            "28 August 2020",
            "28 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020",
            "27 August 2020"
        ],
        "review_title": [
            "Poor for a top range phone",
            "Samsung galaxy note 20 bronze great phone.",
            "Staggeringly beautiful",
            "Amazing phone! Better than apple!",
            "Camera's Aaaaaamazing!",
            "Best phone I've had since note 9",
            "good phone,  but it's heavy",
            "Working so well",
            "My phone looks superb and brand new",
            "Love the pen with the note 20",
            "Great phone",
            "Really good phone",
            "New Hotness",
            "Fantastic phone but Fragile",
            "Fabulous phone bright camera",
            "Don't buy one, i would not have another",
            "Great Phone",
            "Spectacular phone with just a huge weakness !",
            "Good phone, battery terrible.",
            "This phone is great",
            "Great features",
            "Stylus is great, but phone is too expensive",
            "Notebook & pen!!",
            "Mini computer",
            "Very Slick",
            "Bulky and plain",
            "Great cameras",
            "It's ok nothing special",
            "All day battery",
            "Beautiful camera, miss the fingerprint recognition",
            "Great  battey life, and good camera.",
            "Not happy",
            "Mr",
            "S20 and Note 20 whats the difference",
            "Samsung Note 20 Mystic Bronze",
            "Quality as ever",
            "Good Phone with some good features",
            "A very capable device",
            "Hakan mugulday",
            "Galaxy Note20 Review by Fozzy",
            "Galaxy Note 20",
            "Good phone",
            "Excellent features",
            "My auxiliary missing.",
            "Great device",
            "Battery Life not good. Note 9 battery better.",
            "Great screen and pen",
            "Nothing New",
            "Average",
            "M S",
            "Great features , long lasting battery, love it",
            "Great features",
            "Great phone.",
            "Broke design",
            "Well happy",
            "Bueatiful",
            "It's pink!",
            "Incredible",
            "I love my new phone",
            "Rubbish phone",
            "Dont think About it!",
            "Disappointing battery",
            "",
            "great phone. camera not best",
            "Not the upgrade I expected",
            "Its ok wouldn't have another",
            "Great phone yet the worst phone like ever!",
            "I love my new phone.",
            "Awesomely extraordinary",
            "Bylu214",
            "Galaxy note 20",
            "Great phone",
            "Great phone",
            "I love the note",
            "Amazing and versatile",
            "Nice Upgrade from Note 10",
            "Love it",
            "Its alright",
            "Excellent Phone"
        ],
        "review_text": [
            "Well upgraded from a Note 9 to the latest flagship samsung Note 20 ultra, very disappointed in the phone, although the features are good, the fingerprint sensor on the screen replaces the rear sensor on the note 9, doesn't always work and face recognition is hit and miss, battery life from the supposed all day battery is poor and roughly charging twice a day if using a lot, even though I dont play a lot of games or videos. Phone can lose nearly 10% battery overnight whilst doing nothing not connected to wifi etc.\nAll in all very disappointed with this latest release from samsung",
            "Great looking phone, especially the bronze colour,, full of features,  too many to mention,.good quality and value.",
            "As soon as you see the mystic bronze case, your expectations are set. If it performs half as well as it looks, this is going to be a great phone!\n\nWell, it does. It's a great phone. It's fast, the screen is delicious, the camera is awesome. Memory is HUGE. You can even make it BIGGER if necessary,\n\nThis is the big bronze sexy daddy of phones.\n\nAnd, it has the S Pen, which is next-level genius and useful beyond all expectations.\n\nI would marry this phone.",
            "The only complaint i have is the battery life is not as good as note 10 plus due to 120hz refresh rate but that being said its still an amazing phone! and matches my Galaxy book S, Galaxy watch active, Galaxy buds live, and Galaxy tab s7.",
            "I love all things Samsung. Buds, watches, tablets & phones are just the start. Having had the the Note 8, 9+, 10+ & now 20 ultra 5g I have watched it evolve. And my favorite part is the camera. Battery is great too. I'm sad the end of the note line could be upon us but I know samsung has amazing products so could be the start of a new love. Great phone all around!",
            "So many features.  Good camera ,battery power last longer . And plenty of memory",
            "the phone is good i have a lot of programs but it is quite heavy and burns in size so it becomes uncomfortable to carry it in your pocket",
            "A bit skeptical about it, not sure if I should get it or S21 but believe me have been enjoying it.",
            "Fast and easy to get loved the fast pace of work would give it a 10 out of 10.",
            "It's easy to use and useful with the kids home work",
            "Great phone easy transfer of data good charge very happy still working through all extras",
            "Phone is a good size for watching TV on because of the big screen. The S pen is really handy for writing shopping lists when you don't have pen and paper around and my data transfered from my old phone really easily. Beautiful colour too.",
            "Everything, Ghost just sings with me and I want her more than need her. I do miss having the S-Pen, I put it in my hair and it fell out. I don't think I set up the notifications correctly and I paid the price. Now I don't know if I can get another or if I should get a Pro instead. I want to find Ghost's Original Pen because it's a part of her.",
            "I am a long time aficianado of the note phones and indeed in love with Note 20 Ultra  . However , it breaks my heart to state that the phone is fragile along the curves and the back glass broke on its first drop at an angle.",
            "Lovely phone fabulous setting on the phone",
            "This phone is rubbish, just a waste of my money my moto g6 worked much better, this phone has freezed 4 times just trying to write this review Close and reopen to carry on using the page. And if you use WhatsApp video call and then use youtube the video call can hear it all if not that then echoing and static noise, having the microphone and the speaker rite next to each other on the bottom of the phone dose not work. This is why I don't like this phone  there is a battle or speaker and microphone  people moan they cannot hear you just using WhatsApp video and nothing else or other video call apps. And for the first time owning this phone it over heated and all the phone was being used for was youtube cast to tv and video call iv never had that from a phone in my life don't worry about camera I want to do the basics properly and I can't have a good video call. I pre ordered this and the ear buds still never turned up received all emails confirming but nothing",
            "Fast and long life battery... great!!!!!   Love it!!!!!",
            "Battery life needs to be %30-40 better thn this note 10 users are even complaining !\nBuy a flagship and spend your much time to understand to extending your battery life.\nPay much use with control 120 hz is a battery killer ! \nPut dark mode put battery save mode turn off all fancy specs then use it all day !\nWhen I have a easy access to plug I am playing with my phone confidently !\nHeard that there is an update released in Germany wish to receive it in UK for Snapdragon version. I could kill myself if I bought exynos one !\nYou know what yes battery should be better however you have broke my excitement have waited for months like a kid to buy this phone at the end I am just focusing to battery percentage during the day with wishing to make it better !\nRegards !",
            "I have had every note in the series, And I have enjoyed all of them. However!! this time I have to say that the battery is terrible, it isn’t a secret that the USA version is using the snapdragon 865+ which is far better than the uk version. Uk uses the exynos 990, this really does make the phone less fast and makes the battery terrible... almost 1hr difference of screen on time between the two versions. \n\nThat being said!! The camera and the screen are this phones saving grace. BUT!! I still cant recommend this phone, even tho if I’m still keeping mine until next year. Then hopefully samsung will stop using the then own chipsets.  Please just use the same chipset in all of your devices.",
            "Had the phone a few weeks now, it is really easy to use, the set up was quick qn easy, an transferring all content from my old phone was a walk in the park, the phone battery is great, the display when streaming movies is amazing also, not had any issues what so ever, currently very happy with the purchase, I would recommend to anyone.",
            "How do I get my earbuds?\nI had a plan with my telco provider",
            "I love having a stylus and this one works better than ever, However, I would prefer it to have been on the right hand side. The worst thing about the phone is that the fingerprint reader is in the middle of the screen and I have wasted money on screen protectors which prevent it from working. Samsung doesn't offer one. Of the two Note 20s I bought, both got scratched within a week. Now I have screen protectors that prevent the fingerprint reader working, also preventing me using Samsung Pay which requires a fingerprint.",
            "I love that I can write notes any time with my Samsung built in pen. Great for shopping list etc. Really nice sized screen too. Love it!",
            "I love my new phone it is powerful and quick. It is easy to navigate and Samsung have been able to slim line some of their software.\nHowever, they do seem to have changed some features which have caused me a little bit of hassle, e.g. with the calender and email you are now not able to delete accounts from here you have to go into the settings. I would also like Samsung to look at there calender system and make it a little more integrative. \nThe films and games on this phone are awesome, there is no let down on the quality.",
            "Its fast processor, Great screen, Easy to use and seems perfect",
            "Heavy cumbersome handset, not very inspiring. Camera auto focus is slow and seldom gets it right. My A40 was faster and more responsive",
            "Overall a Superb multi functional phone, which I would highly recommend.",
            "The phone signal is terrible changed the aim 3 times, poor signal everywhere. Can't be the mobile company. Money wasted",
            "Ease of use and all day battery life,love the picture quality on screen",
            "Love the design, ease of use and camera quality. I dislike the movement of fingerprint recognition. As the fingerprint is now on the screen, the screen protectors have an unflattering circle cutout. The fingerprint cannot be read when a screen protector is on which I find frustrating. The phone is otherwise perfect",
            "It takes great photos, even in ths dark. Editing is easy to use.",
            "I have bought Samsung products for years and  I have be very happy with all my purchases so when I upgraded my phone to the note 20 I was hoping for a great experience but I have been so deflated with it that I regret buying it ☹",
            "I love the pen features always had note phones.\nSamsung are awesome.\nDoes everything I need and more.",
            "Apart from the pen and the price I really don't know whats different. The Note 20 looks cheap and feels cheap\nWish I'd kept my S20 and saved myself some money",
            "Always had Samsung...\nLast Phone Note 9\nSo Up-Graded to Note 20\nIn Staning Mystic Bronze\nFind Samsung User friendly \nS - Pen very nice \nDefinitely an improvement from Note 9\nGot the LED Cover \nLooks so Nice",
            "Samsung quality throughout qwertyuipolkjhgfdsazxcvbn",
            "I believe that the phone is good however the pen is pointless unless you want to cover. You cant draw on documents and go page by page instead you write on a screenshot. Also have problems with connectivity and phone calls as mine doesnt ring. Overall brilliant phone no issues",
            "Very capable device with excellent features. Excellent screen with good resolution. Device is reliable with good connection speed.",
            "I love my new galaxy note 20 everything working very fast and photos and videos and battery life so good thanks samsung make it new note 20 super phone. I'm ever seeing",
            "its easy to handle and operate, but also easy to damage if dropped or hit against anything hard, left in pocket etc and expensive to repair maybe the costs involved in damage repair can be assessed for clients.",
            "The phone offers me what I need, I have not yet checked out all the features so cannot comment on them.",
            "So far love it,  all features are good  and I love the pen . The only problems I've had is finding a case that accepts fingerprint  recognition and still allows me access to the pen . But that is not a problem with the phone. Overall I think its great.",
            "Great screen,  s pen brilliant,  excellent camera, great v fast recharge",
            "I love the feel of it. It is sleek and the applications are awesome. The only downside is you have taken away the auxiliary pin hole we are commonly used to. That application is important and having it missing just dampens my mood.",
            "I didn't have Samsung mobile device since years as the quality was below my expectation, but I wanted to try the Note 20 as I had good memories with my Note 3 (which is still works without any problem). I have to say that was the best decision ever, I love it inside and out, no technical issues, great camera. So I can recommend this phone with full heart.",
            "I LOVE the camera, the S pen and many other feature. However, whether its a fault feature in this phone, I am struggling with the battery life. I am having to charge the phone multiple times per day, and have apps such as spotify or facebook messenger not always working. My friend has the same phone, and faces 0 issues with her. I have always been a fan of the galaxy note series and was incredibly excited to recieve my note 20, however I feel incredibly let down by the battery life which I imagined would have been equal to my note 9 at 2 years old, or better.",
            "Love the clarity on the display screen and the 'Note' pen features",
            "In all honesty I wish I'd held off for something else. Not really seeing any difference with the Note 20 to my note 9. Quite disappointed !",
            "Its ok.  Not as good as the note 9! Wish i had gone for the bigger screen as this too small.  Camera no where near as good as expected with wishy washy results.  Overpriced for performance.  Battery not lasting as long as expected, especially when recording and putting together a quick video. Quite disappointed but sadly have to put up with for 2 years.",
            "This is the second Note I've had and they are easily the best phones out there",
            "I love how great the picture quality it and video quality, everything about it is great, and cant fault it at all.",
            "Always bought galaxy notes since they first came out",
            "Great phone, I only wish I knew a teenager who could teach me to use it to its potential..!",
            "There is a portion of the screen where the s pen stop working and I expect more from a premium phone",
            "Brilliant !!\nJust wish fingerprint sensor was on the back and not on the screen, bought many a screen protector which said they work with sensor and don't,  other than that gripe fantastic",
            "The phone looks amazing , feels amazing and is amazing . Only issue is there's no curved screen. Other than that perfect",
            "If you don't like pink then get a different colour in this particular phone. Its described as mystic bronze, fancy wording for pink. \nOther than that great phone.",
            "I've recently upgraded from a note 9 plus to the new note 20 ultra in bronze colour. I had to pre order it but 100% worth the wait! Having 5 big dogs I will always buy a phone for its camera. And this DOES NOT DISAPPOINT!! I've never had a phone that captures such amazing photos and video. From the night mode, to the short clip just before you tap the capture photo button, the dogs will always move just as I take the photo. But with that setting I can still get the perfect photo! to the 50x zoom.  Which at 50x zoom the photos are still crystal clear. Unlike any other phone I've ever had. To the clear photos, details and colour. I CAN'T FAULT THIS CAMERA!! \nSimply A... maz....ing! \nI JUST LOVE LOVE LOVE THIS PHONE!!",
            "It's an amazing phone, with all the features what you need and so fast. I used to had a problem with Bluetooth connection on my old phone it was very slow. Since I changed to this I have no problems. And before I always had to carry a charger with me as I couldn't make it through the day with one full battery but not any more. I just love it. Perfect size, beautiful design and a great samsung model!",
            "Previous phone - Note 9. New one - Note 20 not bigger Ultra. \n\nPros : \nDual sim and stylus.\n\nCons :\nNote 20 feels cheap but it's supposed to be a premium phone.\nFingerprint in screen sensor is very slow.\nPoor screen resolution. \nCamera bump is huge so if you put the phone down it wobbles and is not stable.\nNon expandable storage.\nIt started slowing down and freezing already after nearly 4 weeks of use.\nNO AUDIO JACK ! \n\nI honestly wish I kept Note 9. Had to change it because speakers started making crackling noises. Didn't want to repair it so bought a new one but nowadays new doesn't mean better.",
            "Always loved my notes, each time more reason to buy! Absolutely fantastic camera with beautiful caption,",
            "Battery is poor for the price I have to charge it twice a day which isn't ideal",
            "A present for the wife. She is over the moon with it.",
            "over all the phone is great but seem to have a lot of issues with camera focusing and also the 50x zoon also isnt best. seems to be very unfocused on certain objects and night photos, stars seem to have blur really badly and looks as thought they are smudged. had to many problems with the camera overall and havnt had the phone a week yet.hopefully they create an update to sort this phone otherwise definately not worth the excessive amount being paid.",
            "I bought the Note Ultra for the cameras, S Pen and hopefully more sensitive antennas for voice and data - I haven't noticed any improvements in reception - \"no signal\" areas have stayed the same.  Occasionally, I have to restart the phone to get 4G/H+ data speeds.\nHowever, the cameras were the main reason I upgraded and I am very disappointed.  I took a picture of my small garden through the window as a first photo and it was out of focus when I pinch zoomed - in the middle of the day.  This is the first upgrade where I wish I had stayed with my last phone - Galaxy S9+.  Will Samsung be improving the cameras soon (including focussing and photo detail) - I have tried numerous shots of different scenes.",
            "I was expecting better as its spos to be the best, however I'm sure there is a flaw on this phone with the speaker on the bottom of the phone being 10mm from the microphone, if you use WhatsApp and watch a video on YouTube at the same time the person on WhatsApp can hear everything if not then it just echoes so its iva one or the other. My moto could do two things at once also this phone spends most of its life on charge i order pre release and still never got the earbuds, and this phone likes to freeze close the screen start again  on YouTube, Google  you can be looking thru then it just won't do nothing bit like Windows 95 that is disappointing because its not once in a blue moon its a cup times a day only one app open YouTube or Google then freezes im not ask a lot of the phone  I don't use half of what is capable of and it struggling on little things.  but the freezing an the echoing from WhatsApp and YouTube its just terrible when my moto g6 done it all problem free and this struggles going through Google home page. But the biggest fault I don't like its the echoing between WhatsApp an YouTube so you have to use one app or the other, at least with the moto you could have WhatsApp video call in the corner of the screen listing to them quietly and listen to YouTube at a lower volume or a higher depending on what app you wanted to have the highest volume and it worked lovely, but this phone doesn't its just a lot of echoing and sounds, I do hope it gets sorted and its not a defect because apart from that I'm happy with everything else on the phone",
            "Phone amazing, was so excited to get it, but tired out my cousins one before putting up a ridiculous amount of money which i was will to put up. I had it for 1 day. Only to find out we got the worse chipset in the UK which which i take offence to, Can't empasise how offensive it is to charge someone these sums in different countries claiming its the same product but its not, they should call the UK one Note 20 lite. What a CON. Also the phone charges really slow compared to the Huawei I have right now, Actually probably slowing charge i think there is on any phone right now. Talking of battery it doesn't even last all day and think it overheats. OMG how desperate I was to move back to Samsung only to be disappointed like this! Rest of the stuff was unreal!",
            "The new Samsung Galaxy Note 20 is the perfect phone for me. Excellent camera. I'm a Samsung user, so I new what to expect generally. Now I've got it, I love it.",
            "So somple while its about sharing data .faster then old Samsung",
            "So far I'm loving the phone. It has so many features it took me a little while to wrap my head around it but that makes it better.m",
            "Great phone I upgraded from the note 9 to this and  it is as good as my previous phone",
            "My first Note and I love the pen! \nAll round great phone",
            "The features and usability of the phone are great. The quality of the screen is brilliant.  The camera is very good. Much better finger print reader compared to previous devices. Screen resolution is fantastic. \n\nVery disappointing battery life. I did reset and used it without any of my apps and it was outperformed by a three and a half year old iphone  7 and a 2 year old Huawei P20 by miles..",
            "I love the note. All that i need in 1 phone. I won't buy any without a pen. A pity the charger has changed again. But then again most people will use the wireless charger now.",
            "I love the ability of changing between keypad and writing. The picture quality is excellent. Just what I need.",
            "As with the Note series of mobiles from Samsung, this next generation feels like a premium device.\n\nYes it may have a plastic back cover instead of premium glass, but I have a cover on the back of my phone so it doesnt really bother me.\n\nPlus points are the screen now being flat and no curved edges anymore, control buttons on the correct side of the device now (right hand side). \n\nIt does lack the microSD expandable memory, and Samsung have scrimped a little in the box with no usb adapter or extra tips for the s-pen.\n\nOverall better camera and better battery more than make up for the slight shortcomings.\n\nAnd a bonus was the Samsung Upgrade Programme, which is pretty much like a car PCP agreement but for phones.",
            "Front cam focus is a bit weird sometimes but overall a good phone",
            "Going from the note 8 to this phone is better but from reviews online and the way different specs is obvious that it's a slightly improved note 10+",
            "Amazing phone and nicely updated from other Samsung phones"
        ]
    }
}