{
    "753/2571": {
        "remotekey": [
            "753/2571"
        ],
        "item_category": [
            "Experience the unparalleled visual power of TCL 10 Pro. Transform your media viewing with NXTVISION visual technology. Immerse yourself in media with an FHD+ curved AMOLED display and capture moments day or night using an exceptional 64MP AI quad-camera system. Accomplish without limits using TCL 10 Pro's powerful functionality with a Qualcomm Snapdragon AI Engine, 4500mAh battery and intuitive TCL UI interface for ultimate work or enjoyment. Stay balanced with a design that merges modern symmetrical sleekness with the beauty of nature. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "11 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "91%"
        ],
        "review_rating": [
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 March 2021",
            "13 October 2020",
            "6 October 2020",
            "4 September 2020",
            "25 August 2020",
            "5 August 2020",
            "29 July 2020",
            "28 July 2020",
            "22 July 2020",
            "22 July 2020",
            "9 July 2020"
        ],
        "review_title": [
            "Great phone for the money !",
            "Tcl10 pro",
            "Not the best",
            "A great mobile phone",
            "Absolutely brilliant phone",
            "",
            "Great medium range phone",
            "Fabulous bargain phone",
            "Beautiful",
            "Great phone",
            "Everything is faster to get it"
        ],
        "review_text": [
            "Very high quality specification and build for the price tag.",
            "It looks great and performs very well. Maybe the fingerprint reader fails sometimes, but it could be a matter of damaged skin on the thumb :). It is a pity that it does not support inductive charging. The screen is great. Works without jams. I recommend.",
            "Very unresponsive and fingerprint scanner not very responsive either",
            "A great mobile phone, with a nice design.\nOnly problem was curved screen, which can cause fingers type on screen holding mobile phone.  Battery life's great, and it seems charge pretty quick.  Camera also works great, although I've not tried all features",
            "Brilliant phone bit like a Samsung only cheaper latest software good battery and can control TV with infrared remote and 128gb plus expandable memory what's not to like",
            "Very nice mobile!!!!",
            "I have been using the basic Galaxy phones for some years now and decided to go for a mid range phone. The TCL 10 Pro fitted the bill perfectly. Very fast browsing. Apps run well and are super responsive. Camera is great with many features including the low light setting. Switching brands was a worry but settings and data copied over seamlessly. One concern is lack of moisture resistance, but I don't  use my phone in the bath and have insurance .Overall would recommend the TCL 10 Pro. I love it !",
            "Excellent quality & performance for a bargain price. First ever cell phone by TCL and and really levelled with the leading brands.",
            "can't fault this phone , its an unknown beauty , its functional , sleek and a real pleasure to own",
            "This is fantastic phone. I know TCL TV but I would never thought about phones. People are concentrated on Samsung, iPhone, Huawei etc.but you can get excellent phone for less money.\nScreen is very bright, good battery life. Super quality.",
            "I like to buy Argos And helpful"
        ]
    }
}