{
    "943/6943": {
        "remotekey": [
            "943/6943"
        ],
        "item_category": [
            "Experience super-fast 5G speeds with a high-performing eight-core processor of up to 2.4GHz CPU frequency for smooth performance. OPPO's proprietary 30W VOOC Flash Charge combined with a large battery allows you to power up quickly. A super low-power mode allows your phone to intelligently standby overnight with little power consumption, using up only 1.78% battery over 8 hrs. The AI camera recognizes 22 types of scenes and intelligently applies scene enhancement algorithms for instantly optimized photos so you can capture beautiful photos. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "15 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "22 July 2021",
            "23 June 2021",
            "10 June 2021",
            "9 June 2021",
            "8 June 2021",
            "2 June 2021",
            "1 June 2021",
            "1 June 2021",
            "1 June 2021",
            "30 May 2021",
            "28 May 2021",
            "28 May 2021",
            "27 May 2021",
            "26 May 2021"
        ],
        "review_title": [
            "Awesome and super fast!",
            "Good value",
            "Phone",
            "Great phone for the price range",
            "Awesome value and a great all rounder",
            "Great phone",
            "Great features",
            "Surprisingly Brilliant!",
            "A lovely reliable phone",
            "Good Battery Time and Great Looking Phone",
            "Amazing",
            "Amazing value for money !",
            "Smart",
            "Really interesting phone",
            "Great camera, bery fast easy to use phone"
        ],
        "review_text": [
            "Awesome and super fast!",
            "Bought this phone a month ago and its performance matches higher priced competitors. It looks good, is light, the display is bright and has speedy operations. Not had the chance to check it out for 5G because availability is still limited. The camera is good but not top notch.",
            "I bought phone it’s good and quality.",
            "[This review was collected as part of a promotion.] This is a excellent phone for the mid-range market. Lacks some features you would expect from a flagship phone, but is great value for the price.\nSome of the good features: Screen is nice and crisp - includes an in-display fingerprint reader and a hole-punch front camera. The back of the phone has a nice two-tone finish, which shimmers in the light. It can accept up to a 256 GB microSD, so no storage problems. 3.5 mm headphone port is included!\nSome bad features: No wireless charging, only one speaker, plastic back.",
            "[This review was collected as part of a promotion.] I love the look of this phone. It's thin, lightweight, sleek and feels good in the hand. I've used many phones in my life and this is up there with how it feels to hold. The buttons feel solid and well positioned and the phone overall definitely gives the impression of being more expensive than it actually is.\n\nThe display is a large 6.43\" AMOLED and I found it to be vibrant and clear. This works well with the camera system, which consists of a high MP main camera, ultra wide camera and the macros. The photos are of a good quality and details are well captured. The video is also decent and I like the dual view video feature it has, allowing simultaneous recording of the front and back cameras in one.\n\nThe speed is not the fastest I have used but it isn't a slouch and it more than handled most games and apps that I threw at it.\n\nWhen comparing this phone to others you need to take into account its very reasonable price point and where it is positioned in the market. I think this phone is fantastic value and gives you a high level of performance and features at a fraction of the price of more expensive competitors. I have no hesitation in recommending this phone to others.\n\nThis is my first Oppo phone and I will definitely look at their phones again in the future.",
            "Great phone, value for money. As a mid range phone, this is probably the best! Google play store, great camera and a free case!",
            "[This review was collected as part of a promotion.] Wow. There’s a lot here on this phone for not a lot of money. It feels hi spec in the hand and a premium product. The speed is second to none. The camera and options are awesome. Reconsider you normal choice and check out this….",
            "Purchased this a couple of weeks ago as my Galaxy S10 failed on me and I needed something quick! \nDidn't expect much from it, infact I was already looking at £700-£800 handsets for when I took this one back!! I don't need to take it back.... it's brilliant! It's a great mid-level phone with a budget pricetag.\nGreat battery life, awesome quick charge, crisp display, great camera and above all else it makes calls and sends texts & WhatsApps! Hasn't lagged out on me yet and I've no complaints! I'd definitely recommend.... don't let the fact that it's not a Samsung put you off!",
            "[This review was collected as part of a promotion.] I have been using the OPPO now for a few weeks, did not want to spend a large sum of money and what a deal. This is a fantastic phone and the price just makes it even sweeter. The quality especially for the camera is sureal, you have definitely won me over and yes would definitely recommend it.",
            "[This review was collected as part of a promotion.] I've been using my OPPO A94 5G Phone for the last couple of weeks and I am pleasantly surprised with how quickly I have got accustomed to it considering I have always opted for another specific brand for the last 10-12 years. What I really like about this phone is the Battery Life and the super quick charging time. I went into Central London yesterday and was using my phone constantly during my journey for various things yet when I returned home in the evening, I still had a significant amount of battery charge left. One of the nice added benefits of opting for this phone is the fact that you get Headphones and a Charger, and I love the fact that they still use the traditional standard 3.5mm Headphone Jack.\n\nI tend to use my phone for either social media or watching YouTube or movies and so screen quality and sound is important to me. I felt that the screen quality was good, but I was a little let down by the sound quality and I think having a speaker on both ends of the phone would probably help with this. The dual view video mode is something I haven't got round to using yet but knowing that I can record in split-screen mode is a handy functionality and will enable me to be more creative with my social media posts.   \n\nIn my area the 5G signal isn't great so I couldn't use the 5G indoors although I appreciated when I was able to get 5G Signal in the surrounding areas and it's a good added functionality to future proof the phone as it is definitely faster than current 4G Speeds. The design is nice and simplistic, and the screen size is perfect, the phone just about fits into my jeans pocket.  \n\nAll in all, I think this is a good starter phone, I'd class it as mid-range and would definitely think it's great value for everything that you get packed into this device.",
            "[This review was collected as part of a promotion.] I was dubious about this handset as it’s a brand I haven’t heard much about and also in the more budget range. I can safely say I was surprised with it. Really impressive piece of kit. It’s really quick when switching apps and doing different activities on. The battery is also brilliant. So far I haven’t been able to find a single issue with the handset and to say I’m impressed is a understatement. Would definitely recommend for anyone who wants a decent fast phone for a fraction of the price of the big brands. Fully recommend",
            "[This review was collected as part of a promotion.] WOW! This phone is absolutely amazing value for money !,\nWith 8gb of ram and 128gb of memory you really can’t go wrong with how much this device costs, it’s got a quad camera which all work combined together to give you a perfect picture every time you want to take a photo of your self or the family, comes complete with a case included in the box aswell to prevent any damages if you were to drop this phone, the colour looks really nice and sleek, this device runs on Android so the same as other manufacturers, there’s not really many bad points about this phone other than the brand it self isn’t such a well known brand but people need to know about them because they put such power in a phone for such little cost which is great!, the back of the device however if you weren’t to have the case on would probably slip out of your hands which is the only downside I could find after using this phone for a few weeks, I would definitely recommend giving this brand a try and definitely this phone it’s self as I was shocked by the quality and also the speed when trying to load webpages and apps! Perfect!",
            "[This review was collected as part of a promotion.] Love this new OPPO smartphone! Has a cool desing, great call quality, dual sim and sd card slot and awesome big screen for gaming/Netflix. Charging is quick (about 30mins) and the battery life is amazing! It feels good in my hand, the screen quality and sound is excellent. Its very responsive and the camera has an excellent details. Overall Im very pleased with it so far and I would highly recommend to everyone!",
            "[This review was collected as part of a promotion.] Having never heard of this brand let alone phone I was interested to try it out. I'm very impressed, the camera is fantastic and the phone is so responsive. The 5g gets really good signal. Despite not being a huge name in the UK I would highly recommend this brand.",
            "[This review was collected as part of a promotion.] Love it, picture quality is amazing, takes smooth sharp pictures in any lights, phone is easy to use and hold, great speed and very responsive to touch"
        ]
    }
}