{
    "848/0732": {
        "remotekey": [
            "848/0732"
        ],
        "item_category": [
            "iPhone 12 Pro. Superfast 5G. A14 Bionic, the fastest chip in a smartphone. Pro camera system for next-level low-light photography. It's a beautiful leap forward. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "58 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "98%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4"
        ],
        "review_date": [
            "30 July 2021",
            "23 June 2021",
            "2 June 2021",
            "24 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "28 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "7 April 2021",
            "6 April 2021",
            "6 April 2021",
            "1 April 2021",
            "31 March 2021",
            "31 March 2021",
            "27 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "18 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "11 March 2021",
            "9 March 2021",
            "3 March 2021",
            "25 February 2021",
            "25 February 2021",
            "24 February 2021",
            "23 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "10 February 2021",
            "10 February 2021",
            "10 February 2021",
            "10 February 2021",
            "3 February 2021",
            "29 January 2021",
            "27 January 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "20 January 2021",
            "20 January 2021",
            "14 January 2021",
            "13 January 2021",
            "13 January 2021",
            "12 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "4 December 2020"
        ],
        "review_title": [
            "Great phone",
            "Slim n fast",
            "Amazing",
            "Great features",
            "Great purchase",
            "Iphone 12 pro",
            "Continued performance",
            "Iphone 12 pro",
            "Very fast and sleek phone",
            "Awesome phone very quick",
            "Great phone",
            "Lovely mobile ,",
            "Good",
            "Superb",
            "Quality with everything",
            "Exactly as expected",
            "Total change",
            "Great Great product nice I phone",
            "Exceptional",
            "Yeah, I am in love with my mobile",
            "Excellent phone feels great to hold",
            "Best IPhone to date",
            "Very fast",
            "Perfect",
            "Great phone for \"great\" price",
            "Outstanding phone",
            "Takes a bit of getting used to",
            "Excellent",
            "Best phone ever!",
            "Color",
            "",
            "Great looks, amazing camera",
            "Amazing camera",
            "Fab Phone",
            "Nice Phone",
            "Best phone I’ve ever had",
            "Best phone",
            "Not had time to fully explore the functions yet",
            "",
            "Great phone",
            "Hastle free",
            "Its good for gaming and it runs fast and better",
            "",
            "It is an amazing, fast, great piece of technology",
            "Iphone 12 pro looks fab",
            "Amazing phone",
            "iphone 12 pro",
            "Everything ok",
            "My kettle looks fab & boils fast",
            "",
            "Love it!",
            "Fab phone",
            "Delighted with my iPhone 12 pro",
            "iPhone 13 pro",
            "Great upgrade from X",
            "iPhone 12 Pro upgrade",
            "Perfect phone",
            "Is not that Good haw much they advertise on TV"
        ],
        "review_text": [
            "I bought this phone 1month ago and it is a fantastic phone . I would recommend this to my friends",
            "Very nice phone with great features,  high speed",
            "Bought this phone 2 weeks ago.\nThe delivery was next day, very well packed and secured.",
            "I bought this 10 days ago it was looking good and stylish. The product is awesome and i suggested my friends to look",
            "Very happy as it was available and very smooth delivery.",
            "I am really happy with the quick service",
            "I like the way Argos have tech equipment at a good price and ready for delivery",
            "I bought my phone with you and i am very happy",
            "I received this as a birthday gift. The phone is very sturdy, and the new Ceramic Shield screen ensures that the phone won’t break or the screen won’t smash if dropped within reasonable distance. It’s also a lovely colour that looks unlike any other iPhone colour before. My only issue would be that the shape makes it hard to find sturdy cases that’ll fit.\nThe camera quality is fantastic, shoots in 4K and up to 60fps. I’d definitely recommend the pacific blue colour as it’s very futuristic.",
            "Great handset. High quality and very fast.",
            "Very good phone, love it",
            "1- Very fast phone \n\n2- got very strong signal receiption , \n\n3- The best phone ever regarding \nthe Dowloadingg  and sharing the hotspot",
            "It was good it works good",
            "Best place to buy stuff like iPhones easy and simple checkout.",
            "As you'd expect from Apple this is a quality product with great functionality.",
            "Fast and efficient same day delivery (preferable to other online shops). Phone is great. Upgraded from iPhone X, so slightly bigger screen. The square edges have taken a bit of getting used to, but match my iPad Pro too. Need to get a case to avoid inevitable scratches...",
            "Always been on android but had to change due to compatibility issues with some of my other tech.  This device works flawlessly. Connects to everything without issue. Feels well made and sits in the hand nicely.  \nHappy with the change so far.",
            "Great product nice I phone",
            "Everything was amazing from ordering to receiving it the next morning! The phone was brilliant as is usual with Apple but am most impressed with Argos service! Thank you",
            "love this item and also good service",
            "Far better that they have gone back to a phone you can hold properly",
            "Excellent Phone with great features he camera is very good",
            "Excellent phone and well worth the money. First iPhone and it definitely lives up to the standard",
            "Thank you very much I really love to buy anything from Argos! Is the best! \nThank you!",
            "This model returned to old style Iphone 4-5 with rectangular edges. Overall photo and video quality after my Xiaomi are extraordinary.",
            "Great phone, delivered same day and on time.....excellent.",
            "But once you get used to the there being no home button there’s no problem . Colour is perfect glad I waited for the blue and it’s a lot quicker than my old iPhone . Even though it’s smaller to hold there’s more screen view than my 8 plus which is a bonus. Only downside for me at the moment is the facial recognition. I keep forgetting I have a mask on when trying to use Apple Pay",
            "10/10 to this phone.                  .",
            "The camera is amazing! Best phone ever so far!",
            "I was skeptical about the silver color but it turned out to be not as silvery as i thought it would be but it has a light silver tone to it. i like it.",
            "After iPhone 6s, this is absolutely perfect",
            "Great service from Argos. In stock and quick pick up. Amazing phone. One of the best ever",
            "Great phone. Gorgeous colour. Easy access with Face ID and incredible camera",
            "iPhone 12 Pro 256GB Mobile Phone Graphite\nGreat Phone and great new features.\nPleased at the size and price of the New iPhone 12.\nGraphite colour matches my MacBook - Worth more than a look.",
            "Very good phone. I bought it as a gift for my wife and she loves it. It was frustrating to not be able to migrate from her android phone to this iphone and even after paying for third party apps, still could not migrate, This is a big problem. Reason, I would not consider getting myself an iphone.",
            "Was hesitant at first to purchase this phone as it isn’t exactly the cheapest on the market, so glad I did though. It’s by far the best phone I’ve had and do not regret buying it one bit. Purchase was super easy with click and collect through Argos and was even able to pick it up within about an hour of purchasing it. Couldn’t be happier!",
            "Best phone on the market.",
            "What I have used so far on the phone works as well as I expected. The phone seems robust while not being too big or heavy. As usual for Apple it is well made and intuitive to use.",
            "Good and quick service .",
            "Great phone easy to use. Lovely colour. Was able to collect next day",
            "Hastle free, no other words",
            "It’s better than my old devices. I play mobile games init and its gooooodddd ❤️",
            "Very good phone. Battery is good, nice design .",
            "There is no issues at all with this phone I myself would believe it’s the best on the market when it comes to software camera and the experience of it. There is a lot of pros such as it looks great the colour and finishing is immaculate, works very fast it literally all you could want.",
            "Great package and i am happy with the next day click and collect system and i have to pay in 6months installment so very happy with that scheme aswell..\nI would love to buy more stuff from argos",
            "Very good phone, design is amazing. Thanks to Argos for a very great service.",
            "It's okay blue color is amazing",
            "All ok \nNo problem\nI receive my phone very fast",
            "Its Good,i like this phone",
            "Its a beautiful phone .",
            "This phone is so much better than my xs max. It fits my hand perfectly So pleased I made the change to a smaller phone.",
            "Phone was only available with Argos soon. Arrived on time",
            "Delighted with my new phone, an investment, but well worth it.  Just not having to worry about running out of memory is peace of mind, in the world we live in today when everything is an app.  Easy to use and set up.  Argos was also one of the few places that had them in stock too.",
            "This truely is the best iPhone ever. I’ve had many iPhones over the years and this tops the lot ! Great phone great camera very quick and typical good apple software ! You won’t regret getting this phone !",
            "Happy with the upgrade from my iPhone X, as always there’s a few silly niggles as with all new iPhones. Plenty of features and a great set of cameras but a few things missing compared to android counterparts ie reverse charging...",
            "After deliberating between the 12, 12 Pro and 12 Pro Max, I decided with the balance of the quality of the materials along with the screen type and size, ergonomics, camera quality, battery life and future proofing feature sets, I decided that the 12 Pro would be a good balance and value for money. \n\nIf you have an older model (in my case, the first generation iPhone SE with 32GB), this is a worthy upgrade.",
            "Brilliant phone like you always with Apple. Only downside is, no charging plug in the box and the old USB plug off the previous phone doesn’t fast charge it with the new cable",
            "Do the price you paying is not worth that much"
        ]
    }
}