{
    "910/3269": {
        "remotekey": [
            "910/3269"
        ],
        "item_category": [
            "The OPPO A15 packs a punch with a versatile triple rear camera up to 13MP. A large 6.5\" display for ease of use and fast 3GB RAM And 32GB storage to keep all your important files safe. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "32 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "97%"
        ],
        "review_rating": [
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "21 July 2021",
            "21 July 2021",
            "9 June 2021",
            "8 June 2021",
            "1 June 2021",
            "1 June 2021",
            "23 May 2021",
            "19 May 2021",
            "5 May 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "15 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "31 March 2021",
            "23 March 2021",
            "17 March 2021",
            "16 March 2021",
            "10 March 2021",
            "3 March 2021",
            "3 March 2021",
            "3 March 2021",
            "24 February 2021",
            "17 February 2021"
        ],
        "review_title": [
            "Easy to use",
            "Good phone",
            "Fantastic",
            "Lovely phone",
            "OPPO A15",
            "great features",
            "Excellent features in entry level smartphone seris",
            "Miss",
            "Soo amazing features",
            "Good phone, for a good price",
            "",
            "Great Features",
            "I bought this phone it's brilliant",
            "One of the best phone",
            "Excellent value for a android phone",
            "Perfect for the price",
            "Super phone.",
            "This phone is the best.",
            "Works perfect amazing camera and screen huge",
            "Good phone.",
            "Phone was better than expected",
            "Ideal for my 11 year old",
            "Nice phone",
            "Good for money",
            "Looks ok and performs as should",
            "Its connected easily",
            "Fabulous phone",
            "Great phone",
            "Amazing",
            "Fab looking phone",
            "Oppo A15 mobile",
            "Good mobile. Loved the design."
        ],
        "review_text": [
            "I bought this phone for my mum and she’s is really happy with it actually good quality she using mostly YouTube and the phone is a good size and easy to use.",
            "Good phone. Great value for money. Big screen and long battery life",
            "I bought this phone for my partner and it's brilliant",
            "I mainly use it for gaming as my other phone is good for other things but not gaming so I now have a good gaming product plus a fabulous camera excellent phone",
            "I bought the Mystery Blue version and very happy with the phone. Very satisfied.",
            "The phone is very stylish and modern it has an excellent responsive touch screen the sound and the picture quality is very good its packed with features that are easy to use you can also add extra storage to the phone for more memory it connects easy to your wifi and gadgets",
            "Excellent battery life and good example of big features in lesser price and phone build quality is also one of the highlight , nothing to complain as of now",
            "This phone does everything you need it to do and more, amazing battery life, great quality camera , would recommend",
            "Sooo good works vv well.nice apps",
            "I like this phone , don't need an expensive one I only use it for calls and YouTube .I like its colour,battery ok , my favourite mode while taking pictures is \"portrait\"",
            "",
            "I bought this for my son and my 83 year old aunt and they are both he ivery happy with brand. My aunt is recommending it to all her friends because she finds it easy due to the features and my son is enjoying all the features that comes with the phone. Good phone for the price.",
            "I bought this phone for my daughter she usually used iPhones but I got a oppo a few months ago and she loved it so easy to use",
            "The phone has amazing features. The size, colour,  battery and camera are the best. \nI love my phone!",
            "Well worth the money and extremely happy with the phone.",
            "Good picture will recommended it",
            "The oppo A15 is fantastic,it can do everything just as well as all the other phones you get on the market, well made slim,and the colour is great, 10/10. Highly recommended it ,,",
            "Very happy, got all necessary function smart phone should have and more. Definitely will recommend to anyone.",
            "Phone is amazing screen is great battery is amazing best battery yet and I have always had iphones always but this is amazing.",
            "Tidy phone for the price  good camera. Good battery life.",
            "The phone was great better than expected. Battery life is great last days",
            "I bought this my my 11 year old, and its ideal. \nI'm actually quite impressed with it, and would consider getting myself one.\nThe mystery blue is a lovely colour.",
            "Great cheap phone, does all the phone stuff you'd expect, feels more expensive than it is.. Good quality and well built. Hope this one last longer than a year as my kids seem to destroy phones for fun.. TBC.",
            "It's ok for the money but I don't think it's anything special also the battery life is average, one thing to be aware of the theme store is not available in UK which is one thing I bought it for so bit disappointed there , not a bad device by any means but it's average. Think I'll get a Motorola instead.",
            "Price little high but otherwise , yes all ok\nLooks good in blue, and comes with a back cover in box so all ok",
            "I bought this phone argos, for my sister who lives in Bangladesh and last month he received and very happy to get this he can operate easily tnx argos",
            "Great value for great phone has an amazing camera great size",
            "Brilliant phone would buy again worth the money fast phone",
            "Very nice phone and good price. Was a gift for my daughter as her first phone and she loves it.",
            "Very good phone easy to use good battery life well worth the money",
            "Excellent budget phone, does everything i need it for and more, strongly reccomend",
            "Good price for this phone. I love the design specially."
        ]
    }
}