{
    "829/1392": {
        "remotekey": [
            "829/1392"
        ],
        "item_category": [
            "Get ready to game on your terms. This powerful rig is built to keep up with the games of today and tomorrow. Beneath its compact and sleek exterior, you will find all the performance you need to play with confidence and room to expand and upgrade. Microsoft Windows 10 and Compatible with Xbox Game Pass for PC. Play over 100 high-quality PC games on this Windows 10 PC with Xbox Game Pass for PC*. *Requires Windows 10 (latest update), Xbox app & Xbox Game Pass for PC Subscription. - Not included. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "15 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "93%"
        ],
        "review_rating": [
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "2 June 2021",
            "19 May 2021",
            "26 February 2021",
            "23 February 2021",
            "5 February 2021",
            "3 February 2021",
            "19 January 2021",
            "16 January 2021",
            "13 January 2021",
            "13 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "4 January 2021",
            "1 January 2021"
        ],
        "review_title": [
            "Great gaming pc",
            "Great!",
            "Extremely slow and bad performance",
            "No issues. Does everything I need",
            "Pc is very fast and can run heavy tasks",
            "",
            "Good cheap gaming PC",
            "Excellent for Novice Gamers",
            "Looks amazing",
            "Very good for basic gaming",
            "Son is so pleased with it",
            "Grandson so happy.",
            "Bought for Grandsons.",
            "Gaming Pc",
            "Gaming PC"
        ],
        "review_text": [
            "I bought this for my son and he absolutely loves it. It is fast and has lots of storage.",
            "Got this to replace my out of date PC. \nReally impressed with it. Can do work on it and game with no lags",
            "Good for general use but gaming wise couldnt be worse, struggles to run even the smallest of games at a decent quality and definitely doesnt run two things at once. For a proper gaming experience i wouldnt recommend this.",
            "I use this for games like pacify and phasmophobia. I stream with it using a camera. My YouTube channel is happygilmore198 if anyone wants to check quality of pc. Haven't played any bigger games like warzone, fortnite or gta yet. PC is easy to set up and looks really good with its green lights. Not overly noisy either. Would recommend as starter pc",
            "This is a very good pc for the price you are paying and very worth it.",
            "Very good for the price, defo worth it",
            "Nicely styled and compact case.\n\nThe PC was better than expected for the price.\nIt runs COD warzone great at 1080p with medium settings (80fps+) and at 50fps+ medium settings at 1440 out of the box. The Graphics card is the bottleneck on this system. Loading times are a bit slow due to the hdd. (Can add m2 ssd)\n\nSo not really suitable if you want to upgrade beyond 32gb ram, 3700x processor and lowish power consumption graphics card.. power supply is non standard and only 400w.",
            "Easy to set up and fast when using. Only wish you could turn off the green flashing light when in use.",
            "Amazing product definitely recommended to others ordered and collected same day and very good for someone who wants a pc and doesn’t have a lot of room",
            "Very good for basic gaming and that little bit more, can be easily upgraded. Also good for photo editing and as a general desktop.\n\nSmall and compact tower with a good array of ports.\nThe tower is quiet but if under heavy load it starts too get a little noisy but in all very good bit of kit.",
            "Son is so pleased with it",
            "Bought as a surprise for grandson, very fast and plays all his games.",
            "They rate it 10! 10! 10!",
            "Recently bought this for my teenage son and he has used it almost everyday, lovely size (small and compact) and very quiet while operating. Would definitely recommend",
            "Great Christmas present"
        ]
    }
}