{
    "927/6684": {
        "remotekey": [
            "927/6684"
        ],
        "item_category": [
            "From graphic design projects to watching a movie or keeping up with your social networking, this big screen AIO PC will suit everything you do. With its sleek, modern stand, thin bezel display, smooth performance and compact design, you can keep your desktop free of clutter with this space-saving all in one desktop PC, featuring a computer, monitor and built-in stereo speakers and the deluxe 27 inch Full HD display is almost borderless to make your entertainment more immersive. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "8 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "4 November 2020",
            "28 October 2020",
            "28 October 2020",
            "21 October 2020",
            "14 October 2020",
            "13 October 2020",
            "6 October 2020",
            "23 September 2020"
        ],
        "review_title": [
            "noisy",
            "Great PC",
            "Compact pc with flaws",
            "Very happy with PC",
            "I am satisfied with the product.",
            "The best all-in one desktop computer. Easy to use",
            "Great piece of kit!",
            "Looks and works brilliantly"
        ],
        "review_text": [
            "so noisy from  day one. contacted HP assistance but problem was not resolved. to return item for another one.",
            "This PC is a steal for the price in my opinion.  It's fast, efficient, has a beautifully large display.  I would've preferred a different stand but that's a minor issue. Also a wireless keyboard and mouse would've been better but, again that is just a minor gripe. Overall it is a fast, efficient computer with a lovely big display. The only real letdown is the lack of a cd/DVD drive.",
            "Got this all in one pc for working from home. I had read the reviews regarding it being noisy and it is, which at times is distracting. The USB ports are at the back which again is not ideal.\nDespite these couple of points it performs well and functions better than a laptop. \nOverall, good pc but could be better",
            "I would recommend this PC Desktop however the keyboard and mouse are not the best.\nFor what I paid I would have liked a wireless keyboard and mouse included in the price\nI still did not get the points on my Nectar card though and I wish this to be resolved",
            "It was worth the price. So happy and satisfied with the product. My children loves it .",
            "Best ever, \nI love the style and it's very easy to set up. Fast connection with the internet. Very happy with the product.",
            "Looks great in my home office and has loads of power to run the apps I use daily.",
            "Very pleased with the purchase, looks and works brilliantly and a great space saver."
        ]
    }
}