{
    "846/3670": {
        "remotekey": [
            "846/3670"
        ],
        "item_category": [
            "Beautiful All-in-One design. Built to perform. This powerful All-in-One PC has the storage to satisfy all your family's needs and help you get things done. Whether it is for work or play—you have found a highly attractive design to match high performance. Pump up the volume to your favourite music, movie or game with the dual front-facing speakers. By squeezing a larger screen into a smaller frame, this ultra-thin, barely visible bezel revolutionizes your display's appearance with a beautifully efficient design. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "41 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "18 March 2021",
            "17 March 2021",
            "16 March 2021",
            "16 March 2021",
            "11 March 2021",
            "10 March 2021",
            "10 March 2021",
            "10 March 2021",
            "10 March 2021",
            "9 March 2021",
            "9 March 2021",
            "3 March 2021",
            "3 March 2021",
            "5 December 2020",
            "1 December 2020",
            "25 November 2020",
            "18 November 2020",
            "10 November 2020",
            "10 November 2020",
            "10 November 2020",
            "5 November 2020",
            "4 November 2020",
            "27 October 2020",
            "15 October 2020",
            "7 October 2020",
            "7 October 2020",
            "30 September 2020",
            "30 September 2020",
            "30 September 2020",
            "22 September 2020",
            "13 August 2020",
            "12 August 2020",
            "12 August 2020",
            "12 August 2020",
            "11 August 2020",
            "5 August 2020",
            "4 August 2020",
            "4 August 2020"
        ],
        "review_title": [
            "Great PC for the price",
            "My desktop works perfectly well .No complaint.",
            "Fab computer",
            "Clever and neat integrated design.",
            "Good and very handy",
            "So far so good",
            "Great computer",
            "",
            "My PC is just the job",
            "It’s great what I paid for it",
            "Brilliant Purchase",
            "Hp all in one desktop",
            "Excellent pc value for money",
            "Nice looking pc!",
            "Computer looks amazing",
            "My computer is up and working brilliantly.",
            "My PC works perfectly and its easy to setup",
            "PC was exactly as advertised",
            "worth to buy",
            "Delighted with my computer",
            "My com",
            "Perfect for Everyday",
            "Does exactly what we require of it.",
            "Cool all in one computer",
            "Work good bit nousy but ok",
            "Hello",
            "Great computer and great service",
            "Excellent",
            "computer",
            "Fantastic purchase",
            "Miss",
            "Looks and works perfectly",
            "Nice",
            "Perfect size and working perfectly",
            "Neat and clever",
            "Neat unit",
            "Very Good",
            "Great value for the price",
            "Easy to install and easy to use. I love it",
            "It look so good for now,just purchase it for my so",
            "Ticks all the boxes and works smoothly, very good"
        ],
        "review_text": [
            "Wanted this to browse, send emails etc. Really pleased - easy to set up and use. Mouse and key board are fine. Nice big screen and so quick & quiet compared with my old clunky machine. Great to have windows 10 included too!",
            "My desktop screen was crystal clear. I haven't had any problem using it .I am so happy with my purchase that I have had  to recommend to friends and family to buy. This is the best product I have bought so far this year.",
            "I purchased because of price, but the computer is better than I thought.  It’s excelled itself.  \nThe price is fantastic, it works well, does exactly what is needed is quicker than thought.",
            "First time I've seen an \"all-in-one\", and it works well.  Nice size screen, neat design (no separate box like a desktop, and keyboard is conveniently separate, unlike a laptop.  Do check the disk size you want, there are (currently) two sizes, so go for the big one if you're in any doubt.  Well pleased overall.",
            "Good for office work, it serves all purpose I need . ✅✅",
            "Simple, easy to use, i really like it",
            "Great computer fore Al your needs all social Facebook tweeter Skype games Web great fore the money",
            "good value for money",
            "MyPC is very good with a big screen god for videos. No problems",
            "It’s great for my 9 years old son",
            "An absolute doddle to get set up and it does everything we need from a PC, with Microsoft Office stuff already installed and wireless connection to the router.",
            "An excellent desktop, easy to set up and use, very fast start up and nice clear screen. Had an HP years ago and had no problems so decided to opt for this and an HP printer too. All works well, very pleased with purchase.",
            "I’m loving this pc it’s value for money",
            "Bought this as a replacement pc, As my ageing windows 7 pc gave up the ghost!\nVery compact, good screen size, and it does what is needed of it!\nAs  win 7 user took some time to adjust to win 10( Still don’t like win10 TBH)\nVery quite,Super display and good value for money.",
            "An amazing computer. Kids can use it for their homeschooling duren the lock down period. We can use it for our photography and I also use it for my course work for work. We love it highly recommended",
            "This computer is so easy to get going that I was able to dispense with my sons help.\nIt is bright (easy on the eye), works really well and is 10 times faster than my old laptop (which can't be hard it was 15 years old). Totally satisfied.",
            "The price is great and it has a perfect picture",
            "I love argos products,no gimmicks you get exactly what you see quick service and friendly staff I highly recommend this store",
            "It’s perfect for learning",
            "Happy with my purchase would recommend it.",
            "My computer looks fab my daughter loves it.",
            "I've had the computer for a few weeks now and have no complaints. If you're looking for a top range state of the art PC to run the latest games then obviously look elsewhere but it's perfect for what I need it for: writing essays, studying, researching, and creating the odd quiz for the weekly pandemic quizzes!\n\nIt, to put it simply, just works!",
            "Graphics are very good. Operates very quietly and fast for what we require.",
            "Good package overall . Looks good. A tad expensive",
            "Iys ok, big screen, normally fast, for this price ok",
            "Good but not good this is better another pc",
            "Really happy with this product, so much so that I have bought a second one. Argos also delivered which was so helpful. I tried to buy through Curry's but had issues, and am pleased I used Argos",
            "I found it very easy to use and I really recommend it to everyone building it and setting it up was really easy",
            "I am happy with the computer only draw back is I can not use my cd roms",
            "Bought for my teenage daughter, very trendy to look at and very stylish. Screen size is perfect . Perfect for any student",
            "My computer is really good and is very useful for m and my family.",
            "Just what the kids needed fast looks good argos  come up with the goods again thank you tommy",
            "It’s very nice and good",
            "I must say it works perfectly , I haven’t noticed a dont’s",
            "It was east to start and sync with my other computer. I work with office 365 so it is seamless. Just need to remember not to switch it off before it has finished syncing. Light weight so easy to move around if necessary. \nIt would be even better if the keyboard and mouse were wireless, but luckily I had spares.",
            "Very nice unit, simple to set up. Suits our needs which is all we can really ask for.",
            "Now plan to order one more for my second daughter, very good worth for it",
            "Easy setup. Looks great.  Gives all I was looking for",
            "I needed a new computer for my work and this was an essential part of equipment so I needed to get the right one. \nThe all in one computer allowed me not to have a tower which is so much better. \nI wish the mouse was cordless though but it’s a very good mouse that is very responsive",
            "I happy with my purchase, I do recommend it.",
            "Was pleased with this puchase and is quite adequate for the purpose with which we need"
        ]
    }
}