{
    "853/9999": {
        "remotekey": [
            "853/9999"
        ],
        "item_category": [
            "A powerful desktop PC loaded with performance and style. (This PC has no disc drive) This HP desktop exceeds expectations with a new generation of performance, the freedom to store what you need, and a sleek design that cuts down on size. All your activities become easier and faster than before with an Intel Pentium Gold processor and Intel integrated graphics. Watch videos, edit photos, and connect to family and friends with all the power you need to get things done. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "10 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "90%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4"
        ],
        "review_date": [
            "31 December 2020",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "18 November 2020",
            "13 November 2020",
            "11 November 2020",
            "23 September 2020",
            "5 September 2020",
            "27 August 2020"
        ],
        "review_title": [
            "Does as expected",
            "HP PC",
            "Great little computer",
            "Very impressed with this item easy set up",
            "Great new computer",
            "It was amazing",
            "So slow",
            "My Computer is as fast as racing car",
            "Easy to set up and good for school and office work",
            "Good looking....small so fits nicely in space I ha"
        ],
        "review_text": [
            "It's a home computer and does exactly what I require it to do .\nBrowse internet.email streaming and all the other homely stuff.only down side is no disc drive to play cd s and DVD. \nBut I'm old school lol.\nBasically very happy with it.",
            "So far the Pc is fine, however being of the \"old school\" I yearn for the days when new items had manuals in the form of booklets that could be referred to without the need to turn the PC on.",
            "Only took about 20 mins to set up..Computer is invaluable for my university work.. supports teams and blackboard..copes with all my excel work",
            "Another great Argos deal love my hp computer and monitor set was so easy value for money thankyou",
            "This package met the majority of my requirements. It's just a pity that unlike my existing system there was no audio with the monitor, so had to purchase a separate sound system.",
            "The computer does a lot of things but overall I think that it is amazing",
            "I wish I had researched this better before purchasing as I got it for working from home.   It is really slow at basic tasks when using Google meet, sheets, slides, Gmail etc.  It has the min 4gb memory so if you want something speedy this isn't it!   Luckily I now have a work laptop so this will only be used for Internet browsing and streaming exercise classes etc.",
            "I love this computer because it will help me to ease the problem and challenges that l have been facing walking up and down, looking for computer to use but could not find as a result of lockdown",
            "Product is very easy to set up, My 12 year old son did it by himself as this one his birthday present. Very happy with my purchase... at reasonable price",
            "Great size.\nNo disc drive"
        ]
    }
}