{
    "916/6763": {
        "remotekey": [
            "916/6763"
        ],
        "item_category": [
            "The standout design of this All-In-One is made to suit any environment, it is great for studying, working on essays, streaming TV on demand, and browsing the web. It will remember the files, programs and apps you use the most, and get them open in a flash. Think of it as a helping hand to make sure you get things done that little bit quicker. Store all your family photos, music, movies and more with the 1 TB hard drive. Ideal if you have lots of users in the house and you want to give everyone some space to save and organise their files. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "17 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "2",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "7 March 2021",
            "6 March 2021",
            "4 March 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "3 February 2021",
            "3 February 2021",
            "27 January 2021",
            "26 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "19 January 2021",
            "19 January 2021",
            "19 January 2021",
            "19 January 2021"
        ],
        "review_title": [
            "Slow computer and flip camera too high",
            "Don’t buy the screen is very weak",
            "My new computer works really fast",
            "Does a great job!",
            "Great PC, clean looking and fast processor",
            "My pc look amazing",
            "Good product I am really enjoying",
            "Very good",
            "Very nice Computer",
            "Perfect PC",
            "neat, well designed, well specified desktop PC",
            "Uninstall McAfee before you use",
            "Superb All in one PC",
            "Life get faster",
            "",
            "Perfect for the job",
            "Very fast"
        ],
        "review_text": [
            "First , this is a slow computer. Sometimes slowness is so much that it's annoying. Not sure this is because of the Pentium Silver processor or just because it has only 4GB RAM.\nSecondly, flip camera. I bought it for my son's (child) remote learning. If he sits on a normal chair he can not see his face except head even if you bend the computer fully. I have had to buy a higher chair.  \nI will speak to Argos about how can I return this product as I have started using it!",
            "The screen is weak at the top right corner don’t try to move it by this corner. All I did was pull it across the table about a foot not hard slowly and gone small crack.",
            "I  am really happy with my new computer  it works really well",
            "Bought it as a gift for my husband. He absolutely loves it. Speed is great, large screen and really likes how the screen can be tilted to different angles.\nOverall, happy with purchase.",
            "Bought this after using a laptop for work and realising I needed a stand alone machine. Quick processor, looks great and comes with a relatively good keyboard and mouse and the delivery was quick and efficient. Would recommend.",
            "Deffo I recommend this PC for everyone X\nGood quality and works perfectly",
            "Excellent service and on time delivery. Overall good service",
            "Very good  I happy to by this pc",
            "Bought this Computer for my Granddaugter to do online schooling as her laptop wasn't working very well and kept freezing. So far she has had no problems with this Computer and is really happy with it.",
            "Easy to setup and nice big screen. Brilliant for my kids",
            "Good fast, efficient, well designed desktop PC.  Excellent value for money.",
            "This machine comes with McAfee installed as a free trial offer. \nIt runs continually in the background, constant noise is irritating. It is not safe software, I have been bombarded with spam emails purporting to be from McAfee while using the machine. After uninstalling am still getting them. \nNo recommendation then for McAfee security, Uninstall Microsoft 365 trial as that will interfere with any earlier version of Microsoft Office you own and install-unless of course you want to buy it.",
            "Looks fantastic and easily does what I need for work and home computing. Screen is much larger than anticipated and great resolution.",
            "Good computer. Me and my family like this computer.",
            "Computer was just a good buy it was just right,thank you.Lynda..",
            "I bought this computer for homeschooling. It does the job perfectly.",
            "It is fast and easy to use for my kids"
        ]
    }
}