{
    "896/4210": {
        "remotekey": [
            "896/4210"
        ],
        "item_category": [
            "With the Lenovo IdeaCentre AIO 3, powerful performance meets stylish engineering. It handles demanding apps with ease thanks to the ultra-fast responsiveness of an AMD Ryzen 3 4300U Mobile Processor, seamless DDR4 memory, and hybrid storage. It has an elegant stand and near-borderless display. And it gives you more desk space, too. Whether you're working on some slides or watching your favorite show, you can tilt the IdeaCentre AIO 3's stand to the right angle. You can also easily adjust the display to avoid any unwanted light reflection. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "14 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "21 April 2021",
            "21 April 2021",
            "24 March 2021",
            "23 March 2021",
            "2 March 2021",
            "11 February 2021",
            "3 February 2021",
            "14 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "2 December 2020",
            "18 November 2020",
            "28 October 2020"
        ],
        "review_title": [
            "Very fast computer",
            "PC for the wife",
            "Its amazing product son loves it",
            "Best buy ever",
            "All-in-One PC",
            "Non working micro usb and restarts a lot",
            "Great",
            "my ideacentre 23.8inRyzen 3 4gb 128gb all in one p",
            "Fantastic computer",
            "Lenovo PC",
            "It was great",
            "My computer fits in well",
            "Its fab",
            "It’s a great buy . What you read is what you get !"
        ],
        "review_text": [
            "Very fast computer, very impressed with speed and stability, would recommend this computer to anyone.....Brilliant.",
            "It was a birthday present for my wife. I set it up for her, which was relatively easy. She is very happy with it, especially the large screen so that she can watch her streaming movies. Also she likes the large screen for doing translations side by side.",
            "Perfect computer very nice and TV is thin",
            "I've had my all in one Pc for two weeks\nAnd what an amazing buy\nEasy to set up\nEasy to navigate \nGood quality \nAnd has everything I need to successfully work from home",
            "Very easy to set up  and the quality of the screen is very clear.",
            "Keeps restarting itself also micro usb locked in the usb and failed to read or release it",
            "Even better then I was thinking it would be over the moon",
            "this pc is ideal for me easy to use and is self explanatory and there are help items which are very useful",
            "It’s brilliant, fast and easy to set up. Wish it had a dvd/cd part but apart from that it’s the best purchase in a long time",
            "Excellent PC, 3 in 1 system,,no need carry hard disk drive ..",
            "I brought it for my kids and they have been loving it.",
            "Had help with the set up and notice that controls are not conveniently located.\nApart from that, I'll very pleased with the purchase.",
            "The product is amazing",
            "I’ve been using Lenovo already at work and that’s the reason I chose this brand. My son just loved it."
        ]
    }
}