{
    "946/5048": {
        "remotekey": [
            "946/5048"
        ],
        "item_category": [
            "Tired of your old computer cluttering your space? The HP All-in-One blends the power of a desktop with the elegance of a slim, sleek display into one dependable device designed to fit you. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "25 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "21 July 2021",
            "23 June 2021",
            "19 May 2021",
            "27 April 2021",
            "27 April 2021",
            "26 April 2021",
            "22 April 2021",
            "21 April 2021",
            "20 April 2021",
            "15 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "13 April 2021",
            "10 April 2021",
            "8 April 2021",
            "7 April 2021",
            "1 April 2021",
            "1 April 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "24 March 2021",
            "23 March 2021"
        ],
        "review_title": [
            "Nice comp",
            "Great",
            "Nice and neat",
            "very compact",
            "",
            "It’s looking good,and fast.",
            "simple to set up.good performance.",
            "Great computor",
            "Beats expectations",
            "Hp all in one",
            "Great computer perfect for my uses",
            "Broke after 3 days of owning",
            "UP all in one computer",
            "Lovely computer",
            "Looks lovely, very smart",
            "Perfect for my work and home.",
            "This HP computer is a replacement.",
            "Extremely easy to set up ,good speed ,excellent",
            "",
            "It does what it says on the tin, \"It computes\"",
            "Well purchased",
            "Pc all in one computer",
            "",
            "Fantastic computer",
            "Good value"
        ],
        "review_text": [
            "Great computor quick works great easy to set up bought for grandaughter to do school work ect",
            "Happy with the computer, it is fast",
            "Simple to set up and well packed. This is a nice looking and neat pc. My only minus point is if you want to quickly use a USB port you have to lean over the monitor to plug it in, but a quick solution it to use a 1 meter USB extension and leave it plugged in. So all in all a well priced home pc.",
            "first class product . very fast and looks good",
            "I recommend this product.",
            "Wery nice pc ,fast and easy to use.",
            "simple to set up.the performance is good and a lot faster than my previous laptop.",
            "I hadn’t used a computer for years but I’m soon learning again,I think this is fab and very good price",
            "I have never used an all in one before and am very impressed with it.\nIt was easy to set up, is very fast and quiet, the keyboard is ideal for my \narthritic hands and it is very smart looking.",
            "Very impressed. Nice and compact on my desk. This computer has a solid state drive which makes it quiet and very efficient. Certainly a good purchase.",
            "The price is well worth it",
            "Computer completely stopped working after less than a week. Worked completely fine for a couple of days then wouldn’t turn on at all. Had to then drive 20miles to the nearest return centre to get a refund. Refund was paid back quickly but a big hassle.",
            "Very good computer competitively priced. Does everything I need it to do",
            "From school work to games and every day use I would highly recommend this computer.",
            "Very smart, looks great",
            "Perfect for my work and my home. Slim and  fast",
            "I initially purchased an acer all in one computer, which went wrong right from the start. so I had to purchase this HP instead. the HP is great. But I am a little upset with Argos. When I tried to return the faulty Acer system, I was told I would have to wait until the covid crises ended. \n\nArgos please get your returns right, If other retailers can do it during this pandemic then you should be able to.",
            "Excellent product easy to set up good speed,very pleased",
            "very good! excellent!",
            "Good value for money and does what I want it to do. Far quicker than the old one it's replacing. It is a bit short on USB points (has four) but by the time one is used for the Key board and one for the mouse that leaves two take one for the printer and you are down one. having said that I was aware of this before I purhased this computer., I could of course run the printer on Wi-Fi and that would bring me back to two so perhaps I am nit picking. All in all a nice computer. I am happy with it",
            "Nicely, working fast, and good price on Argos",
            "Well this is my second all In one computer in one week wasn't cheap but you want it to work, in the first computer i had 25 driver's didn't work properly, so this second one is OK but still have a few issues with this all in one computer, so I wouldn't recommend it so stay clear of this item, keffe",
            "Easy to setup and excellent quality",
            "Easy too build and excellent screen size and brilliant for studying",
            "Impressed, good quality for fair price"
        ]
    }
}