{
    "874/1859": {
        "remotekey": [
            "874/1859"
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "20 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "21 May 2021",
            "27 April 2021",
            "7 April 2021",
            "2 April 2021",
            "24 March 2021",
            "10 March 2021",
            "27 January 2021",
            "21 January 2021",
            "5 January 2021",
            "3 December 2020",
            "2 December 2020",
            "1 December 2020",
            "25 November 2020",
            "28 October 2020",
            "24 October 2020",
            "20 October 2020",
            "7 October 2020",
            "22 September 2020",
            "15 September 2020",
            "9 September 2020"
        ],
        "review_title": [
            "Predator Helios 300 i7 16GB 1TB 256GB RTX 2060",
            "Excellent little machine",
            "Good for photo editing",
            "",
            "Great laptop",
            "Predator Helios first impression was excellent",
            "Great gaming laptop.",
            "Amazing laptop",
            "Gaming laptop",
            "Great gaming machine",
            "Looks fast",
            "Powerful performance in a compact design",
            "",
            "Great Laptop",
            "Great laptop for Student",
            "Battery drainer",
            "",
            "Predator Helios 300 is Fantasic!!!!!!",
            "My kettle looks fab and boils fast",
            ""
        ],
        "review_text": [
            "this laptop sends you a lot of emotions once you unpack it, it looks sensational, but once you turn it on you are captivated in a lot of colors and options that help you play any game of the latest generation, also the laptop benefits from the turbo button that  the simple push will turn it into an unstoppable gaming machine.",
            "Does all that I need it to, in an excellent form factor, looking smart and very, very suitable for expansion. It's described in reviews as a 'mid range' machine, so it will cope with all current PC games that don't push the boundaries - but still provides respectable performance on things like Cyberpunk 2077.",
            "Works very well with Photoshop and Lightroom classic. Battery life quite poor.",
            "Bought for daughter for birthday gift, she is very happy and even I playing games, love it!!!",
            "We bought this laptop for family use, gaming is excellent and the screen is bright and clear as is the backlight keyboard. There is plenty of storage we are happy with it.",
            "Predator Helios first impression was excellent and it has stayed that way in the last fortnight using extensively every day.",
            "Are you looking for a great gaming laptop and can’t decide, well look right here. \nI’ve had this laptop for a couple of weeks and I don’t regret my decision. Runs every game I’ve tried to play keeping up with great FPS. Love the customisable of the whole laptop \nWould tell anyone to buy \nWw",
            "Fast and efficient and you get your money’s worth",
            "Amazing laptop son loves it , can recommend for gaming and school work .",
            "really good graphics, very responsive, great all round machine, would recommend.",
            "Haven't used for long enough to give my point of View",
            "Great performance, good storage, noisy fan but you get used to it. the screen had some light bleeding on the corners - but for the price i paid, nothing really came close to this overall. My daughter loves it, especially the led keyboard.",
            "It’s amazing. Very good machine. Work\nWith this it’s easy and faster.",
            "Pros - Fast boot times (boot to desktop in 4 secs). The hardware can support 3 internal HDDs (2x m.2 slots, 1x 2.5\" drive (9mm). This laptop has lots of potential depending on how you want to use it. Upgraded the memory to 32GB (2x 16GB)\n\nCons - Cam is only 1280x720 and the mic picks up alot of noise from speakers if you plan to use this for recording while gaming (without external microphones). Poor battery, but that is expected for a gaming laptop. Sims4 at high performance is about 40 mins.",
            "As a student studying VFX this laptop is perfect for working at home during the pandemic! I plan on using it for years to come when I move on to industry after graduating. It is a lot lighter than I expected to be which is a plus, and the screensize is a great size for software like Zbrush and Nuke",
            "Very fast loading times, beautiful picture, but the battery goes to 0 very fast.",
            "It’s a very good laptop and it is fantastic if you’re looking to use it constantly",
            "This computer is like a dream, this is what I was dreaming about!!!! I'm so excited about performance, it handles everything so well that I couldn't imagined that laptop can run games such well. :O I love it. Nothing more to say its just a dream. <3",
            "so far i love this computer, fast, beautiful design. I already installed several games and the games work well.",
            "This seems to be a really nice gaming laptop, no issues so far. It does what i brought it for (playing games on high graphics settings) Really pleased with it and would recommend!"
        ]
    }
}