{
    "809/5330": {
        "remotekey": [
            "809/5330"
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "27 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "4",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "2 June 2021",
            "9 May 2021",
            "5 May 2021",
            "4 May 2021",
            "20 April 2021",
            "20 April 2021",
            "7 April 2021",
            "7 April 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "24 March 2021",
            "17 March 2021",
            "16 March 2021",
            "16 March 2021",
            "16 March 2021",
            "11 March 2021",
            "9 March 2021",
            "3 March 2021",
            "2 March 2021",
            "2 February 2021",
            "9 December 2020",
            "2 December 2020",
            "25 November 2020",
            "25 November 2020",
            "17 November 2020",
            "17 November 2020"
        ],
        "review_title": [
            "good laptop",
            "Dream Green Machine!",
            "Good value gaming laptop",
            "Rubbish laptop",
            "Better than expected",
            "This laptop is a good performer.",
            "Brilliant hp laptop",
            "Good laptop",
            "",
            "Fast gaming system plus it hold quite a few games",
            "HP Pavillion Gaming Laptop",
            "Very fast",
            "Perfect for gaming",
            "Brilliant gaming pc",
            "Good value. Great accessories",
            "Very fast",
            "Fantastic laptop!",
            "Excellent",
            "Works as needed",
            "Very fast laptop, good spec and value for money",
            "Best product I ever used",
            "Fast laptop poorly designed",
            "Value for mooney",
            "Brilliant laptop, super fast!",
            "I am software engineer and it works with no issue",
            "Nice set for a teenager",
            "Great value"
        ],
        "review_text": [
            "i bought the laptop rather recently. It is very good so far.",
            "Superb in all departments. Handles everything with minimum fuss. If speakers were better it would be 5 stars but i use external speaker so issue not as big.",
            "Would have liked more storage. Really easy to set up and good value bundle with mouse and headset.",
            "Rubbish from day one. Constantly lagging during gaming, keyboard lights turned off on their own and locked up all the time. Three months in and the keyboard gave up totally and Argos and HP blamed me for \" liquid contamination of the keyboard\" so wouldn't replace it. Absolutely disgusted with Argos and HP \" customer service\"",
            "Works great for what gaming I do, mainly play simulation games as a family and it's great for that! Battery life isnt the best whilst playing games so need it plugged in majority of the time if gaming for more than an hour. Overall I'm happy with it.",
            "I have found this to be a very good performer and it speeds through tasks when editing photos. It runs photoshop , Lightroom and Topaz products without any problem. The battery life seems to be fairly good even on energy draining tasks . This has been a good purchase and one I would recommend .",
            "Wow what a laptop .just brilliant ..there's 16 processor's running at 2.9ghz..1660ti graphics card runs games well..ssd runs brilliantly fast.could do with bit more ram and an extra hard drive..but over all what a laptop so glad I chose this one ..and you won't be either .lov it .lov using it .lov everything about it",
            "but could do with more than 8gb of ram, however this can be easily fitted. I found the edges at the front and sides of the HP laptop sharp to touch that looks like a moulding line when the case was manufactured and was disappointed to see this at this cost. Overall I like the HP laptop, it’s quick and responsive to use and not bad value.",
            "Great looking laptop, very fast loading times, great quality picture.",
            "The PC is fast and has a great gaming system graphics are good, the only down side to it is the sound it could use some improvement on it",
            "Love it and for the price runs everything I have chucked at it.  Bargain at the price.  Look Hulk green battery life really good when just using as a laptop.  Battery life in gaming mode is also good.  Not even noisy so no jet engine on these fans. A+++++++",
            "A very nice laptop, fast and with great graphics. Very nice for games but also for work.",
            "I upgraded from the nitro 5 to this one and it's lightning fast compared to the nitro. Does everything I want",
            "Fan a little noisy ! And blows warm air ALOT! Always make sure its on a hard surface!!!\nShame i didnt get my nectar points !! Grrr",
            "Great value for the laptop itself. The accessories are a real bonus. The headphones are a little large for my head as a short female, but they still stay on. The laptop has great backlit keys and types really well. Startup is super short.",
            "My old laptop used to take 10 minutes from pressing the power button to opening a browser.  This laptop takes a few seconds.  I am not a gamer, but did want something that was fast and responsive.  The daily tasks I do on the laptop now take under 5 minutes when it used to take 20.  I am really impressed with it and would definitely recommend it for anyone who wants a superfast laptop. Definitely well worth it.",
            "I do not regret buying this laptop, is reliable and fast, great laptop for gaming, does not struggle with high graphics, easily runs around 120fps, love it!",
            "Absolutely love my laptop, just what I was looking for, price seems steep but you get what you pay for.",
            "Everything works fine. Fans arent loud when gaming, FPS are good",
            "This is a very fast gaming laptop.\nThis is good value for money and there is space to upgrade further.\nThe mouse and headset aren't bad if you don't have any but if your a gamer there is alot better out there. Overall very good laptop",
            "From the specs to the design, it handles really well as well as the fans are so quiet I would recommend this product to others.",
            "Decent parts ruined by HP! \n\nScreen is fairly good, CPU and GPU are fantastic, added accessories are fine, mouse is pretty good.\n\nIMPORTANT! its thermal design is woeful and completely inadequate. Two only heat pipes run across the 45w CPU and 60w GPU, with no manual fan control, expect 95c even on a laptop cooling pad, throttling, hot to touch palm rest and a lot of noise. It’s a disgrace for a laptop of this price, advice, buy a Lenovo Legion. HP have lost a customer in me.",
            "Excellent value for money colours give it a trendy look according to my grandson who loves it",
            "So pleased with this laptop - needed to upgrade my old one and wanted a new computer that was going to run football manager quickly. This certainly doesn’t disappoint! Not only does it produce super fast processing speeds with excellent graphics, I also really like the look and feel of the laptop. Charges up quickly as well compared to my old laptop",
            "Only concern is it’s AMD technology not INTEL they both are good competitive brands but intel are more expensive than this, and more reliable. But as i give it ago still not bad with this latest technology RYZON 7 4800 processor. Still not bad",
            "Great set, cheapest I could find. Bought for my son to make lockdown home schooling little more fun. He likes it a lot - uses it to play games too. Little heavy for my liking but we don’t carry it around so no issues. Nicely built. Works well no issues so far. The 8gb ram little low but there’s space to easily change to 32gb so all good. Boots up fast. Little loud when playing online games but that’s expected from gaming laptop. Nice mat screen. It’s not Alienware but great starter set!",
            "Good fast laptop well impressed"
        ]
    }
}