{
    "873/2466": {
        "remotekey": [
            "873/2466"
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "12 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "92%"
        ],
        "review_rating": [
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "31 March 2021",
            "24 March 2021",
            "5 January 2021",
            "1 January 2021",
            "25 November 2020",
            "25 November 2020",
            "24 November 2020",
            "7 October 2020",
            "1 October 2020",
            "30 September 2020",
            "30 September 2020",
            "16 September 2020"
        ],
        "review_title": [
            "",
            "Does a great job for gaming",
            "Is good",
            "Fast Machine",
            "",
            "",
            "The laptop is great and fast",
            "What a lovely laptop!",
            "acer laptop Nitro 5",
            "",
            "Great specs solid build upgradable",
            ""
        ],
        "review_text": [
            "The battery is draining too fast even if I am not playing games. Just exploring the internet and listen music.",
            "Have all good specs to play latest games , i m happy with it!",
            "My son love the laptop is fast and work good on games",
            "Very good gaming machine",
            "Very good product, I will recommended to my friend",
            "Really good product, playing all my games at high/ultra.",
            "Very good and fast, as described in the description, graphics also really good when playing games",
            "Stylish laptop. Copes very well with high graphics content - as a gamer should - and did very well recently when a program glitch caused some kind of recursion. Boost fans kicked in and all was sorted in seconds.\nBeautiful graphics.",
            "Only been using this for about a week and have found the Performance very good. (My last laptop was very slow). The keyboard keys are very nice to use. I am having to get used to the Touch Pad which is off center. I haven't really tested the Graphics side yet but with the Spec and Dedicated Graphics it should be Fine. Looking forward to getting to know it better.",
            "Great machine, fans are reasonable and not too loud but needs more ram and storage.The modern games of this generation require alot more storage and ram but overall this is a great laptop for gaming and everyday usage.",
            "This is an excellent computer for the money especially for gaming it has only had a good memory which is totally upgradable and also the space on the hard drive very solid construction strong enough to take the hardest gaming excitement recommended bye attack person feel free to ask any questions",
            "Laptop is very fast. Boot up is instant and battery life is around 5 hours. The i7 processor makes everything much faster and smooth"
        ]
    }
}