{
    "894/7794": {
        "remotekey": [
            "894/7794"
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "17 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "10 May 2021",
            "28 April 2021",
            "23 April 2021",
            "21 April 2021",
            "14 April 2021",
            "6 April 2021",
            "30 March 2021",
            "24 March 2021",
            "17 March 2021",
            "10 March 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "18 February 2021",
            "27 January 2021",
            "27 January 2021"
        ],
        "review_title": [
            "The laptop looks nice and is fast",
            "Amazing",
            "Couldn't be better.",
            "Laptop looks amazing and very compatible",
            "Perfect for taking your first step into PC gaming",
            "Gaming laptop",
            "Great replacement.",
            "Great allround gaming laptop",
            "Really good laptop",
            "Fantastic",
            "laptop",
            "Amazing laptop, looks great, runs well.. No issues",
            "Brilliant",
            "Poor battery",
            "My laptop is great",
            "noice",
            ""
        ],
        "review_text": [
            "Brilliant laptop, am able to do work, play games without it slowing down and battery seems to last well!",
            "I have been blown away with this laptop, I got it for mixing and making music and it work perfectly, on the plus side for a low end gaming laptop its amazing not only can i use it for gaming but VR works as well nothing on the high end of VR gaming but if you tweak the settings it works with most game no problem 110% satisfied with this laptop. if you get this you will not be disappointed but remember its not top rnge gaming laptop but i would say mid range.",
            "Amazing bit of kit, fairly expensive but definitely worth it, no issues at all.",
            "Despite the price, worth it and can play games. It is very good for doing school work too. Highly recommend",
            "Having always been a console gamer previously, this is the perfect next step for me. It's blindingly fast thanks to the SSD, and so far has had no trouble playing whatever games I've thrown at it. Admittedly, these aren't the most demanding titles (Halo: The Master Chief Collection, Saints Row IV, Among Us and Magic: The Gathering Arena), but they look really nice on this screen and run very smoothly. I'm looking forward to putting it through its paces with Resident Evil 2 soon too.",
            "Its very good and fast gaming laptop. Farcry 5 96fps .",
            "Found this at a good price. Does what I want it to do. A good replacement.",
            "Top performance for a low cost gaming system and does everything else smoothly and easily. Runs games and other apps in the background without problems. Fan can be a little bit noisy sometimes but with sound on it's negligible. Decent screen. Slightly heavier than your average laptop but that was not my main concern and personally does not bother me at all.",
            "Bought this for playing the Sims 4 and it is excellent very fast and graphics are amazing only problem is the hard drive isn't big enough I'm going to have to buy an external hard drive I have 37 extension packs in total so if you don't have as many extension packs as me you won't have a problem and it plays the Sims really well",
            "Great laptop. Fast, amazing colours. So very good. The keyboard is wicked with the blue lights. I recommend it.",
            "quick delivery, great laptop, quick and easy to use",
            "Great laptop, runs great. No problems so far, would recommend.",
            "- Handles all games I've tried\n- Has a great aesthethic\n- Is reasonably light for it's calibre\n- incredibly quick",
            "Battery awful do not buy. Returned for refund next day. Staff informed me that this often occurs with Lenovos. Wonder why sub standard kit is made or sold?",
            "I love the fact its a great gaming laptop very compact and the best for watching movies. \nI Highly recommend",
            "worth it,its good if u re gonna be using it for work and gaming",
            "very good gaming laptop for relatively cheap price, battery life may get bit short tho"
        ]
    }
}