{
    "888/1544": {
        "remotekey": [
            "888/1544"
        ],
        "item_category": [
            "Lenovo Tab M10 Plus is one impressive media tablet from the 2nd generation tab family. Outside comes with the standout metal design, premium look and feel with modern simplicity. Inside lies a 10.3-inch FHD screen and dual speakers for immersive entertainment. LTE-enabled tablet with 4G connectivity. The Tab M10 Plus LTE comes complete with an EE SIM card with 20GB of free data. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "66 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "90%"
        ],
        "review_rating": [
            "5",
            "5",
            "1",
            "2",
            "4",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5"
        ],
        "review_date": [
            "24 July 2021",
            "5 July 2021",
            "25 June 2021",
            "24 June 2021",
            "23 June 2021",
            "17 June 2021",
            "16 June 2021",
            "13 June 2021",
            "9 June 2021",
            "6 June 2021",
            "5 May 2021",
            "3 May 2021",
            "1 May 2021",
            "29 April 2021",
            "29 April 2021",
            "28 April 2021",
            "28 April 2021",
            "27 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "14 April 2021",
            "14 April 2021",
            "10 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "6 April 2021",
            "1 April 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "26 March 2021",
            "24 March 2021",
            "25 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021",
            "23 February 2021",
            "20 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "10 February 2021",
            "10 February 2021",
            "9 February 2021",
            "4 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "2 February 2021",
            "2 February 2021",
            "2 February 2021",
            "2 February 2021",
            "26 January 2021",
            "25 January 2021",
            "21 January 2021",
            "21 January 2021",
            "20 January 2021",
            "13 January 2021",
            "13 January 2021"
        ],
        "review_title": [
            "Great value for money",
            "High speed tablet",
            "Poor battery",
            "Annoyed",
            "Nice product",
            "Mixed results review",
            "Excellent product.",
            "Good tablet for kids",
            "Bought as a gift",
            "OK but problems that Lenovo could easily avoid.",
            "Great Tablet",
            "Nice tablet",
            "Very nice",
            "Smart Looking Tablet",
            "Great tablet very fast and battery good.",
            "Ok",
            "Stylish Lenovo Tablet",
            "Excellent",
            "My tablet is perfect fast and looks great",
            "Fantastic",
            "Great value tablet",
            "Brought this for my uncle looked great easy to use",
            "A fab budget tab",
            "Looks good battery bit on weak side",
            "Stone age",
            "Replaced the old tablet above our expectations",
            "Works great",
            "Tablet",
            "Great tablet",
            "Don't be deceived",
            "Best tablet with 4g",
            "Lenovo Tablet M10 Fhd",
            "Early days but looks excellent",
            "Affordable High Specification Tablet",
            "Lenovo M10 plus 10.3",
            "Great tablet",
            "Great value for your money",
            "Lenovo",
            "My table is awesome disign",
            "Fast and easy to use",
            "Great tablet",
            "Great Tablet. Amazing value for money.",
            "Tablet",
            "Another Lenovo Perfect powerful tablet",
            "Best buy",
            "Great tablet",
            "Very good tablet",
            "Good n bad",
            "Great value!",
            "Good quality",
            "This tablet is very good",
            "Excellent value for money",
            "",
            "Looks good for what is a functional item.",
            "Fake Lenovo",
            "This was a present",
            "Wonderful product",
            "It does what is advertised.Good product for this m",
            "It is a great devise with a wonderful performance",
            "Happy Bunny",
            "Tab M10 FHD PLUS (2nd Gen(",
            "Excellent Peace of Kit",
            "very good quality for the price",
            "Sitting on the fence",
            "Looks good and great performance",
            "Great Tablet"
        ],
        "review_text": [
            "Great tablets\nGreat value for money, would definitely \nRecommend!",
            "I bought this for my grandson who uses it for educational purposes which he finds excellent",
            "Battery life awful and charging slow.\nScreen good and clear.",
            "Not too bad but am upset at discovering i cant buy the alexa dock anywhere.had i have known i would have gone for the one that came with a dock.",
            "Had the device for a few weeks now and is working well, set up was easy with migration from my previous very slow device nice and quick. Have loaded Microsoft Launcher a bit of a mistake",
            "Good screen and reasonably fast during use.\nSlow to start up and exceedling poor battery life.",
            "Excellent laptop! I'd like it to last a bit longer between charges, but can't mark it down because battery life is as advertised, and regular recharging is the price you pay for the high quality screen.",
            "Good tables for the kids. Works well for the whole family.",
            "Fab item dose everything you need great for online shopping and fun games",
            "Tablet OK but uses a different charging lead to other Lenovo products that I have, so not good as I will always have to carry the lead with me, whereas up to now I just had leads in my homes etc. The user manual was also very difficult to get from Lenovo.",
            "I bought this because it was as near to my Sony Experia tablet i have had for 8 years and also it takes a sim card for mobile use,  so far i have not been disappointed, good battery life, yes i would recommend this product.",
            "This is a very nice product with excellent specs. The only problem I had was the length of the warranty, I bought it in April and yet when I registered it the warranty expires in November 2021 so only 7 months. The Lenovo website shows that the warranty commenced in November 2020, wonder this should be.",
            "Really nice tablet, use it for wifi hotspot.",
            "Got this nice looking tablet from or my partner she loves this tablet. It was very easy to move all of her contacts, photos and the apps by Bluetooth. She watches her soaps on it the picture is good colors are clear and the sound is perfect got a case to protect it in all a very smart bit of kit",
            "Great tablet very fast and the battery is very good.",
            "It’s not the fastest I’ve ever used but for the money I can’t complain, I’m used to an iPad so I need to give it a little more time to get to grips with ot",
            "Purchased this to use on my travels. Plus the  4G addition is excellent, also use this as a Satnav. Looks awesome on the car dashboard. Good quality cameras and crisp video recording.  Would definitely recommend and purchase again for family members.",
            "Well worth the money",
            "This Lenovo tablet worth the money",
            "Great value for money. Has all that you need. Excellent picture quality for watching videos and has a SIM card so I can take it anywhere. Highly recommended",
            "A great tablet, the colours are nice and bright, photos and videos come alive. I'm no techy so can only say what I find. For basics like internet shopping, social media and messaging it's great. The screen is a good size. It is light, however, I do find holding it in portrait can be a bit awkward. I have fitted it with a full cover, heavy duty case which makes it a little bulkier but much easier to hold. I would certainly recommend if a good quality, value for money gadget is all you need.",
            "Great tablet brought for my uncle easy to set up and easy to use",
            "Does everything I want, light games, social media and streaming movies, plenty of data included in the initial package as well",
            "Looks good battery bit on weak side",
            "Smaller than I thought, no room round the edges to hold it properly, looks like an old roof tile .",
            "Excellent and value for the price",
            "EVERYTHING works Well. Tabket is super thin And Light.",
            "The screen is very good. Only has one usb-c plug so a mini hub might be required. Connected to my internet at home without trouble. Overall I am very pleased with this tablet and what it can do.",
            "We bought this tablet purely for the reason it takes a sim card so my wife can watch virgin tv sky and prime absolutely perfect can't fault it .Nice and fast as well",
            "This tablet says its 4g, but you can't make calls or texts from it. The build quality is poor, it feels cheap. Had to take it back. I usually like lenovo, but they let me down this time.",
            "Buy this for my daughter, she was really happy and speed of tablet is good, so she done her school work with fast tablet. \nLast battery life long lasting and charging is queit fast.\nOverall 5 star tablet",
            "It's a decent tablet battery life ain't too bad but the capacity is quite small , it's good in pubg but it somehow struggles in Roblox , has a nice looking display , face recognition ain't too bad just takes a bit to unlock , in my opinion its good but it could be improved with better optimizations for games and better quality on Netflix",
            "Early days but so far so good. Very clear screen and happy with sound.",
            "A champagne product at a lemonade price. Says it all.",
            "Excellent quality product nice big screen and pretty easy to use but not like normal android phone I'm used to still good product for doing work related stuff only real issue is sourcing a pen",
            "Very happy with this purchase",
            "Nice size.  Great colour screen.  Takes a card for your phone.  So great with Facebook and what's up.  Internet is great on the go . So kids would find it great on a long journey.",
            "Love this ...priced competitively. Slick and esthetically on point. Easy tech for people who don't wanna be a geek about it but just crack on and use the pad for modern day survival not for geeks or hackers as it works well.",
            "The item was ready for collection very fast and costumer service very nice with all safety procedures.",
            "Found M10 fast and easy to use. Light weight means you hardly notice your holding it. Would recommend it to friends, Also free 20gig sim card a bonus.",
            "Bought this as an addition to an iPad as I needed an Android device, really impressed especially as it’s nearly half the price. It came fully installed with Android 10 and there’s plenty of on board storage, great for general web browsing and social media apps, YouTube etc. It’s came with a 20GB 4G data sim but as it will always be used with Wi-Fi I’ve not subscribed to it but it’s there if needed for a monthly fee.",
            "Great all round tablet. Brought this to replace an out of date apple ipad, that my elderly parents were using. This does everything they need to do and more.",
            "Marvelous light and easy to use, perfect",
            "Tablet are perfect powerful, compact slim with great memory capacity.  Surprisingly including 20gb sim card just top-up and go. Screen resolution perfect and battery lasting long. Hourly recommends.",
            "This is a fabulous tablet. To be honest I already have 2 and this one was for my mum! Easy to set up and  great screen definition. There is no reason not to buy it!",
            "I originally brought the Samsung a7 but after a few weeks the screen played up and so did the replacement so I decided to go for this lenovo,  what a great fast tablet. It is perfect for everything you want. Even comes with a sim card. I use it without it but its good if I ever chose to use one. Great screen, battery is very good and far better than Samsung. And even better on the offer price.",
            "I bought this tablet to mainly browse the Internet and stream videos. And it does the job just fine. The screen is bright and responsive, the sound is very good as well. LTE capabilities allow one to be online even when Wi-Fi is not available. Extendable storage is another useful feature. Overall very happy with this purchase.",
            "Good tablet, although notifications and such are buggy atm due to lenovo software issues.",
            "Ideal tablet! Easy to set up and simple to use. Can’t fault it !",
            "Great tablet looked at various models and the specifcation and value for money is the best I could find. Cheaper than Samsung and probably better in my view.\nI use for streaming mainly and is great, sounds good and easy to use and set up.",
            "The tablet works fine although the manual lacks some information such as how to use the 4G data facility.",
            "This tablet is excellent value and quality. Quick starting and smooth operation.\nWould definitely recommend.",
            "For this price really good tablet",
            "Good sound and picture perfect for Skype calls.",
            "It doesn’t appear genuine Lenovo brand. It keeps on freezing, not responsive to touchscreen.. the 10.3 in seems not true. I have a tablet 10.1in which is bigger than so called 10.3.",
            "As this was a present for my Grandson I can only pass on feedback secondhand. It was bought to allow him to better do his home schooling which he was finding difficult on a smartphone. This seems to have been successful according to his Mum, she says it's making her supervision easier as it means he can do more work on his own and she can concentrate better on her WFH. She also said it's the first thing he picks up when he comes down in the morning! So I'm pleased too.",
            "I was a little sceptical when I was buying this. I wanted a tablet with both Wifi and mobile connectivity. I got this one and it has both. I take it outside when walking. That takes care of my communication needs outside as I get a whole lot of emails and have to reply to them which was difficult with my mobile phone. At home I have it on WiFi and that takes care of my personal entertainment needs. Like watching videos on YouTube or Listening to music. So, overall a good product that I recommend",
            "Good screen quality\nNice looking body\nAndroid 10\nGood enough to browse on Internet,watch Netlifx,Youtube etc...\nThe screen is responsive but don't expect 120hz experience when scroling :-)).\nThe cameras are 2/10 quality\nI was on facebook,scroling,and suddenly the tablet restart.It did it once only,I hope is not going to be worse.\nThe sound could be much better.\nBeing using this tablet for 2 weeks now.\nBattery life is about 5h watching video content.",
            "It is a great devise for the price and perform wonderfully. My only backside is that the devise is so streamline that it easily slip off your hands",
            "I was looking for a tablet or laptop for my daughter since she's home schooling due to lock down! after lots and lots of faffing about I came about this Tablet which is perfect for the budget and spec.",
            "Like the lightness of this one, compared to my previous, 3yr old,  Lenovo tab.\nVery touch sensative, clear, sharp screen.\nI play games and watch a lot of tv on it. \nThe battery, so far, lasts ages.\nAlso like the improved charger point. Seems much stonger  than earlier models.\nI can't think of any negative about this ⅕",
            "After purchasing this tablet I was surprised how well it ran. For the price, I would definitely recommend this tablet good graphics excellent storage space and quite a good processor, the only downside was the case very light to handle but for the speed, price, and storage this makes up for it. I purchased a protective case for the tablet and this helped with protecting and storage so I recommend you purchase a case for it.",
            "superb item\nwould recommend this",
            "Not the best , but not the worst...........functional piece of kit, but would have liked a bit of cellular attached ( get and make phone calls as well ).......\n.\nI have the cellular versions of the Galaxy Tab as well, if Lenovo went that extra step, so you could also stick a SIM CARD in it, all would be peaceful in our world..........\ngine it a year or so and most tablets will also be offering phone calls,\n\nSuccess on your purchases, Enjoy !!\nThe Old Man in Shropshire..............",
            "Easy to set up and i am not technical, virtually did it by itself. Great picture quality and easy to use.",
            "Quality tablet very fast and responsive and you have a sim card slot so you can have data when your not in a WiFi area."
        ]
    }
}