{
    "827/1721": {
        "remotekey": [
            "827/1721"
        ],
        "item_category": [
            "With the 11 Tab S7, you've got some serious screen space to enjoy. That means plenty of room to immerse yourself and craft your latest masterpiece or work report with the S Pen. If you're looking for a laptop experience, just activate the Samsung DeXmode and add the Book Cover Keyboard* to feel the PC-like power. Alternatively, leave as is and use Split View to maximise your productivity and video chat with your boss while you refer to your research –or chill out watching YouTube while you message your mates. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "49 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "98%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3"
        ],
        "review_date": [
            "30 July 2021",
            "24 June 2021",
            "6 May 2021",
            "27 April 2021",
            "14 April 2021",
            "14 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "28 March 2021",
            "23 March 2021",
            "17 March 2021",
            "12 March 2021",
            "4 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "2 March 2021",
            "24 February 2021",
            "17 February 2021",
            "13 February 2021",
            "3 February 2021",
            "3 February 2021",
            "13 January 2021",
            "13 January 2021",
            "13 January 2021",
            "4 January 2021",
            "3 January 2021",
            "1 January 2021",
            "29 December 2020",
            "3 December 2020",
            "3 December 2020",
            "17 November 2020",
            "4 November 2020",
            "21 October 2020",
            "30 September 2020",
            "28 September 2020",
            "23 September 2020",
            "18 September 2020",
            "17 September 2020",
            "15 September 2020",
            "15 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "8 September 2020"
        ],
        "review_title": [
            "Amazing Tablet",
            "Perfect purchase",
            "Best mid range tablet out there",
            "Better than Ipad",
            "The tab is a good  option for watching videos.",
            "Great tablet",
            "Great tablet",
            "Great hardware and useful OS",
            "Samsung Get it Right",
            "Great tab with a pen for drawing",
            "Great tablet",
            "My first ever tablet",
            "nice tablet",
            "Pretty good",
            "Excellent tablet",
            "Nice bit of kit",
            "Great tablet",
            "Very pleased with the quality",
            "No probs. Great service",
            "I'm a big Samsung Fan",
            "Very good.",
            "",
            "My s7 tab",
            "Screen is great high resolution",
            "complicated",
            "Best android tablet you can get",
            "Loving my new tablet",
            "A Great Tablet",
            "awesome bit of kit,very happy with it!!!!",
            "WOW!!!! but be aware that DpD are very careless",
            "Excellent all rounder",
            "Compact and powerful",
            "My replacement tablet.",
            "Nice and speedy",
            "Fast and furious",
            "Looks fab",
            "Great S Pen tablet but lacks ports and too small",
            "I bought this tablet to use during my pgce.",
            "SLEEK AND STYLISH.  10 OUT OF 10.",
            "Looks good and long battery life",
            "Galaxy Tab S7 (11\", Wi-Fi)",
            "S7 Tablet does everything it says it does Fab!",
            "Simply stunning!",
            "Love my new gadget from Samsung.",
            "Shame about the screen downgrade",
            "Perfect quality",
            "Samsung s7 tablet",
            "Superb",
            "Touch Screen needs to be more natural"
        ],
        "review_text": [
            "Brought this tablet about a month ago and have used it everyday! Watching TV series, drawing and work. Very versatile device, great for relaxing and productivity",
            "I bought the Samsung tabS7 to replace my old tab S2, and it's a great purchase, camera is so good, it's like having a laptop, everything you need for work and play is all there. My only negative point is that the tablet is too heavy for me",
            "After returning the Samsung s5e because of unbearable WiFi connection which is a problem with the s5e. I decided to pay a little more for the the s7 and I'm glad I did. It has really good battery life and the sound quality is awesome. It feels well built and quality which you'd expect from a mid range Samsung tablet. It has a few good features which was lacking in the s5e. While the screen is LCD and not OLED like the s5e this isn't really an issue for me as the LCD is still really good.",
            "The price is competitive, and more functionalities than iPad. Can't believe that only cellular version iPad has GPS receiver. This Samsung tablet can connect with your phone to have a call. Can act as a big screen GPS navigator. The best thing is the pen.",
            "I bought the Tab  for note taking and saving the work in a handy location. Use with Google Docs and Drive, Handwriting App plus Samsungs write on PDF app you should be covered. The option of using DEX is great as its handy having a Web browser, note taking app and docs open and usable at the same time, good multitasking the screen is fantastic for watching videos  pen responsive.\nWhat is good is the Tab can be used as a second screen for a Windows PC and will even accept pen and touch input.",
            "Replaced my old tablet with this one it has power performace and would recommend its a fantastic",
            "Great tablet easy to use",
            "I really like my tab s7 and the stand with keyboard. Just so good.",
            "Great offer price, pen included. So easy to transfer apps and contacts using Samsung Smart Transfer. Don't know why the display us not as sharp as my old S2, very fast response highly recommended.",
            "Went for this one as it has the S pen included. I wanted a tablet to draw with.  The pen is great and really easy to use and is responsive and accurate.  The battery life for the tablet is good too.  I already have a Samsung phone so found it easy to set up and use as its basically a giant version of that.  The only downside is the price but pleased with my purchase so far.",
            "This tablet has everything you need, even if it's just playing games or taking notes and drawing. It is very fast (I thought that having just 6GB RAM will not be enough, but they are), you can swap between apps with ease and the fact that the refresh rate is so high basicly makes everything you write with the pen instantly appear on the screen. Also you don't need to swap the nibs of the pen, samsung let me know that they don't wear out apparently.",
            "Was looking to get a tablet to learn how to create digital art. I was originally looking for an ipad specifically for procreate, but I just couldn't justify the cost for myself so this samsung tablet was a great alternative, even without procreate. I love that it comes with the s pen, which works really well. \nThis is my first ever tablet so I don't have much to compare it to, but I am very happy with the purchase. It runs really well, is really sleek and clean looking with great graphics.",
            "really good table good size worth the money :)",
            "Works well great for watching movies",
            "My main drivers for choosing the galaxy tab s7 was the inclusion of the s pen as I wanted to use the tablet for note taking and also try my hand at some digital artwork. I have been using the tablet every day for 2 weeks and am very happy with it. The note taking function in particular is brilliant as it converts all my handwriting to text.\n\nThe screen has a very good quality display and the speakers are very loud and clear. I have found that I now use the tablet more than my phone.",
            "Definitely a step up from the S3. Only criticism is it a little large to hold despite being the smaller size.",
            "This is a must ahve tablet this 2021",
            "Very pleased with the quality of this tablet. \nPicture quality is very good",
            "Everything went as should. Great product!",
            "And I was not disappointed. Great tablet and can heartily recommend it.",
            "Help me study during lockdown.",
            "Amazing tablet! I love it so much - great for my university course, Architectural Technology and everyday use",
            "Got my s7 tab over a week ago and am very happy with it the sound quality is amazing and screen quality is great with size of the screen.",
            "Bought to replace an ageing ipad,wanted to go android(more choice of apps)\nGlad I did for what I need this is a fab tab",
            "It's a very good device. But with lots of preinstalled app from Samsung it's make it complicated . Also it doesn't have options to adjust volume without button .also with cover on it's very hard to reach the fingerprint scanner. It's in awkward place. Does not have warm display settings like iPad. But there are many other things which is so good. The PEN is so awesome and helpful it's worth over £150. The sound is very good screen is good and battery usage is ok. Over all I really recommend it.",
            "A really powerful tablet, and the best non-iOS tablet you can get as of this review. It’s premium quality and solid build really makes it worth it. The screen is so bright and beautiful too! I deffo recommend",
            "This tablet is amazing, good value, great for editing my photos in Lightroom. The picture is amazing and the sound quality is superb.",
            "After upgrading from a Samsung Galaxy Tab2, to the New Tab7, I was apprehensive t say the least with the cost of the Device. However, I'm impressed. The display is fantastic as are many of its features. The slight downside is the costs of accessories. To be honest, I am a fan of Samsung Devices.",
            "very good and powerful tablet ideal for my needs",
            "DPD are very careless I was ouside my door expecting it to be handed to me or placed near me due to covid but the driver threw the package right on the concrete floor and when i approached him saying did you just through The tablet he said yes smirked and drove off .( i have took this futher with DPD and samsung) Luckily the tablet wasnt damaged  but its not the point. for delivery i would give less then 0 star rating but besides that  the tablet is amazing.\nIt so thin its uncanny and the weight is so perfect. I was worried about the software becasue its samsung. id say dont listen to those reviews the Tablet is so buttery smooth with its 120 Hz panel and i love how you can run 120 hz and 1440p at the same time. ITs so cool that i can watch youtube in 1440p in HDR as well. Samsung dex runs so well and i bought a USB type c hub so i can plug in my keyboard, mouse and Tv so it runs exactly like a laptop. The gaming on is amazing aswell the fact that a tablet runs fortnite ( the only game i tried) better then my Xbox is unreal easily running at high graphics quality at 90 fps. THe speaker are easily the best speaker i have heared on any phone tablet or laptop. perfect bass clarity and surround sound. ONe thing to note is on tab s7 you cant change the screen colour temperature as i usually have it cool. apparenty the reason why is becasue it is an LCD note an OLED but you can do it on the tab s7 + \nwould highly recommend this tablet had so much fun using it . And the smoothness of the snapdragon 865 pus chip and the 120hz makes me want to upgrade my A51 to a flagship phones as now the 60 Hz isnt cutting it lol",
            "I was very confused between the iPad Pro and Samsung S7. After spending few weeks going through their reviews I went for the Samsung S7 tablet. It is simply an awesome all rounder tablet that facilitates both the professional tasks such as signing documents manually using S pen and excellent battery life enable you to watch movies without worrying too much about battery going dead.\n\nThank you Samsung for a wonderful experience",
            "Updated old tablet and not regretted 1 minute. Thin and compact design but lightweight but a powerful piece of technology. \nGreat screen and graphics much superior to old tablet. The addition of the stylus makes big difference opening up more possibilities and to be able to do finer details working. Live the magnet point that holds this in place and saves losing easily. Worth every penny for a thin but powerful piece if technology. Greatly recommend.",
            "I was very please with the quality of my new galaxy tab 7. Its a great improvement over my old tablet. It appears solid and well put together as you would expect from Samsung, but it also looked very stylish and crisp. Once signed in, which only took minutes, I found it really easy to navigate and access all my favourite apps. Its no slouch either its smooth and fast and able to taking a quality picture that rivals my mobile telephone. I'm\nVery pleased with my purchase and would recommend it.",
            "Nice n speedy, light in the hand.",
            "All positives no negatives",
            "Good quality good design good size all good",
            "The LCD screen has great colors and using the S Pen is excellent for drawing and writing. It's a very capable tablet and after seeing the S7+ I switched to that to have more screen for multi-tasking with multiple apps. The S7 could be more useful with more ports, like a headphone jack and another USB or HDMI port so you can use it with Ethernet for more stable internet connections and with a headset for video conferencing.",
            "I bought this tablet for my pgce and it has been the best purchase I've made for schooling. Its portable, hardworking and durable I am able to create lesson plans, look up information and keep it on me so that I can add to it as and when needed.",
            "I have wanted this tablet s7 for a while.  It was worth the wait.  I'm not very technical but I enjoy having a go. It was so easy to swap my apps,  etc over to this new device.",
            "Brilliant item with a long battery life. Screen very responsive whether you use the pen or your fingers. Can't fault it on any way.",
            "Firstly easy to setup, with a nice crisp screen, the S pen worked brilliantly, with the touch screen, I was able to pair my nikon camera to the pad for photo down loads within a few minutes, youtube is fab, with great sound using my bluetooth headphones , in all a brilliant tablet.",
            "Purchased for myself to use at home and on hols does everything it says it does fab tablet all round for the price . Superb Tablet",
            "We upgraded to the s7 from an s5e as the features and power are a huge benefit to us. The s pen is amazing to use for photo editing and the ability to share direct to my Samsung phone and send direct to clients really looks professional. Truelly an amazing machine!",
            "Yet another fantastic bit of kit from Samsung I'm very impressed with everything it does, and its very quick and easy to use.",
            "I have an S5e Tab but miss the Spen which I love on my Note10+. So a trade of the S5e for the S7 tab was a no brainer.\nBut the screen is not as good being an LCD compared to my S5e. So I returned the S7\nWhy Samsung as you are renowned for your Amoled screens",
            "Beautiful device and easy to use and exactly what I needed for university with the Samsung note. Quick and really fast, only worried i wouldn't lose the pen at the back because it's magnet.",
            "I really like this device much better than ipad well worth the money",
            "Great impovement compared to my previous Tab 3, which was itself excellent , the fact it lasted so well gives me the confidence going forward that the S7 will be yet another superb Samsung product.",
            "Think it is good but processing speed and the Touch Screen needs to be more friendly as in Samsung Mobile phones and Apple IPads."
        ]
    }
}