{
    "769/8817": {
        "remotekey": [
            "769/8817"
        ],
        "item_category": [
            "With 3 GB RAM, 32GB storage and a powerful quad-core processor, Fire HD 8 Plus delivers a smooth experience whether you're browsing the web or binge-watching your favourite series. Download and stream more with up to 12 hours of mixed-use battery life and up to 1 TB of expandable storage. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "20 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "90%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "24 March 2021",
            "19 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "3 December 2020",
            "2 December 2020",
            "21 October 2020",
            "10 September 2020",
            "3 September 2020",
            "18 August 2020",
            "12 August 2020",
            "5 August 2020",
            "4 August 2020",
            "22 July 2020",
            "8 July 2020",
            "7 July 2020",
            "1 July 2020"
        ],
        "review_title": [
            "Decent device",
            "Bought for 6yr old daughter",
            "Excellent value for mo ey",
            "New tablet.",
            "Nothing to rave about",
            "Excellent tablet",
            "Amazon Fire HD+",
            "This is a great handheld thingy !!!",
            "fantastic picture",
            "Fab",
            "Not what I thought it was",
            "My wife is super happy with her kindle fire tablet",
            "A lovely tablet",
            "It looks very fast and  materials like books to re",
            "Great product. Fast and easy to use",
            "Filelinked. ;)",
            "Kindle fire 8hd plus",
            "Impressed...",
            "Great tablet but NO CASE",
            "The Amazon fire 8 HD plus"
        ],
        "review_text": [
            "For the money it's a reasonable quality device. Has a few teething problems, like all Android device's, and is a touch limited with only accessing Amazon apps and games but all in all for a workaday device that covers the basics it's a very suitable purchase. Screen clarity is good, as are the speakers and it's well designed with the speakers at the top when using landscape. Easy to navigate the settings. Would recommend",
            "Fast delivery, easy to use and great battery life.",
            "Just the job for a very reasonable price . Been a huge present success",
            "I was gifted this for Christmas. I love it ,its just big enough to hold but not heavy.its so fast and responsive ,much faster than my old one. Screen is clear and the colours are vivid, instructions easy to understand, even for an oldie like me.!!!!!\nWould definitely recommend.",
            "I have recently bought this, having had a Kindle Fire HDX for a few years. Replaced it as I thought there was a fault in the volume. No, this one isn't great for sound either. The picture on the HDX is far better. Maybe I'll get used to the Fire HD8 Plus hopefully and find more pros than cons.",
            "Easy to setup and use",
            "Much like previous models but with a USB C port. With 3 gbs of RAM it is heavier than the other 8\" model which has only 2GB. Unlike previous models you start with 32GBs of storage instead of 16GB. Also it has a wireless charging capability but you have to buy the charging unit seperately.",
            "Ideal to take out and about \nJust wish it had a better camera\nThis little device could help people use their brain to delay dementia. \nKeep doing puzzles\n and word games\nErrr what's my name",
            "just  as good as expected",
            "Got this instead of a kids fire and it does everything and more just downloaded the amazon kids app onto it and got a case from ebay for it for 7.99 very pleased with the tablet",
            "Doesn't do what I thought it would do",
            "My fire tablet is so easy to use and im chuffed that i chose the eight inch screen as it is perfect to use rather than my phone",
            "This is a great tablet which is really fast and has a great battery life. Fabulous for reading my books, p[laying games and browsing.. Everything I wanted, thank you",
            "Very portable and handy.",
            "bought for my son he loves it really easy to use .",
            "Very good tablet runs filelinked nicely ;)",
            "Brought as a replacement for my kindle fire. Just as good, plus I have alexa as well now. Really pleased",
            "This is my fourth Fire tablet and it is the best one yet,it is a lot faster and more responsive than previous ones due to the extra RAM.Its definately worth downloading google playstore like i have which in effect turns the tablet into a great value for money purchase.Perhaps my only criticism is the on off and volume buttons can get in the way a bit when playing games,though this is just knit picking.Battery life is excellent,and being able to charge it on a stand is great...",
            "After ordering this I was very pleased with everything, quick delivery, good price and good tablet design BUT the description said it comes with a kid proof case, it doesn't. Argos replaced it but STILL no case! Beware you will have to buy your own case.",
            "The Amazon fire 8 plus HD is absolutely fabulous it's got a good size memory and it works fast and my daughter loves it."
        ]
    }
}