{
    "943/2514": {
        "remotekey": [
            "943/2514"
        ],
        "item_category": [
            "Live every moment with the ultra-handy 10.1 inch Alba tablet in silver. Designed with a bright IPS screen and easy to navigate display, this palm-sized device is perfect for keeping the little ones entertained. There's even a parental control app, so you can rest assured knowing they're safe from adult content. With front and rear cameras, take photos in an instant and enjoy 32GB of storage and up to 64GB with a micro SD card. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "67 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "81%"
        ],
        "review_rating": [
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "1",
            "5",
            "2",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "4",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "3 July 2021",
            "26 June 2021",
            "10 June 2021",
            "10 June 2021",
            "9 June 2021",
            "2 June 2021",
            "20 May 2021",
            "5 May 2021",
            "4 May 2021",
            "29 April 2021",
            "28 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "16 April 2021",
            "15 April 2021",
            "15 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "14 April 2021",
            "13 April 2021",
            "8 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "6 April 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "30 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "17 March 2021",
            "11 March 2021",
            "10 March 2021",
            "9 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "27 February 2021",
            "25 February 2021",
            "24 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021",
            "23 February 2021",
            "23 February 2021",
            "23 February 2021",
            "23 February 2021",
            "23 February 2021",
            "17 February 2021",
            "17 February 2021",
            "17 February 2021",
            "16 February 2021",
            "11 February 2021",
            "11 February 2021"
        ],
        "review_title": [
            "Poor quality",
            "Good value",
            "Well Recieved Gift",
            "Alba 10.1inch 32gb he tablet silver",
            "Good product",
            "Great item child loved it",
            "Tabet",
            "Tablet",
            "Great",
            "Cheap, acceptable quality",
            "Perfect for my son and good value for money",
            "so good I bought a second for my mum",
            "Pad",
            "Fab little tablet for price",
            "My Alba 10.1 inch Tablet works good.",
            "Alba tablet",
            "Easily broken",
            "One of the best items that I have bought in a whil",
            "Cheap price, cheap product. Maybe ok for kids",
            "Tablet",
            "Best",
            "Good size tablet",
            "Fantastic value",
            "Tablet, is just what we needed",
            "It was great",
            "Alba tablet",
            "",
            "Great tablet for the price",
            "Alba 10\" tablet",
            "It is OK",
            "Alba tablet very easy to use",
            "Very light, and quick, excellent quality and value",
            "Good value very fast and easy to use",
            "Great value Tablet",
            "It has a nice design and easy to use but abit slow",
            "The tablet was for my mum",
            "Glitches and turns off",
            "Works great , fab screen.",
            "Ipad lenove",
            "Crashed and returned",
            "Easy to use",
            "Nice with two protective case",
            "Good Tablet",
            "Excellent value for the money",
            "Brilliant",
            "Nice large screen. Excellent picture quality. Defi",
            "Ok for kids",
            "Loads fast & good HD screen",
            "Painful and frustrating!",
            "Cheap little tablet",
            "Good value for money tablet",
            "Returned after 2 hours!",
            "my tablet is easy to use and quick setup",
            "As expected & easy set up",
            "",
            "Very pleased",
            "Great tablet for a young child",
            "My daughter loves it",
            "Tablet",
            "Great tablet",
            "Okay tablet but slow",
            "Good little tablet",
            "Great little tablet",
            "Great tab for great price",
            "Good for the money",
            "Great product easy to use great value for your mon",
            "Great functional tablet for affordable price"
        ],
        "review_text": [
            "This is the 5th one I've had now, either charging port breaks or touch screen goes",
            "Good for the price, battery usage good,",
            "Item purchased as a retirement gift. Is easy to use and does what it was purchased for.",
            "I think the quality is great and download is really fast better then my last on",
            "I bought this  for my child 2 weeks ago, and I am happy with it.\nWe have it for games and YouTube videos and is just fine",
            "Fantastic tablet easy set up and child very happy with it",
            "Perfectly happy with the product",
            "Bought this a week ago and its perfect so happy thankyou.",
            "Does everything I wanted it to do for a great price",
            "The tablet's quality is \"a kind of OK\", purchased for my son. The charger is not the best quality. \nRecommended only for basic use",
            "Bought this to replace my son's smashed one and it is perfect for what he needs",
            "great device for the price. bought to read/play scrabble so wanted a big screen. my mum (87) liked it so got her one too. we listen to radio, read the news, look stuff up and email. cameras arent brilliant and battery life isnt great. not sure how durable the screen will be, mine mght be already starting to show some scratches. the protective cases dont have a cover on, so when not in use they collect dust, there isnt a purpose made case/cover available. but all in all a good little purchase",
            "Do buy.it’s fast,light and easy to use,more or less idiot proof and in my opinion worth the money",
            "Beautiful little tablet. Great fun and perfect for the kids. Good battery life and easy to use. Can't fault anything about it really apart from apps take a while to download. Even better that it comes with two cases. Excelled yourself Argos with this item. Thank you!",
            "The customer service in all your store is Excellent. And my Alba 10.1inch Tablet looks great and works brilliantly. I would recommend Argos to everyone i see.",
            "It doesn't let me do much on the Internet a can only use Facebook twitter ect for adult content it won't let me",
            "Brought this as a replacement for my 9 yr old son. Charger port broke within 2 weeks but then the port wasnt that great to begin with. My son accidently lied on it and the screen cracked. Battery is useless. Lasts all of about 2 hours before having to charge it up again and it doesn't like being used while charging",
            "The tablet is one of the best items that I have bought in such a long time and well worth the money",
            "Cheap price, cheap product. Screen shows lines during movies, Bluetooth not stable. Ok for child who just plays games.",
            "Easy to set up, easy to use as it's Android. Screen quality great for playing TV and video. Sound quality without an external speaker great. Connects quickly to WiFi.",
            "The tablet is easy to use and simple to set up. I use for recipes on you tube it's great for playing games. Easy to read and clean and helps you through anything you are not sure of .",
            "Nice tablet and works well only thing is that the battery life could be better. It also came with two silicone cases. Would recommend that to get a screen protector.",
            "It wouldn't connect to the internet abd wouldn't  charge took it back as it was no good",
            "Bought for my mum who only recently started using technology and so easy to use.",
            "Great price and great service",
            "Returned it as every time I watch something on YouTube, the screen went black. No hassle in returning it. Ordered instead a mobile phone in lieu.",
            "The grandkids loves it",
            "11yr old daughter bought this with her birthday money. She wanted a tablet to watch streaming channels and play online games. Tablet works brilliantly for what she wanted one for and is very reasonably priced. You also get 2 silicone covers included which is a nice touch and good for children who don't want to wait to use it! Would definitely recommend",
            "Great tablet for the money, the screen size is great for playing games on.",
            "Good little tablet but it is a bit slow booting up. Otherwise it does the job for me - it all depends what you need it for. I use it to watch TV/Film, Sport etc and do online shopping along with some searching on google. Apart from boot-up GOOD.\nHave problemwith trying to buy proper cover for it apart from the 2 gel protectors provided.",
            "Had this brand before. Quick, big screen, comes with colourful cover",
            "Very light, and quick, excellent quality and value for money.",
            "Good value and easy to use",
            "Great beginners Tablet.",
            "It's nice one the only problem it slows down every time you try to open any appreciation.",
            "I bought the tablet for my mum she's still not navigating around it as good as the other ones she had no doubt shoemaster it pretty good tablet would recommend it",
            "My tablet arrived and within a day showed signs of not working properly. It would glitch when I opened apps and would turn off randomly when I'd take it off charge. I was very lucky to have gotten back my money.",
            "Great for roblox and youtube , great sized screen , my daughter loves hers.",
            "Easy to work good peformance and excellent speed..set up was simple and overall i would rate this appliance 8.5 out of 10",
            "Brought for my 12yr old to play on and watch tiktok , easy to set up, looked OK for the price but had to return it within 30 mins as it kept crashing .had a refund and a very upset birthday boy . Ending up buying one from curry's for £110 and definitely worth the extra money .",
            "It's good value for money. It is great for doing my zoom meetings.",
            "Thanks projective case looks good as well.",
            "Great tablet, it can be a little slow at times but most of the times it's fine. The screen jumps a little on certain apps. Great price for the item. Comes with 2 free plastic covers. Very happy with it",
            "Recommended, this product does exactly what it says on the tin...no issues at all.",
            "Brought this my daughter who is 8 she loves it easy to use and the 10.1” screen is perfect for her to watch YouTube.",
            "Do use case provided (2 come with the provided).",
            "Got this for my daughter. It’s good for the price but a little slow at loading. Fine for watching netflix and playing a few games.",
            "Great value for money & it is fast downloading & great for streaming. Quality HD screen.",
            "I bought this tablet to replace my broken Samsung tablet. Reviews were good, good price, came with two cases, etc.. Unfortunately for me, the tablet was slow and unresponsive. It took forever to open anything, kept freezing and disconnecting from the WiFi. I took it back and got a refund. Maybe I was unlucky enough to have been given a duff, but put me off exchanging it for another.",
            "For the price, it's really good. Quick and easy to set up with a large clear display. The two extra cases are also a bonus.\nOnly negative I've found is the quality of the camera, at only 2mp you can't use it to take decent photos but I didn't get it for that. It's great for social media and playing games on.",
            "Bought this tablet for my daughter as her own. It is well worth the value for money. I will be buying another for myself when y current tablet breaks.",
            "Bought it fro my mum. Got it home and set it up for her. After that, everytime she went on to YouTube the tablet just crashed completely and switched itself off. \n\nThis was after only an hour of having it. Returned it straight away as clearly there is a fault with the product. \n\nWouldn't recommend this Alba tablet at all.",
            "great item so easy to use and light weight",
            "Happy with purchase and service.",
            "The battery life verry poor",
            "Excellent great value for money does everything I want and more definitely recommend to my friends",
            "It's good quality for the money works fine. Great for a small child 5 year old, she loves it. Good amount of storage. The only thing is the camera's are not good quality, but she's more interested in the games and YouTube. The 2 tablet covers are great, one red and one orange. The battery lasts quite long from fully charged.",
            "My 6 year old daughter loves it she gets all her apps on it she wants! She also loved the fact it came with 2 different coloured cases so she can swap them",
            "It’s nice size and comes with 2 covers that protect the corner and for the price it’s brilliant you can down load everything",
            "Delighted with the new Alba 10\" tablet I bought my daughter. Seamless click & collect from local Sainsburys. \n\nTablet is great, quick and easy to use and impressed it came with 2 protective cases as standard. Will be replacing Child #2's tablet with one of these soon!",
            "Good tablet, however had to have a replacement sent due to being sent a used broken tablet (screen scratched,box damaged ect) tablet slow to respond at times but fine for a child",
            "This tablet is perfect for the price! If you're looking for a tablet that is cheap, runs smooth and has a fair amount of storage then go for this one. There was a red and orange case under the box which was a nice surprise and wasn't aware of based off the description so was an added bonus!",
            "Perfect for my daughter. Does the job. Well worth the money.",
            "Great tab, lightweight and sensitive to touch. Buttons feel robust and screen is secure. The covers are also a real lifesaver, great feel and perfect protection especially on the corners. Battery life is pretty good, I use mine for watching catch up so heavy drain on the battery.",
            "Like the product,fast performance,use it to download films and take out and about, battery life acceptable but could be better, good value for the money, very happy with the purpose I need it for",
            "Buy this product it's great easy to use great value for your money. You don't need to buy an expensive tablet.",
            "It's a good size tablet with a lot of memory, design is nice, battery lasts long and charges quickly. So far very happy of the purchase."
        ]
    }
}