{
    "787/2066": {
        "remotekey": [
            "787/2066"
        ],
        "item_category": [
            "The Venturer Challenger 10 comes with the latest Android 10 Software, meaning it's equipped with the latest security protection. A large HD 10\" IPS screen is great for gaming, viewing videos and using all the latest social media apps. With the dual 2MP front and rear cameras you can video call or take snaps. If the 16GB internal memory isn't enough, you can expand with the Micro SD card slot for more storage. Connect to the internet via WIFI and to other devices through Bluetooth. A device to fit ALL your social needs. "
        ],
        "summary_star_rating": [
            "4.1"
        ],
        "no_reviews": [
            "68 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "76%"
        ],
        "review_rating": [
            "5",
            "4",
            "1",
            "5",
            "3",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "2",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "4",
            "5",
            "3",
            "5",
            "3",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "2",
            "4",
            "5",
            "3",
            "4"
        ],
        "review_date": [
            "1 August 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "23 June 2021",
            "23 June 2021",
            "12 June 2021",
            "8 June 2021",
            "29 April 2021",
            "28 April 2021",
            "28 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "16 April 2021",
            "13 April 2021",
            "7 April 2021",
            "7 April 2021",
            "23 March 2021",
            "3 March 2021",
            "24 February 2021",
            "18 February 2021",
            "16 February 2021",
            "11 February 2021",
            "11 February 2021",
            "10 February 2021",
            "6 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "2 February 2021",
            "2 February 2021",
            "2 February 2021",
            "27 January 2021",
            "27 January 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "23 January 2021",
            "21 January 2021",
            "21 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "20 January 2021",
            "19 January 2021",
            "19 January 2021",
            "19 January 2021",
            "13 January 2021",
            "13 January 2021",
            "13 January 2021",
            "12 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020"
        ],
        "review_title": [
            "good value",
            "OK for what I needed it for",
            "Rubbish",
            "Quick and bright and easy to use",
            "Poor sound",
            "good",
            "Venturer laptop",
            "Short battery life",
            "Tablet",
            "Was present for my son he loves it",
            "Love it",
            "Venturer 10 inch tablet",
            "Brilliant",
            "It's ok for the money I wouldn't buy another one",
            "I am really disappointed",
            "A good size.",
            "My iPad is very good for the money.",
            "My daughter loves her new tablet",
            "just what i wanted",
            "It's just ideal gift for my son.",
            "Its a lovely android tablet, but a little slow",
            "Excellent value for money",
            "It works well as a display in the kitchen",
            "Avoid this product",
            "Had to return",
            "Fantastic! so easy to use,",
            "Great",
            "looks good but runs out of power too quick",
            "My mom very happy with her gift.",
            "Great tablet",
            "Battery not great",
            "Good android tablet",
            "Works very well I'm very happy with this tablet",
            "Tablets look good and do job.",
            "Thanks a lot thumbs up",
            "Really Good Tablet",
            "Very light",
            "My son wanted an Samsung",
            "cheap but cheerful",
            "My tablet looks good and works fab",
            "Cheap and cheafull",
            "Its absolutely fantastic",
            "Not good",
            "Easy to use and ready to go",
            "Basic tablet",
            "Venturer Tablet",
            "",
            "Best tablet I've had so far",
            "Tablet",
            "Cheap but best quality",
            "",
            "Seems to be ok time will tell",
            "Great tablet for home schooling",
            "Very easy to use",
            "Tablet",
            "Brilliant",
            "Tablet",
            "Just what the doctor ordered",
            "does exactly what it needs to !",
            "The tablet works really well",
            "Tablet looks amazing",
            "The tablet is great",
            "My tablet.",
            "",
            "Venturer Challenger 10",
            "Really excellent value for money- does everything",
            "good build",
            "Ventura Tablet"
        ],
        "review_text": [
            "It is a very good machine, easy for me to use, compared to other models",
            "Wanted a cheap tablet with a large screen for storing of recipes, cook books (kindle) etc. It does the job what I bought it for. Comes with a charger but can also be charged using a mini USB (charges a bit slower using USB). Initial start up is a bit slow this is minor for the application I bought it for",
            "Heavy, battery doesnt last long, touch screen very poor",
            "Very happy with the tablet",
            "Ok for price , sound and battery not the best",
            "It nice to use I like to use for games. Keyboard on screen the only thing like is battery could a lot better only 6hrs. P.S the Nokia also very good I like screen really good all around. Great Great Great.",
            "Bought a few weeks ago. Don't like it",
            "Every thing about my new Venturer is great except it's battery life.My previous tablet lasted all day, playing games watching films and listening to music. This one seemed to eat the battery life up. Quite disappointed.",
            "I brought it month ago very good but doesn't hold it charge very good runs out battery very quick",
            "This has a big enough screen for my son to watch youtube and the memory is great would definitely recommend this to family and friends",
            "So much quicker than my old one",
            "So far so good a little disappointed with a couple of things the battery life after charging isn't as long as I expected the power drain is a little faster than it should be and a lack of wallpapers to change out of picture at the beginning.Aside from that not a bad wee tablet.",
            "Had no trouble with it and it does what I want it to do.",
            "You get what you pay for.. there's a few glitches with it and it freezes it probably needs to go back",
            "I am really disappointed with purchase . Battery life really bad even I am only using for one thing still have to charge twice .",
            "A good size, easy to you, fantastic battery life.",
            "I very happy with the iPad I got it was very easy set up and nice to work.",
            "Great value for money",
            "wi-fi connection bit slow at first but its fine now,,,,no probs at all , easy set up (if i can anyone can !!) watch films /check weather browse internet ,does the job, very pleased with my purchase, does not come with earphones but, like me i expect you will have random pairs to use from mobile phones etc,,,i did and worked just fine ;)",
            "It does what he needs it for.",
            "Its a lovely tablet lt, has everything and more and good value for money, I brought it for my daughter to use it for her course work, she loves it, only issue is that's its a little slow, but nothing of any real concerns.",
            "This is excellent value for money.  Seems like it would break if dropped  so screen protector snd case adviced",
            "Used as a CCTV display and it is easy to see at a glance across the room",
            "This has a non conventional charging port which is no where stated in the description. I tried returning it 3hrs after collection, but store manager kept coming up with flimsy excuses not to accept it. \n1. It had finger prints on it - she was holding the tablet in her hands with her finger prints on it \n2. The charger is no longer sealed-charger was NEVER sealed, the box was NOT sealed, the tablet was NOT sealed. \nArgos literally forced this on my 3 year old.",
            "Battery life was useless and only lasted approx 2 hrs after a full charge.\nAnother annoying part of the tablet was that the volume buttons were on the rear of the tablet so unable to use if you have a cover on it.\n\nManaged to return tablet & went for the next product up and have had no issues with that one",
            "This tablet is amazing it is so easy to use, brilliant size and charges really fast I would recommend this to everyone for the price.",
            "Just the job for are daughter",
            "Annoyed that it runs out of power to quick.",
            "It's very good tablet for this price.",
            "Bought this for my daughter, she loves it. Battery life just adequate.",
            "Nice sharp screen but other than that there's little to recommend it. The whole thing is a bit cheap feeling. I dropped my old cheapo tablet a couple of times and it's still working, I doubt this would survive. Other than that it is quite slow. The battery life is not great. I can't see how you could use this tablet for 6 hours unless you were just using it to wedge a door open. I did get 4 hours watching full screen videos though so not as bad as I first thought after reading the reviews here.",
            "All positive feedback for this tablet..\nHas everything I need on it,very happy 5*",
            "I would recommend this tablet very easy to work",
            "Brought for work and so far work perfectly.",
            "It means a lot for me in this difficult time \nThank you",
            "Great Tablet, good size screen and good quality picture, also has a screen protector on the screen! It uses chrome and loads really quickly, you can also attach a keyboard which is a bonus. Great sound quality and quite loud, overall brilliant tablet. Got it for a bargain price in the Christmas sale, very happy customer!",
            "Looks good works very well. Not slow at all. Would recommend",
            "My son wanted a Samsung",
            "Not amazing performance of battery or camera or but fine for home schooling - decent volume and large screen, not sude for anything more than zoom or google classroom",
            "Overal very good easy for kids to use",
            "Cheap and chearfull tablet.Battery life is very poor.memory storage is poor.sometimes can be slow.Not bad for the price thou.",
            "Its brilliant better than Samsung and any other big name brand can't fault it",
            "I don't like it.very slow and charging finished very quickly",
            "Needed someone to start it up but we got there",
            "Very basic and doesn't connect  to Wifi like it's supposed to",
            "Lightweight tablet, Very smart and easy to use. Very well made, good value for money.",
            "Good buy! Great value for money would recommend",
            "Great tablet once I switched on I was able to transfer all. My details of my old tablet. I'm 75 and it was great I was amazed to see all my details I thought I lost.",
            "Great tablet good size screen and good price, easy to use and understand, bought it for my husband that is not into technology, but found this easy to use and understand,thanks argos. Great delivery too.",
            "Cheapest 10 inch tablet in Argos, but love it, got everything on, best tablet around for price, would recommend to everyone,\nPerfect for adults and kida",
            "It does what it says and excellent for price.",
            "Only thing I really don't like is the volume control on the back of unit and volume not great",
            "Purchased this for our 5 year old grandson to help with his home schooling. Really impressed at the quality and price of this tablet.",
            "When we got our first tablet sadly it wouldnt work however Argos was very quick to resolve this within less that 24hours we had our new tablet  up and running and it's such a easy straight forward tablet with lots of space.",
            "Bought two of these for online learning both work well the battery life isn't super but in all the tablet and screen size is worth the money",
            "Great price in stock staff exclent",
            "Got this tablet for my daughter for her home schooling.",
            "It's in the price range I could afford value for money",
            "does exactly what it says on the box I’ve had no problems with it so far ...",
            "It runs really well and it isn't enough slow at all",
            "Nice tablet although it runs out of battery life quickly but I'd say it depends on usage too. My daughter loves it a lot.",
            "I would deffo recommend this tablet to anyone with children . My son loves it had no trouble with it at all . Its the best one his had and his had  a few...",
            "Very low battery.Does not work 6 hours.",
            "The battery power let the tablet down. Had to return",
            "Venturer Challenger 10 10.1 Inch 16GB Wi-Fi is easy to set up and use, battery life when in consent use is 2 hours, standby is up to 5 hours. for the price is good for this Challenger 10 10.1 Inch 16GB Wi-Fi. . My grand son plays games on it...",
            "Very easy to use- suitable for all ages and even the least tech- savvy user!",
            "on the plus side has headphone socket on the negative side volume through the one speaker poor.",
            "Nice tablet but it will not connect to my printer, so I can only give 4 star rating."
        ]
    }
}