{
    "918/3612": {
        "remotekey": [
            "918/3612"
        ],
        "item_category": [
            "Lenovo Tab M10 HD is a 2nd-generation 10.1-inch HD tablet that packs a wallop while sporting a premium metal look and feel. A great device that offers top-notch visual and audio, it's also built for families, featuring curated kid's content, parental controls. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "64 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "95%"
        ],
        "review_rating": [
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4"
        ],
        "review_date": [
            "4 August 2021",
            "3 August 2021",
            "1 August 2021",
            "31 July 2021",
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "28 July 2021",
            "26 July 2021",
            "22 July 2021",
            "22 July 2021",
            "21 July 2021",
            "21 July 2021",
            "24 June 2021",
            "23 June 2021",
            "9 June 2021",
            "9 June 2021",
            "8 June 2021",
            "31 May 2021",
            "29 May 2021",
            "25 May 2021",
            "23 May 2021",
            "20 May 2021",
            "20 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "19 May 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "26 March 2021",
            "25 March 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "23 March 2021",
            "23 March 2021",
            "20 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "10 March 2021",
            "10 March 2021",
            "10 March 2021",
            "25 February 2021",
            "20 February 2021",
            "16 February 2021",
            "2 January 2021",
            "29 December 2020",
            "20 December 2020",
            "9 December 2020"
        ],
        "review_title": [
            "Good product",
            "Good value of money, great features!",
            "Great Value......",
            "Tablet",
            "Fabulous tablet",
            "Great",
            "Great features",
            "Review of my tablet",
            "Great Tablet",
            "Excellent tablet",
            "Fantastic",
            "Easy to use",
            "Great value",
            "Fab little tablet",
            "Very disappointed",
            "Brilliant Lenovo Tab.",
            "Happy customer",
            "Works brilliantly",
            "Great",
            "Very quick and fluid with great fixtures",
            "Quite a fast little tablet.",
            "More or less excellent tablet",
            "Super happy",
            "Would recommend",
            "5th lenovo tablet i have bought and best one yet",
            "Easy to use",
            "Much better than expected for the price",
            "Easy to use and simple to set up for technophobes",
            "Nice lightweight tablet at a very reasonable price",
            "Surprisingly Great",
            "Lenovo M10",
            "Great Value for Money",
            "Great features",
            "very much faster than 2g lenovo",
            "tablet",
            "Good value",
            "Fantastic product at great price",
            "Perfect",
            "Lenovo",
            "Great value for money",
            "Freezes for a second occasionally",
            "Very nice and clear.",
            "",
            "Looks good performs well",
            "Prefer the previous model",
            "Fab little tablet for use with Zwift",
            "Fantastic Tablet",
            "Great for my 6 year old",
            "Good Choice Tablet",
            "Good tablet for size. Lovely clear screen.",
            "The tablet is a good spec at reasonable price",
            "Good tablet still getting used to be all it can do",
            "Gift",
            "none better for the price",
            "Lenovo tablet absolutely fantastic get one",
            "A good budget tablet",
            "Fantastic tablet, really fast and compact.",
            "Not enough help yet to be able to use it.",
            "Great tablet for the money.",
            "Perfect for the price.",
            "Cracking Christmas gift",
            "Great for price",
            "Disappointing",
            "Lenovo tablet"
        ],
        "review_text": [
            "Bought this for my son and he’s really happy with it.",
            "I bought this tablet few weeks ago for my daughter. Its value of money.",
            "So far so good.... Great spec for the price....",
            "Good value for money, sold laptop for this tablet and am using it every day, no problems.",
            "Am delighted with new Lenovo tablet, the best one i have owned.  So easy to download all the relevant apps from Playstore, crystal clear pictures and great dolby sound quality.  Would highly recommend.",
            "I'm happy to buy this device",
            "I bought this for my as birthday gift . He is over the moon",
            "It seems to be good at what ever task and app I use it on. Very happy so far.",
            "My both kids are really happy to have it as birthday present.\nIts really fast operating.",
            "Very pleased with this - good screen, Android 10 (updated almost immediately to 11), fast. Bought a gizmo that enables me to connect to TV/HDMI devices",
            "I have bought this nearly a month",
            "Linked with my phone straight away. Good product, fast,and does what you want for the money.",
            "Bought this tablet to replace my Amazon fire and am blown away with its speed and quality, fantastic value would recommend to anyone who asks",
            "I bought this a month ago as needed a new tablet and couldn't afford a new ipad.\nI bought this tablet for the specs, 4gb of ram and 64 gb, plenty for me for my games and books.\nAdded bonus was the price. It's a great little tablet.",
            "Couldn't connect SD card from camera via usb to download photos. Older Lenovo tablet did this, why not the new one?",
            "Hi, this Lenovo Tab M10 HD 2nd Gen is a really great Tablet. For the price the spec is really good. Android 10 out of the box and updated to Android 11.  Totally upto date, it's just brilliant. I must admit that I was a bit concerned about the screen resolution but I needn't have worried it's absolutely fine. It's fast, easy to use, and sounds great. If you are after an Android Tablet, I thoroughly recommended this model. Buy it you won't be sorry, I'm not.",
            "Excellent tablet, does everything required and more, easy to set up.  The only thing is the screen protector provided, putting that on was a nightmare as it had a slight crease and there was no way to get all the bubbles out so am having to live with it!",
            "This was an upgrade to my previous Lenovo tablet and I'm very happy with it.  It's fast when using the apps , battery life is very good for what I use it for and it's also very slim and light. Graphics are great too.",
            "Great little tablet, just what I wanted five Star",
            "I bought for about a month and I'm very happy with it,  also my daughter.",
            "So far so good, happy with the size and screen.Our first Lenovo.",
            "I bought this tablet as it was an excellent product and excellent price. Works super fast, loud and looks gorgeous. Love using it for social media and emails.",
            "I bought this a month ago and my kids are super happy with this tablet. Works perfectly fast, exceptional item!! Thanks Argos xx",
            "I bought the tablet as a gift for my mother. \nI was very pleased with how quickly it was delivered and packaged. \nIt was really good value for money snd easy to set up. I would definitely recommend",
            "Very nice tablet, slim design. Loads apps and games very quickly. Battery lasts for hours, my son loves his new tablet :)",
            "Very pleased so far easy to set up and good clear screen",
            "Good tablet, much better than anything in this price range. Nice colors, crisp screen. Screen well supported at the back. Really happy with the purchase.",
            "Purchased for elderly relatives. They love it!\nNice and easy to use.",
            "Nice lightweight tablet, I like the clear screen and sound. Would have had 5 stars, but I find it a little laggy compared to my previous table and also the battery life is not as good.",
            "Pleasantly surprised, this is very good value for money.\nIt has a nice size screen and is swift to the touch .\nHighly recommended",
            "I bought a week ago and am so happy. Good battery, great storage, good camera quality, good sound quality.",
            "I bought this tablet last month and I am super happy with it",
            "I’ve bought it a month ago and my daughter and mother really enjoy it. A bit heavy but really nice  and It’s easy to use",
            "very much faster than 2g lenovo  this replaces 4g i.e. double the ram memory makes a big difference in performance",
            "great tablet does everything you need",
            "3 weeks old. Lived up to reccomendations. A little sticky in the bluetooth section, and some other areas, in terms of intuitive navigation; but for the money very good.\nLooks smart, and lightweight, easy to charge etc..\n\n3 models with different internal GB, so you can select as required.",
            "Fantastic product at great price",
            "It's easy to set up. I'm not a tec person so easy to operate. There is nothing I don't like about it. I would recommend it",
            "bought this Lenovo M10 (2nd)gen as my old one was passed the sell by date easy to set up its quick long battery life",
            "Great product. Good quality. Excellent value for money!",
            "Great product does occasionally freeze for a second when on certain apps",
            "Such a clear screen it was like watching football on television fantastic contrast.",
            "Nice size\nHD display is good (I do not watch films or play games) . I use my photos for wallpaper and lock screen and they look really good\nI added SD card for added storage because it is easy to fill as I am not as efficient as I should be at deleting, not because it is necessary.",
            "I bought this for this my partner and she is well satisfied with it does everything she wants best present i could have bought",
            "Not as good as the previous model",
            "Bought to use with a Turbo Trainer and Zwift. Performs well and a nice general tablet to use for general browsing too",
            "This is the best 10 inch tablet I have brought, fast response and brilliant graphics",
            "Tablet bought for 6 year old. Working perfectly..no issues",
            "I'm really pleased with this tablet, I upgraded from my old Lenova as I needed more memory.This is narrower than my old one so easier to hold, the only draw back it that with my old one when in the middle of a game and an advert came up I could get back easier to page I was on by pressing arrow at bottom of tablet this tablet does not have a choice when you swipe it it takes you back to the home page but saying this I'm more than happy with it, and it was a good price,  would recommend.",
            "Good value for money. Lightweight. Easy to use. Lovely clear screen.",
            "I purchased this tablet as a replacement for my wife. We decided on an acceptable spec which this product met on all fronts. Very high spec for reasonable price and my wife is very pleased with it. We recommended this product to a neighbour who wanted to replace her tablet. She purchased the same item and is also very pleased with it.",
            "Very good as good as a full size computer does everything I need it to us",
            "I bought it for my friend and she likes it and good for what is intended for.  Thank you",
            "after comparing specs and reviews on several models on several sites, this came out top of the list and doesn't disappoint. great battery life, screen and fast 8core cpu beats all others up to £100 more expensive. a real no brainer.",
            "This tablet is fantastic so easy to set up runs super fast and the screen clarity is second to none its that good within two days of purchase my son in law also   bought one and he is using his for work purposes that how good these tablets are  it looks good, feels good, and works exceptionally well you won't regret buying this tablet  and such great value.",
            "I buy this tablet for reading some ebooks and for a domestic use. It's quick and easy and I think it worth the price.",
            "The batter could last a little longer, but the speed and simplicity is perfect.",
            "Can't rate it at present as I'm still trying to get the hang of it.  Could do with more information and instructions about how to use it.  I downloaded the manual but it doesn't say enough to help me use it.",
            "Great value tablet. Very responsive, screen decent. Lenovo very good to deal with.",
            "Perfect for the price. Battery lasts long and can handle multiple apps running at the time. If you are looking for a HD screen I'd reccomend something a bit more upgraded than this tablet, but for what I wanted it for, it's the perfect match.",
            "Bought this tablet to replace his old Lenovo, a couple of user changes have frustrated him but that's down to being old & set in his ways, not the tablet.  He likes it very much , just needs to get used to it. Great quality  again!",
            "Easy to set up and use. It is a good price for my son as a move up from his Fire.",
            "Seems like Netflix only streams in standard definition not HD which is disappointing. Also a strange on-screen widget is present on the left edge of the screen that I cannot as yet remove. Build quality and audio is better but if I had known about the Netflix issue before purchasing, then I would have looked at alternatives",
            "Very polite customer service people and very helpful. Really good tablet,  good for your eyes"
        ]
    }
}