{
    "848/3148": {
        "remotekey": [
            "848/3148"
        ],
        "item_category": [
            "The HP Pavilion Gaming is all about smooth performance and crisp graphics wrapped up in a bold design. So not only do all your games run and look attractive when you play, your setup can look attractive at the same time. Geared with the latest technology, the Pavilion Desktop puts a serious level of performance in your hands. Seamlessly go from creating by day to gaming by night, without ever slowing down. When you have this much power supported by the GTX1650 graphics card and Ryzen 5 processor there is nothing holding you back. "
        ],
        "summary_star_rating": [
            "4.3"
        ],
        "no_reviews": [
            "8 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5"
        ],
        "review_date": [
            "21 April 2021",
            "13 April 2021",
            "5 January 2021",
            "25 November 2020",
            "8 November 2020",
            "3 September 2020",
            "2 September 2020",
            "4 August 2020"
        ],
        "review_title": [
            "Great entry level gaming PC!",
            "Great PC quick to install ideal for gaming .",
            "HP Gaming",
            "Computer looks good",
            "It works fine.",
            "A reasonably priced compact gaming computer",
            "You lose 2 gb of memory",
            "Gamer son adores his new birthday present"
        ],
        "review_text": [
            "A lot of games I've tried seem to want at least 16GB of RAM - so that is the first thing I'm going to upgrade... but, they seem to play fine!\n\nForza 4 (on xBox Game Pass) says it needs to be set on the lowest settings (doesn't meet the minimum requirements), but it looks great and 99.9% plays without glitching, so that'll only improve with more memory!\n\nIt comes with;\n1x HDMI and 1x DVI - GTX1650\n1x Covered up HDMI - Integrated on Ryzen 5 3400G (not used)\n\nWell built, lots of ports",
            "My old PC died and I was in a panic!! \nSo purchased this one and it was delivered with in 48 hours .\nExcellent service from Argos and the PC works well \nVery pleased with the product and service.",
            "This desktop was very easy to set up and took no time at all to get running for my sons Christmas. \nThe graphics are as good as the gaming machines in my view and he can also this for homework.",
            "As expected the computer is different to the old one. Just a case of getting use to it",
            "It starts really quick and runs smoothly. No noises whatsoever.",
            "Needed a more capable computer to run the new flight sim program I had purchased and this fitted the bill perfectly,  price wise, size wise and had all and more needed as far as graphics and memory and speed required. Easy setup and it does the job ease. Would recommend.",
            "The pc has a built in graphics card as well as the discreet card installated. The built I. Card is assigned 2 of the 8 gb of ram. I have searched the web and the HP support forum. There is no way to stop windows 10 from recognising the card and assigning the memory. This is annoying as I bought a machine with 8gb As I use a couple of memory hungry photo and video editing apps. I have now had to go buy an aftermarket memory module. This feature is not mentioned or documented anywhere.",
            "Our son just celebrated his 19th birthday and needed a new PC so he can continue to do his Twitch streams as he is an online gamer under the name @thebajagamer\n\nHe is absolutely ❤️‘N his new gaming pc which is super fast and exactly what he wanted. I’m sure this will help his streams and build followers/subscribers"
        ]
    }
}