{
    "897/1894": {
        "remotekey": [
            "897/1894"
        ],
        "item_category": [
            "Purpose-built to catapult you into the world of gaming and esports, this formidable tower will burst your productivity and creativity options wide open. The Lenovo IdeaCentre Gaming 5i is available with Intel Core processor, NVIDIA GeForce GTX 1650 discrete graphics GPU, 16 GB DDR4 memory, and storage options encased in a refracting Chameleon Blue compact configuration. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "5 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "20 June 2021",
            "9 June 2021",
            "22 May 2021",
            "25 February 2021",
            "27 August 2020"
        ],
        "review_title": [
            "Good spec pc, good value, performs well",
            "Great features",
            "A perfect PC for my needs!",
            "Gaming Pc",
            "My 9 year old is so happy he can play properly"
        ],
        "review_text": [
            "Nice pc, style is pleasing, performance is good for what I need it to do, mainly music related projects, is capable of running the few games I posses easily (I'm not a shoot-em up gamer per se`)... would like to have a few more USB sockets available but a hub has sorted for me",
            "I Bought this a few week ago and I’m happy",
            "What can I say: this machine is wonderfully apt for my hobbies, that maybe aren't so grand as other people’s (video editing for fan projects, and the odd bit of gaming, basically). But straight out of the box, I was surprised by how small it was, which is no means a bad thing at all; in fact, I love the size of it, as it fits right under my desk better than any other PC has in the past. It’s size also makes it very portable too, so I could take it to someone else’s house very easily. Anyway, the day it came....I turned it on; went through the initialising settings, and boom, I was in and ready to go.  I purchased a newer version of a particular video-editing software (Vegas Pro 16), opened up an old project of mine, and straight away, I felt the difference in power and efficiency. With the amount of ram being double--and the graphics card's power also being double of that than my previous machine--I was able to have preview settings on max and enjoyed absolutely no lag or delay in feedback and frame-rate. What’s more, even when some of the projects I work on get fairly complex and layered, there generally still tends to exist a consistent spare 50% of untapped memory usage; allowing me to really get stuck in and attempt more ambitious projects as I go along! This machine also does fairly well with some of the modern titles of today's video games, (e.g. Assassins’ Creed: ODYSSEY plays very smoothly on high texture and lighting settings). All in all, I couldn’t be happier with my purchase, and I recommend this product to anyone who’s looking for a budget computer with impressive specs. Thank you, Argos!",
            "My son wanted a gaming pc, he is happy with his purchase. Much faster than previous laptop he used.",
            "No glitching on games anymore for my nine year old son ! Looks great and so quiet . Am very happy !!"
        ]
    }
}