{
    "898/6391": {
        "remotekey": [
            "898/6391"
        ],
        "item_category": [
            "MSI MAG META series gaming desktop features AMD Ryzen processor and the latest NVIDIA GTX SUPER series graphics card. Exclusive thermal solution with the best air cooling, promise the longer system performance. RGB lighting effect design with tempered glass, show off your personally gaming style. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "5 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "4",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "20 April 2021",
            "3 March 2021",
            "12 January 2021",
            "13 December 2020",
            "18 August 2020"
        ],
        "review_title": [
            "Good but with problems",
            "Msi Mag",
            "AMD PC.",
            "Super-speedy machine, does what I want and so much",
            "My computer is the Bee's Knees"
        ],
        "review_text": [
            "Overall it's good but I found it to be missing something's that are kind of essential to a gaming pc. For example it only has 1 cooling fan, there's no built in WiFi or Bluetooth, and 8 GB of ram is enough for basic gaming it struggles if you play anything to demanding",
            "This was brought by my gaming son, if hasn't complained yet. So presume its OK.",
            "Good Medium Quality PC, plus availability due to Covid made it a no brainer buy as I doubt I would have gotten anything sooner, does the job nicely.",
            "Super-speedy machine, does what I want and so much more. Would definitely recommend to anyone serious about gaming",
            "I have had a few computers in my time but this is the best by far and if I wish I can upgrade it far beyond what I will ever need . My main use will be for photography and graphics with a dabble into games ."
        ]
    }
}