{
    "844/1805": {
        "remotekey": [
            "844/1805"
        ],
        "item_category": [
            "The space-saving Vivo AiO V222 is remarkably slim and light and its NanoEdge display features an impossibly thin bezel for edge-to-edge viewing and an impressive 87percent screen-to-body ratio. The stunning 21.5inch Full HD LED widescreen display includes wide-view technology that makes it perfect for sharing pictures or videos with friends and family, no matter what angle the display is viewed from! With Full HD (1920 x 1080) resolution, you'll enjoy games and movies in beautiful detail, with amazing colour and contrast. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "29 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "23 June 2021",
            "23 June 2021",
            "28 April 2021",
            "20 April 2021",
            "18 April 2021",
            "23 March 2021",
            "17 March 2021",
            "16 March 2021",
            "2 December 2020",
            "1 December 2020",
            "17 November 2020",
            "11 November 2020",
            "10 November 2020",
            "4 November 2020",
            "30 October 2020",
            "28 October 2020",
            "28 October 2020",
            "28 October 2020",
            "22 October 2020",
            "22 October 2020",
            "20 October 2020",
            "14 October 2020",
            "13 October 2020",
            "9 September 2020",
            "8 September 2020",
            "8 September 2020",
            "8 September 2020",
            "8 September 2020",
            "2 September 2020"
        ],
        "review_title": [
            "Asus Excellent quality",
            "Lovely neat looking fast pc",
            "Great Computer ASUS Vivo V222 21.5in Pentium",
            "Great for my work",
            "ASUS Vivo V222 21.5in Pentium 8GB 1TB",
            "The computer is brilliant",
            "Best purchase in a longtime!",
            "",
            "Good looking and good value",
            "Good all in one",
            "",
            "ASUS- ALL IN ONE PC IS AMAZINGGGGGG",
            "Very good All in one",
            "Great system for the money!",
            "Really pleased with it. Lovely clear screen,",
            "My computer is excellent easy to set up and use .",
            "Fantastic product left lots of room on the desk",
            "My computer Works fab",
            "Value for money",
            "Computure looks good",
            "Great all in one pc",
            "Really happy with the quality",
            "Very good value for money",
            "my desktop",
            "LOOKS GREAT AND FAST",
            "Works well",
            "Brilliant computer for a very good price",
            "All in one pc",
            "Very fast"
        ],
        "review_text": [
            "Very happy with my purchase.  Slick and it works perfectly. No problem so far.  Yes, recommended",
            "I'm so happy with the purchase. The pc is neat and tidy looking and quite fast",
            "Very pleased with this ASUS computer. Very silent, much quicker than my old ASUS laptop, very pleasant to work with. Fits all my requirements: 8G RAM, 1 TB hard drive. \n\nPity that Argos was not providing home delivery on this product though. That was a massive let down mostly with the problems generated by the plandemic.",
            "I run a business from home working on the internet a lot and this is the perfect upgrade for me. Nice and neat looking. Was a bit dubious but glad that I took the plunge to buy it.",
            "Nice desktop takes up far less space than traditional tower units and reduction in cables is also a massive benefit. Obtained quickly through Argos at a fair price very easy to setup only downside would be quality of built in camera however not a problem I have connected old HD camera.",
            "Brilliant it is good",
            "I bought this PC after my laptop crashed, my main use is for university but this little number is awesome! \n\nThe PC is great! It has a good spec and performs really well!\n\nIt’s great been an all in one monitor and  PC box, massive space saver! It has a long length power cable which helps so easy to move around if required! Great it has wireless mouse and keyboard!\n\nThe design and colours are great and for the price it is definitely worth a buy!",
            "The only things are that it's quite slow when it starts up and sometimes during operations it freezes for a few minutes. Seems to be too sluggish for a brand new machine!",
            "This is a neat looking computer and is great for basic family computing. It's not particularly fast but it's great quality.\nWith it's built on camera it's just what I need for keeping in touch with family and friends. Apart from that it will be mainly used for writing and for social media. \nCertainly recommended",
            "Working from home using an old laptop was a struggle so we invested in this great all in one, easy set up no cables apart from the power one.\nGood screen size ideal pc. \nAm not a fan of HP so its nice to get this, much better all in. \nPlease consider this you will not be disappointed at all. Argos at a great price too i uses buy now pay later on my argos card perfect thanks Argos merry Christmas",
            "Thought mouse broke till seen There is a wireless usb plug in the mouse need plug into the bk of pc for it to work.\nEasy set up .stylish looking don't take up much room. Mic bit quite n web cam bit fuzzy overall good pc",
            "EASY SET UP, SLEEK, WIDE SCREEN AND I JUST CAN'T EXPLAIN HOW HAPPY I AM",
            "Long time I am waiting for this all in one pc but every time out of stock. Wherever comes in stock I can order quickly and Collect next day. Pc is really very good and Argos is also gives good service at all.",
            "I bought it for doing music production and my son uses it for Roblox and it does both jobs very well.\nIt's a very compact unit and fits in the corner and is very quiet. \nWas very easy to setup.",
            "Really pleased with my company. Looks sleek and modern, us easy to set up and operate. I only need it for basic things and this is just the job. Great value.",
            "I WOULD RECOMMEND THIS COMPUTOR ,TO ANYBODY. IT IS FANTASTIC TO USE ,AND WAS SO EASY TO SET UP ,I AM OVER THE MOON.",
            "Fantastic product great computer lots of room left on the desk and a good memory.",
            "My computer is really fantastic and I believe I have the right choice.",
            "The PC is great, doing what I need it for and my son can use it for college too.\nIt doesn't take up a lot of space which is a bonus.\nThe sales woman was fantastic! She gave a lot of info and was a big help.",
            "Daughter is so happy with this and plays her sims 4 and Minecraft with no problems well worth the money",
            "Great set up would recommend",
            "Fantastic pc, I've never brought an Asus product before but I am impressed with the quality and the convenience of the wireless mouse and keyboard. Easy to set up plus connects to my printer straight away, no problems. Genuinely have nothing bad to say even comes in a convenient box with a handle, there've literally thought of everything. Highly recommend",
            "I'm 68 and found this computer quite easy to set up, with a bit of help from my daughter as she quicker on keyboard than me, very easy to use and quick, my old laptop was a dinosaur compared to this one, still early days but so far very happy. Also my 8yr old grandson loves it and helps me on it!!",
            "excellent value for money and really easy to set up",
            "GREAT BUY WOULD RECOMEND",
            "I only use the computer for lite to general use and it is perfect for it the wireless keyboard and mouse work really well",
            "This is a brilliant computer given the price. Very responsive and excellent clear screen quality.  A little apprehensive being a new model and no reviews as a guide but now up and running cannot fault it. In fact from my experience I would highly recommend it.",
            "so easy to set up about ten minutes if that. Initial set up on screen is all talked through for you by Cortana, like an Alexa. Bought for my daughter and she loves it, big bright screen, great graphics. Highly recommended",
            "I am very please i love mi new computer very fast"
        ]
    }
}