{
    "886/8835": {
        "remotekey": [
            "886/8835"
        ],
        "item_category": [
            "The Lenovo IdeaCentre 3 desktop is a compact tower, designed in a Mineral Grey chassis that fits and looks great anywhere in your home. It has the powerful performance of an AMD Athlon Processor with Radeon Graphics, plus plenty of memory, storage, and ports for your everyday computing needs. Powered by an AMD Athlon Processor, the IdeaCentre 3 is ready to handle any task. Get incredible responsiveness when running multiple applications, watching movies, chatting with friends or getting your work done with a PC that keeps up with you. "
        ],
        "summary_star_rating": [
            "3.9"
        ],
        "no_reviews": [
            "24 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "70%"
        ],
        "review_rating": [
            "4",
            "2",
            "4",
            "3",
            "2",
            "3",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "11 July 2021",
            "1 July 2021",
            "24 June 2021",
            "11 June 2021",
            "21 April 2021",
            "24 March 2021",
            "17 March 2021",
            "27 February 2021",
            "22 February 2021",
            "22 February 2021",
            "21 February 2021",
            "17 February 2021",
            "13 February 2021",
            "13 February 2021",
            "10 February 2021",
            "5 February 2021",
            "30 January 2021",
            "19 January 2021",
            "19 January 2021",
            "13 January 2021",
            "10 January 2021",
            "2 January 2021",
            "3 December 2020",
            "3 September 2020"
        ],
        "review_title": [
            "New Computer",
            "Veery slow",
            "Good.",
            "Does the job..",
            "This computer is very slow. AVOID",
            "Very loud",
            "Has no DVD drive even though it says it does have",
            "Ideacentre 3",
            "good",
            "poor",
            "Recommended",
            "The Ideal Data Store.",
            "Too loaded",
            "computer and screen",
            "Quality Products",
            "Good value",
            "IdeaCentre 3 (AMD",
            "Don't buy!",
            "Smart mover",
            "Great Item",
            "Excellent budget PC",
            "IdealCentre 3",
            "",
            "New PC"
        ],
        "review_text": [
            "Its an okay computer. Fast, efficient. Would definitely recommend. Get a decent monitor to go with it and you're away to go. Included keyboard and mouse are very good.",
            "Very slow operating windows not enough ram inside aalways crashing",
            "If your looking for something to do work on it is fast and does the job well,if your looking for something to game on it can Handel basic games at 30 FPS so I recommend a new graphics card.",
            "A bit slow, which gets really frustrating at times, but does the job. Struggles to wake up after going to sleep mode. Wish i had gone for the IdeaCentre 5 instead of 3. And this one has no memory card slot as well. Thanks anyways, Lenovo.",
            "This computer is a very slow piece of kit. It is dated technology, insufficient memory and takes its own sweet time to do anything.",
            "Little bit slow but for the price that's expensive and it's very loud",
            "This product has no DVD drive in it. It does have one on instruction leaflet that comes with it and it say same on line.",
            "Purchased with a monitor all for £250. \nPerfect for daily browsing, shopping and browser games. Ignore negative reviews as those people expect a Ferrari for the price of a corsa. There expectations are ridiculous.",
            "pretty decent get around 200fps playing Minecraft java which is not bad",
            "only had two weeks and wouldn't boot up , now away being repaired  been a week now and no sign of it coming back,",
            "Works fine and value for money. Helps well with remote learning",
            "I have seen poor reviews from people who have misunderstood the specification of this desktop PC. It has a reasonably quick processor but minimal RAM. My need is for a machine that handles spreadsheets and databases with casual gaming such as solitaire. I wanted to store lots of photos and music. When first switched on it updated drivers and the latest Windows 10 without problems and much quicker than expected. Set up was easy and I was reading emails and using MS Office in no time. Web browsing is leisurely and maybe an extra 4GB of RAM would help but is not essential. The machine was so cheap, well built and easy to house with it's small format that it easily justifies 5 stars and is excellent value for the money. If you want to play Fortnite save up and buy something with an appropriate specification. For my purposes the IdeaCentre 3 is just right...",
            "PC came with too many unwanted apps. The fashion seems to be to stuff as many as possible on, regardless. Consequently the user is constantly bombarded with suggestions to activate the things, forcing you to waste time telling it you are not interested.",
            "great product great design easy to use five star company",
            "Bought Lenovo because I had products previously and delighted with the performance.",
            "I bought this computer for home use and light business work.\nI paid a very reasonable price for it. It is fast enough for me and more storage than I would ever need.\nI purchase an external disk drive for £20 to be able to utilise my existing software.",
            "Unfortunately , this model has been some what disappointing . Found it to be slower then my 7 year old desktop that it was replacing !! I didn't  expected to be lightning fast, or the best thing ever  but it seems to freeze a lot and be some what slow moving between tasks (especially photo's) . I have been a big fan of Lenovo products over the last couple of years as I have purchased several of their products and have been very pleased with the quality as well as there excellent  performance . However, on this occasion I am sorry to say I  am disappointed.",
            "Terrible customer service! PC case not as on picture! No option to modify pc with CD-rom",
            "Bought this computer to replace an aging hp one. I must say I am not disappointed it is lightning fast compared to the old one. I was very easy to set up took me less than 15 minutes. I am looking forward to see how it performs long term as this was recommended to me by a very good friend.",
            "I love it, easily connected to my kids TV and they love doing their homework and daily activities on it. Would highly recommend",
            "Very happy with the performance of this PC, especially because it wasn't expensive.",
            "It would be useful to know details of the RAM so up grading should be easier.\nNice system at a reasonable price.",
            "Great pc easy to use and very fast loading and easy to navigate all in all a good purchase",
            "Great PC, compact but powerful, very quiet, fast and so easy to set up. a VERY good choice who I'll be recommending to others"
        ]
    }
}