{
    "880/9227": {
        "remotekey": [
            "880/9227"
        ],
        "item_category": [
            "The Acer XC-830 is the ideal home office PC, offering brilliant specs in a wonderfully compact 8 litre chassis – a perfect fit anywhere, be it on your desk or underneath. The Intel Pentium Silver CPU and 8GB of RAM can handle anything you throw at it plus the 1TB HDD has ample storage for documents, media and applications. The XC-830 also comes with Wi-Fi 5 built-in, offering up to 3 times faster wireless performance. The DVD drive allows you to play movies or music, plus the 5.1 audio and HDMI port mean it can handle all your multimedia needs. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "46 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "96%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "13 June 2021",
            "10 June 2021",
            "21 May 2021",
            "19 May 2021",
            "19 May 2021",
            "13 April 2021",
            "11 April 2021",
            "8 April 2021",
            "7 April 2021",
            "7 April 2021",
            "6 April 2021",
            "6 April 2021",
            "11 March 2021",
            "9 March 2021",
            "2 March 2021",
            "2 March 2021",
            "25 February 2021",
            "24 February 2021",
            "24 February 2021",
            "17 February 2021",
            "16 February 2021",
            "10 February 2021",
            "10 February 2021",
            "3 February 2021",
            "3 February 2021",
            "22 January 2021",
            "19 January 2021",
            "14 January 2021",
            "13 January 2021",
            "13 January 2021",
            "6 January 2021",
            "5 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "26 November 2020",
            "25 November 2020",
            "17 November 2020",
            "17 November 2020",
            "27 October 2020",
            "27 October 2020",
            "27 September 2020",
            "25 September 2020",
            "24 September 2020",
            "19 September 2020",
            "12 August 2020"
        ],
        "review_title": [
            "Very easy to set up",
            "great features",
            "as expected",
            "Good All round Home PC",
            "A lot of functions,  very compact",
            "This pc is amazing",
            "",
            "Does what it says on the tin",
            "New Computer",
            "",
            "Does what I bought it for.",
            "Perfect computer",
            "Acer XC-830  Pentium Desktop",
            "Very competitively priced little box of tricks.",
            "Far superior to the old computer that went bang",
            "Great value desktop",
            "Desktop",
            "Fairly easy to set up and use",
            "Great for home office",
            "Acer PC excellent value",
            "Wow",
            "Perfect for my needs",
            "you get what you pay for",
            "Quick easy set up looks good",
            "Great buy. Cant believe how fast it is.",
            "does the job",
            "OK I suppose",
            "Great value",
            "Nice little desktop tower",
            "Great desktop.",
            "easy to set up",
            "Acer Desktop XC-830",
            "Very fast great for everyday use",
            "",
            "My Pc is great and easy to set up and install",
            "Nice PC",
            "Very good all A1",
            "Excellent Desk PC, stylish and compact",
            "Techbology",
            "Getting to grips with it office software proving a",
            "Good value, silent and great little machine",
            "Speedy, silent, great all round performance",
            "Great everyday pc",
            "Great for homework and gaming",
            "Great PC",
            "Very Good PC"
        ],
        "review_text": [
            "The pc was very easy to set up and get started. It came with easy to follow instructions, but it was so straightforward I could probably have managed without them. \n\nIt's been working well for everything I need, including general browsing, watching Netflix and working from home.",
            "So far I am satisfied with my Desk top",
            "this was too replace my old pc i trust acer",
            "Good specification at this price - 8GB memory seems fine for running Windows 10. Easy plug and play straight from the box (especially if you already have a Microsoft account - it automatically sets up everything). Much better price than other suppliers, so excellent value.",
            "I was surprised how small this is.  However it has many functions and was a very good price.",
            "Looks great, unbelievable speed and noiseless",
            "excellent as general purpose machine\nmuch quicker than previous computer\ntakes up lot less space. Keyboard neat\nand good feel to buttons.",
            "Perfect for office 365 emailing web browsing and general business use",
            "Great PC, fast easy to set up, small compact, Ideal for my work",
            "Brilliant brilliant PC good for the price and it's pretty quick too",
            "Very quick to load desktop and fast WiFi from my router.  Had to use an extender on my previous acer. This connected before the desktop had fully booted up. My grandkids are fighting over this now.",
            "Perfect little computer for me, does everything I need, main use for work purposes.",
            "Gone back to using my laptop as I can't get going with this desktop.  It is so slow loading the internet then freezes or loses connection.  I am using wi-fi mode so will try moving the processor nearer the hub to see if it improves connection speed.  Another think to note is there is no sound speaker on the processor.  You need to purchase these separately. I hope to crack problems I am experiencing with this computer but not finding it easy.",
            "This Acer Aspire XC 830 ticked all the boxes for me , Spec wise.\nWas great value for money from Argos compared with other sellers.\nLovely compact size, so quiet and ultra responsive having now moved up to Windows 10,\nafter 11 years with Windows 7. Have recommended to several friends already.",
            "After my old computer decided to pack up on me I had to buy another , on looking around this one was perfect and reasonable priced , also plenty of memory and large hard drive \nSo much better than my old one and a lot faster , really pleased with my purchase",
            "Can’t fault at the price, had macs for years so was dubious, but very fast and quiet, would definitely recommend so long as you don’t need loads of power",
            "Went for the higher ram and am happy with the purchase so far.",
            "Has dvd drive read and write but took some time to find out that it did both. Could do with making that clear on product description.\nComputer works well so far.",
            "Finally had to replace an old and slow pc.\nThis is ideal for the home office. It is more than capable of what I bought it for. Great to have a disc drive too. Build quality is good, mouse and keyboard though wired are nice enough.",
            "Because laptops were in short supply, I decided on this Acer PC. This was a great choice and am very pleased with the product",
            "Really fast and reliable glad I brought it highly recommended",
            "Fast, quiet, plenty of storage space, very slim, Cyberlink software pre installed and I like the small keyboard, it doesn't feel flimsy.",
            "I was looking for the cheapest option, and this computer was at a very good price. It is perfectly functional, and it comes with a good keyboard and mouse, but it is really slow. I would probably spend more for higher specs next time.",
            "I had my old computer for some time didn't realize how slow it had got until I got this acer.\nWould definitely recommend it",
            "Fast processor and bags of storage. I can also play cd and DVD. All good",
            "Does exactly what I needed",
            "First of all the Argos service was on the ball with ample distancing and control unlike some supermarkets I could name.\nProduct wise it comes without any set up help although I didn't need any but beware if you do.\nThe DVD drive which I wanted because of old software that needed to be reloaded onto the new PC is VERY FLIMSY. It has no strength in it and be careful as I had one disc disappear inside the PC. Fortunately a few shakes and it came out OK.\nOtherwise a nice PC.",
            "Great piece of kit,I have Acer tablet so went with who I know.\nFairly easy to set up,but some tech knowledge helps with all the microsoft options.",
            "Nice desktop tower to replace an old slow one. I just needed a basic home computer and this ticked all the boxes.",
            "Wonderful value for money.Very fast and quiet.",
            "good quilty computer easy set up and 8gb is fast",
            "Was easy to set up, only 3*** Rating as only time will show Reliability.",
            "This pc is brilliant very good, quite! my previous one ( very old) gave me a headache and over heated. I can work much happier now!! Thank you argos!!",
            "Really happy with this product easy to set up and comes with keyboard and mouse well worth the money",
            "I bought this for my daughter and she wanted something to play games and do home schooling and she loves it. It is easy to set up, use and very quick, keyboard is smaller than norm, so takes a little while to adjust.",
            "Run fast and easy to set up and the tower is small and look nice I will definitely recommend this PC.",
            "All good easy to setup",
            "Fantastic desktop Pc, easy to set up and compact with the latest main applications to use.  \nHas been a great use for the family during Covid covering work and school work requirements.  The screen isn’t included.",
            "Ok, simple enough, alot of software that many wont need or would replace with better",
            "Looks Ok for now just got to sort out the MS Software",
            "Bought for my children to use for their homework or any future lockdowns! It doesn’t have internal speakers, which surprised me but easy to just add external speakers. It’s the easiest PC I have ever set up! It’s a nice small size with sleek simple design fits nicely on our small desk in a vertical position. Very quiet and fast to start up. Extremely happy with our purchase and with the price.",
            "Great design, classy without looking too over the top. Nice Matt finish gives it that something extra. Setup is easy, can do this quickly. Completely silent, great picture quality and software included is excellent. Running speed is good, excellent number of ports ideal for variety of needs. Running variety of games at good quality, frame rate is good. Response time is good and makes for easy gaming. Wifi compatibility with accessories makes for a nice setup. All round usability is exceptional.",
            "PC took 20 minutes to unpack, setup and send first email. It's a fast little runner for everyday activities like email, browser, internet banking and of course social media. \nCbeebies games run nicely for the kids and playing dvds is really easy.\nMy only negative is that the keyboard and mouse feel a bit lightweight, but dont need replacing as the do a good job.\nOverall a brilliant pc that's being used for working from home and schooling. Windows 10 is also preinstalled and runs well.",
            "My daughter has been using this pc mainly for her college work, playing Minecraft and many more things. Was very easy to set up even for someone who isn’t great with technology. Very straight forward to use, instructions easy to read. The small keyboard is perfect for not taking up too much space. Would highly recommend this PC for many uses. I have one happy seventeen year old",
            "This Acer XC-830 Pentium 8GB 1TB Desktop PC is great, my son has been using it for his homework and also to plays games on, runs fast and smoothly.. easy to set up and use.. comes with a smaller keyboard which is great if you have minimal space... great storage, great price, i would recommend this pc..",
            "Very good PC, best price PC for spec provided, very fast and runs all required software I needed it to. Only small negative, going to replace the keyboard as seems a bit flimsy, but other than that, a great PC which should suit most people."
        ]
    }
}