{
    "915/2045": {
        "remotekey": [
            "915/2045"
        ],
        "item_category": [
            "Sacrifice nothing with powerful HP Pavilion Gaming desktop. From superior performance to its stunning design, premium quality is built into every curve. Ideal for gaming, graphic design, video editing, streaming and more. Experience high-grade graphics and processing power for gaming and multitasking with the GTX1650 graphics card and 10th generation i5 processor, plus improved thermal cooling for overall performance and stability. This rig provides the perfect balance between work and play, so you can do it all. "
        ],
        "summary_star_rating": [
            "4.3"
        ],
        "no_reviews": [
            "12 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "83%"
        ],
        "review_rating": [
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5"
        ],
        "review_date": [
            "25 June 2021",
            "20 May 2021",
            "14 April 2021",
            "8 April 2021",
            "17 March 2021",
            "13 January 2021",
            "12 January 2021",
            "8 January 2021",
            "25 November 2020",
            "4 November 2020",
            "21 October 2020",
            "5 August 2020"
        ],
        "review_title": [
            "Good value.",
            "Happy",
            "Cannot use product!!",
            "Quick and capable",
            "The pc works perfect",
            "Fast, compact and quiet",
            "My HP gaming PC is running faster than ever",
            "Looks great my son loves it.",
            "Great for the everyday user.",
            "Amazingly Fast",
            "Not bad",
            "Reliable machine"
        ],
        "review_text": [
            "I use this PC a lot for video editing and spreadsheet work. I would describe the experience as \"smooth\" ie as unstressed as possible. The editing speed seems to be greatly increased with the i5 core capabilities. The design makes it reasonable unobstrusive but there is a bit of hum most of the time. Overall I find it great value.",
            "Cool and very happy.",
            "Initial start up software too simple  and does not cater for multi change of addresses, computers or passwords.   Am now completely locked out of machine as Microsoft\nrefuses entry!",
            "Arrived well packaged, most set up was easy. It works quickly and has the capability to be used for gaming as well as school work. The memory being on two drives is not something my son was used to so is annoying to sort retrospectively. However, it can be done and other than this small issue we are very pleased with our purchase.",
            "The computer is very fast and it runs all the games that I put on it better than I expected. It’s also simple to use and setup. The SSD makes loading anything fast and having the 1TB hard drive is nice to keep a large amount of games.",
            "This is a really fast machine for price point. Handles simulator games well and boots to windows log-on page within 10 seconds. Note that no keyboard or mouse is included within the box - some models do come with them, so be aware! \nThe machine runs quietly and is fairly compact - can easily sit under or even on a desk.  \n\nOverall, definitely recommend if thinking about purchasing a gaming PC.",
            "You can complain about the price for what you pay you get a good deal I would recommend to someone who is just getting into gaming",
            "This was a replacement for a different model that didn't work. This is spot on nice and quiet does what my son wants with his gaming.",
            "Easy set up. Very quiet machine, fast startup, peripherals worked as soon as plugged in. No DVD facility but my external one works fine as do my speakers. \nSlow on viewing large file photos, they pixelate for a few seconds before showing. The psychedelic green light at the base is far too intrusive. Overall a great buy.",
            "Starts up instantaniously. Set-up so easy, windows was already up-to-date, no annoying sales pitch from anyone/anything or bloatware. So very very quiet. Am very pleased. Need to find out how to turn the green light off on front tho'.\n\n ",
            "Its a nice build and cheap, plays the games I want but not great for the future, very limited in the upgrade department, no chance of adding an RTX2060 or above video card as the power supply will not provide enough power. The best it can take is a GTX1650 Super.",
            "I like this desktop, it's quiet, fast and reliable."
        ]
    }
}