{
    "942/7141": {
        "remotekey": [
            "942/7141"
        ],
        "item_category": [
            "A sophisticated design and powerful hardware for effective multitasking, this compact 8 litre chassis is the ideal size for fitting under or on top of a desk. Powered by an AMD Ryzen 3 processor move through tasks easily as they arise. With 1TB of HDD storage you'll be able to store more of your favourite media and programmes. Bundled with the XC-340 desktop is the EK220 monitor, this FHD 21.5-inch monitor will be everything you need to get up and running while protecting your eyes with Acer VisionCare. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "6 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "83%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "19 May 2021",
            "5 May 2021",
            "28 April 2021",
            "28 April 2021",
            "20 April 2021",
            "13 April 2021"
        ],
        "review_title": [
            "Fast enough for me",
            "Still getting used to it.",
            "Great little PC bundle",
            "Computer",
            "Fantastic little set up!",
            "Great basic pc"
        ],
        "review_text": [
            "Good for using internet and watching videos and DVDs, easy to start up and register, no problems yet!",
            "Wish I'd paid more attention to the USB capacity, two front and two back were not enough for my purposes, needed an additional four port USB hub.  I've had problems more than once restarting after sleep mode when machine has frozen and could only be revived via mains switch off/on.",
            "Great product just what I needed it for",
            "Very nice computer suits my needs the only downside is it does not have enough USB point when you connected the mouse and the keyboard by USB",
            "Easy set up.. fantastic product deal everything in 1 order..",
            "Great basic start up pc for a high school child.\nPerfect for what my daughter needs to do and can play a few games on it too."
        ]
    }
}