{
    "853/8488": {
        "remotekey": [
            "853/8488"
        ],
        "item_category": [
            "Get ready to game on your terms. This powerful rig is built to keep up with the games of today and tomorrow. Beneath its compact and sleek exterior, you will find all the performance you need to play with confidence and room to expand and upgrade. This tower grants you the power to run the latest games with smooth and responsive visuals. Breakthrough graphics performance with NVIDIA GeForce GTX 1660. Powered by the ultra-speed 6 GB GDDR6 technology, stream and game smoothly with NVIDIA GeForce experience and game ready. "
        ],
        "summary_star_rating": [
            "5"
        ],
        "no_reviews": [
            "6 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "23 June 2021",
            "23 June 2021",
            "21 April 2021",
            "24 March 2021",
            "24 March 2021",
            "10 March 2021"
        ],
        "review_title": [
            "Tells you when to update ie bios",
            "Great specification",
            "Son loves it",
            "Very good",
            "Fabulous pc. Even 8k it's running",
            "Looks great"
        ],
        "review_text": [
            "Quality product very happy would recommend to friends",
            "Got this because my old HP computer finely packed in.\nI'm really pleased with this one it's the first gaming computer i've had and it's great",
            "Son is very much into gaming and gets a lot out of this computer",
            "Very good. Happy with this",
            "Pc it's good. You can play almost all games. I tried GTA V on ultra settings, with 4k resolution and i had around 40-50 fps. \nHad to say it's running 8k videos verry smoothly. \nThe bad thing it's that the ventilator from processor(or from GPU) when it's running faster, it's a little bit to noise.",
            "Serves the purpose so well, makes me feel like a king when playing games. I'd suggest combining with the gaming monitor that can flip from horizontal to vertical. Would love to test it with two or three of those screens"
        ]
    }
}