{
    "842/3926": {
        "remotekey": [
            "842/3926"
        ],
        "item_category": [
            "Slimmer design. Performance you can depend on. Make the most of your living space with a reliable compact PC. Designed to take up less space where you need it, the HP Slim Desktop delivers technology and reliability you can depend on, with a slim design that fits anywhere. Quad-core Intel Pentium Silver J5040 processor The perfect combination of performance, power consumption, and value helps your device handle multitasking smoothly and reliably with four processing cores to divide up the work. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "9 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "4",
            "2",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5"
        ],
        "review_date": [
            "10 March 2021",
            "10 February 2021",
            "19 January 2021",
            "14 January 2021",
            "2 December 2020",
            "17 November 2020",
            "10 November 2020",
            "23 September 2020",
            "19 September 2020"
        ],
        "review_title": [
            "HP Slimline PC",
            "El Crappo",
            "Lot faster than my old desktop",
            "It's obviously not a gaming PC.",
            "hp desktop",
            "1TB Desktop PC",
            "Great desktop pc would recommend",
            "Computer works as described",
            "Nice piece of kit"
        ],
        "review_text": [
            "This was a great little desktop spoilt by one fault - no DVD drive",
            "Too slow and not enough memory. It could also be windows 10 being the culprit. I had to buy more memory and it works better.",
            "Nicely designed, sleek machine that just does all i ask of it, quickly and without fuss, so quiet too, Only drawback is no built in dvd player, but i know it's not such a problem these days.",
            "This PC is good for its level.",
            "unfortunately developed a windows 10 fault after a couple of days , so had to return for a refund",
            "Good Desktop PC for the price .A lot smaller that my old one. Would reccommend.",
            "Compact and quiet & easy to set up. No complaints.",
            "Easy to set up and use. Quick loading into windows which is great for homework.",
            "My girls will put this to good use"
        ]
    }
}