{
    "794/8677": {
        "remotekey": [
            "794/8677"
        ],
        "item_category": [
            "Make the most of your living space with a reliable compact PC. Designed to take up less space where you need it, the HP Slim Desktop delivers technology and reliability you can depend on, with a slim design that fits anywhere. With its slim bezel design, this PC fits perfectly wherever you work or play. With a bold geometric pattern and all the ports, you need located on the front, it is the perfect blend of form and function. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "7 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "17 February 2021",
            "20 January 2021",
            "5 January 2021",
            "3 January 2021",
            "28 October 2020",
            "14 October 2020",
            "13 October 2020"
        ],
        "review_title": [
            "Looks great",
            "Works OK. Lots of USB sockets.",
            "Quite easy to set up and looks good.",
            "Easy to operate",
            "",
            "Budget computer",
            "Seems good so far!"
        ],
        "review_text": [
            "I like the product alot",
            "A key factor in buying this model rather than other low-cost desktop computers was the six USB ports. The two at the rear are needed for the mouse and keyboard, leaving four USB3 at the front. The first time it powers-up it loads Win10. I then spent two hours selecting 'No' to ensure that I, rather than Microsoft, was in charge.",
            "It isn't made clear that you need to buy speakers seperately",
            "To replace an old PC - much quicker",
            "good Happy about it, i love hp product.",
            "Budget computer and it’s worth for it’s price, it’s excellent for students or people who are looking for lower price pc.",
            "I know nothing technical about PCs all i wanted was one for my degree work atm it ticks all the boxes i know its the cheapest but it is what it is! People will comment on the noise there is a low hum but unless you want total silence its not noticable unless pointed out for uni work it does what you want. Games and other stuff no idea\nOnline shopping also good no problem\nBut early days seems ok so far!"
        ]
    }
}