{
    "948/2492": {
        "remotekey": [
            "948/2492"
        ],
        "item_category": [
            "With the Lenovo IdeaCentre AIO 3, powerful performance meets stylish engineering. It handles demanding apps with ease thanks to the ultra-fast mobile processor, seamless DDR4 memory, and HDD storage. It has an elegant stand and near-borderless display. And it gives you more desk space, too. "
        ],
        "summary_star_rating": [
            "5"
        ],
        "no_reviews": [
            "7 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 December 2020",
            "30 December 2020",
            "29 December 2020",
            "19 December 2020",
            "16 December 2020",
            "20 November 2020",
            "6 November 2020"
        ],
        "review_title": [
            "More BANG for your bucks!",
            "Perfect addition to the home",
            "Great product",
            "Good quality and price",
            "Excellent centre for those who are that technical",
            "Very good value for money",
            "Everyday use"
        ],
        "review_text": [
            "My 2nd Lenovo. A top class 'general use', space saving machine with a full set of extras, not mentioned in adverts, i.e. full size keyboard & mouse, built-in speakers & web cam!",
            "If you want a straightforward PC, that’s easy to set up, a breeze to move around and looks stylish and unobtrusive wherever you decide to use it, then this is the machine for you.   Great value and everything’s included but the simple addition of a wireless keyboard and mouse makes this a perfect addition to the home.",
            "Great product. Great family all in one. Just what we needed. Bravo",
            "Really great easy to use and set up machine does everything I needed it to",
            "This is a great centre,.easy to set up with crisp graphics and clear sound. Very glad I bought it. I highly recommend this centre.",
            "Easy to set up. No unwanted apps. Fast to load and respond. Very good value for money",
            "Everyday use, so far so good, I cant really fault it."
        ]
    }
}