{
    "878/5767": {
        "remotekey": [
            "878/5767"
        ],
        "item_category": [
            "The space-saving Vivo AiO V222 is remarkably slim and light and its NanoEdge display features an impossibly thin bezel for edge-to-edge viewing and an impressive 87percent screen-to-body ratio. The stunning 21.5inch Full HD LED widescreen display includes wide-view technology that makes it perfect for sharing pictures or videos with friends and family, no matter what angle the display is viewed from! With Full HD (1920 x 1080) resolution, you'll enjoy games and movies in beautiful detail, with amazing colour and contrast. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "17 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "2 June 2021",
            "25 March 2021",
            "24 March 2021",
            "23 March 2021",
            "16 March 2021",
            "10 March 2021",
            "9 March 2021",
            "9 March 2021",
            "2 March 2021",
            "2 March 2021",
            "13 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "13 October 2020",
            "1 September 2020"
        ],
        "review_title": [
            "Great for home use",
            "",
            "Well made and works extremely well",
            "",
            "Good",
            "Desktop",
            "Exceptional",
            "Excellent build quality and speed 5*",
            "pc All inone",
            "Love this PC. Does everything I want and more",
            "Ramajalikatu",
            "All in one PC",
            "",
            "",
            "My grandson loves his pc",
            "Nice looking value for money",
            "Pc looks and performs excellent"
        ],
        "review_text": [
            "Not a bad little machine.",
            "The best I ever had. My online course made easier.",
            "A nicely built and well equipped computer. The display is particularly clear and I'm pleased to see an adequate number of USB ports.\nAs always with Realtek sound cards, this aspect really needs improvement but this can be bypassed with a decent audio interface but of course, it adds to the overall cost.\nSome software still needs a CDR/DVD player for installation but the Asos portable unit at around £25.00 does the job.\nWould I recommend the computer? Yes.",
            "Amazing product good quality",
            "Good quality and professional service.",
            "Great price and delivery as promised",
            "If you have kids this is the computer to get.\nDoesn't take up too much space and works like a charm.!!",
            "A very nice looking a good quality \"all - in - one\" PC solution, great spec and build, my Daughter is very pleased with it.",
            "A good pc that works great",
            "Perfect for what I need it for. So glad I bought this instead of a laptop. I love the idea of space saving too so an all in one computer is perfect.",
            "Asus vivo is a very good product.  this PC have the latest features on it . you can whatch tv, Playgame and do so many things. I am really glad I brought it, and it worth the price.",
            "This was everything that I hoped for excellent product",
            "I dont really like it the webcam is down",
            "Beautiful design, very easy to set up. Great performance so far, especially awesome picture and sound quality!",
            "Ordered online pickup in store next day fabulous",
            "Worth the money. Fast and easy to use",
            "Never had an all in one computer, but Zi was pleasantly surprised by the sharpness of the picture quality. Would definitely recommend it."
        ]
    }
}