{
    "810/1963": {
        "remotekey": [
            "810/1963"
        ],
        "item_category": [
            "The Stormforce Onyx is equipped with an AMD Ryzen 5 3400G (3.70 GHz) CPU allied with on-board Radeon RX VEGA 11 graphics and DDR4 memory, perfect for playing entry level games such as Fortnite, CS: GO, Apex Legends and more. All Stormforce PCs come with an unrivalled 3 Year Collect & Return Warranty (3 Years Parts, 3 Years Labour). "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "62 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1"
        ],
        "review_date": [
            "23 July 2021",
            "8 June 2021",
            "5 May 2021",
            "5 May 2021",
            "4 May 2021",
            "20 April 2021",
            "15 April 2021",
            "15 April 2021",
            "14 April 2021",
            "7 April 2021",
            "31 March 2021",
            "31 March 2021",
            "31 March 2021",
            "26 March 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "17 March 2021",
            "17 March 2021",
            "16 March 2021",
            "15 March 2021",
            "11 March 2021",
            "10 March 2021",
            "10 March 2021",
            "7 March 2021",
            "4 March 2021",
            "3 March 2021",
            "28 January 2021",
            "2 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "25 November 2020",
            "12 November 2020",
            "10 November 2020",
            "3 November 2020",
            "3 November 2020",
            "21 October 2020",
            "7 October 2020",
            "29 September 2020",
            "29 September 2020",
            "22 September 2020",
            "9 September 2020",
            "3 September 2020",
            "24 March 2020",
            "11 February 2020",
            "8 January 2020",
            "30 December 2019",
            "26 December 2019",
            "26 December 2019",
            "19 November 2019",
            "5 November 2019",
            "22 October 2019",
            "20 October 2019",
            "9 October 2019",
            "12 June 2019",
            "23 May 2019",
            "14 May 2019",
            "19 March 2019",
            "17 October 2018",
            "17 August 2018",
            "7 August 2018"
        ],
        "review_title": [
            "Gaming Tower",
            "great gaming computer good value for the money.",
            "One happy son",
            "Gaming pc",
            "Good price",
            "It looks good with my sons setup and it is fast",
            "keeps my grandson occupied for hours",
            "Excellent PC.",
            "Work from home and Play Games",
            "Does what it says on the box",
            "My son is very happy, his new gaming pc works perf",
            "Good but before you buy read this",
            "Computer is super",
            "",
            "Brilliant",
            "",
            "Good",
            "One of the best deals if you have gpu and psu",
            "Acceptable for browsing and media content",
            "My son is a very happy boy now",
            "my son loves it",
            "Worth the money",
            "",
            "Great!",
            "Very fast and capable pc.",
            "My computer goes fast and everything runs perfect",
            "",
            "Excellent item for gaming",
            "Solution to gaming machine minefield!",
            "Good value for money",
            "My son is very happy with this device",
            "Son loves it",
            "Looks amazing and runs amazing",
            "Looks smart",
            "Smart looking does a great job, fast boot up",
            "",
            "Gaming pc looks great",
            "Beautiful Pc",
            "It’s run good",
            "Great pc for faming",
            "perfect pc",
            "PC is good.",
            "Ideal just what I wanted",
            "awesome starter pc",
            "Brilliant pc",
            "Great",
            "Gaming pc",
            "Very good quality",
            "gaming computer",
            "Great system for starter gamer and steamer.",
            "Computer",
            "",
            "Gaming computer",
            "It looks just like the pictures and fast gameplay.",
            "Looks and runs fast",
            "Beautiful contraption",
            "Great Item 5/5",
            "So far so good",
            "Great new computer.",
            "Great purchase.",
            "Good computer",
            "PC is good. Support is poor."
        ],
        "review_text": [
            "Worth every penny, hours of excellent gaming",
            "I bought this computer for my great grandson  he has never been off the thing for two weeks timed it right for the half term holidays.",
            "Brought this for my son and it’s his first gaming pc and he over the moon he says it’s better than the PlayStation he had since he was little",
            "Its absolutely fab, does exactly what my son wants it to do. He loves the colour as well.",
            "Great for my 15 and 17 year old and they both say it plays Great",
            "Don’t put on carpet k",
            "Keeps my grandson occupied for hours",
            "A good PC which is also a very reasonable price.",
            "I purchased this PC as I hadn't had an upgrade in around 8 years. It runs smooth, is super quiet and was easy to set up. \n\nI use it for working from home on multiple systems and on a dual-monitor setup. I have also tested it on an MMO and use it for Adobe Creative Suite.\n\nWorks great and perfect for people who can't afford a big setup.",
            "This was my second pc as the first one stopped working. (Loss of sound)\n2nd one working well for now",
            "Very good pc for this price, fast delivery",
            "This stormforce pc is a brilliant starter pc which has an upgrade path just be aware when you buy you will have to update your graphic drivers through the amd software to get full use out of it other than that it’s a deffo a cop",
            "Good quality, looking beautiful, my son very happy!",
            "Absolutely it’s very good ,game and best super addicting app.",
            "Very good service and delivery",
            "I bought one for my son but it was not worked so don’t spend your money in it. \nWhen he start gaming with friends, computer scream get black and shot down automatically.",
            "Works great and is fast and does everything I need it to",
            "Bought this pc as an upgrade to my old one, but kept my graphics card (RX 570) and swapped power supply as the stock one is only 350 Watts. And might i say is a much better deal than just buying an upgrade bundle (cpu, ram and motherboard) the CPU inside can run most of the games on mid to high settings on 1080 p no problem. If you want to use it for high end triple A games, i would suggest getting a corsair ram bundle from 16 gb, cause 8 gb included wont be enough for newer AAA games.",
            "It;s acceptable for browsing and videos. NOT for gaming, (unless you wanna play with minimum to medium graphic settings) since you need a much stronger video card and more expensive one. You will need a 1000 at least for a decent gaming PC",
            "I could not get a ps5! For my son so after waiting a few months after Xmas he choose this and he said he made the right decision",
            "Great product. My son was very happy when he got this present.",
            "My son purchased this and is very happy with it easy to set up and runs all his gaming on it",
            "Excellent price , recommend for beginners who started adventure with game's ,easy setup and in future equip extra ram , perfect",
            "Very good product! Works a treat, fast and a fair price too!",
            "Worked straight out of box. Very fast, good build quality, very impressive",
            "Everything is perfect",
            "It’s a decent desktop",
            "Updated our pc as it wasn't keeping up when it came to online gaming. This pc does it all. Would highly recommend.",
            "I bought 3 of these for our 3 children for Christmas... Ignore reports of sluggish performance, these machines outmatch any other dedicated gaming machines on the market... Options/Expansion slots for upgrades at later dates are available should you really need it but I see no reason!... Good value and recommend.",
            "My sons Christmas was ruined by this gaming pc obviously not being checked before it left the factory. It would not turn on. Luckily a family member took the side off to take a look inside and the power cable had not been put in place.\nOther than that it's a good value pc and my other son had one last year, which is why I purchased one for my younger son. So I would recommend it.",
            "My son thinks this device is brilliant",
            "Great value for me my son loves it xx",
            "Things to do keep safe really good product absolutely love it",
            "Neat case which looks more expensive than it was.  Very easy to set up worked perfectly first time",
            "Very happy with product goes great with monitor and key board, love it",
            "Great computer for value.",
            "Excellent graphics great colour great Christmas present for children who play games",
            "It’s a beautiful pc and does run low quality games but where it says it would run fortnite or apex it definitely does not. Not ideal for streaming either.",
            "It’s a good gaming for a starter BUT down side to it if your gonna play fortnite you have to run 30 FPS is it worth it? Yes and no",
            "Excellent product easy to set up great looking and works extremely well",
            "was really good price for what you got. great pc if your starting up gaming and also if you do coding and everything. overall a great pc and would definetly recommend to anyone",
            "Graphics card disappointing.",
            "Pretty good buy for the price",
            "ive had over a week now runs the games i wanted to run smoothly, I added the nvidea 1650Ti graphics card and it runs like a beast any game on ultra. might just need to add more ram later on",
            "Had this gaming pc a while now it's super fast and reliable. My old Lenovo wasn't that good this pc is even better.",
            "My 16year old grandson thought it was amazing.",
            "I bought this for my son and he is very happy. I did I have an issue connecting to the WiFi initially as only 1 Ariel was included in the box but after contacting the Storm force help line they issued another one by 1st class post and it has been fine since. Graphics are good and it works fine connected to a TV. Not had any issues with performance.",
            "Good product for good price",
            "Great setup for a starter gaming computer",
            "It says it can run Fortnite, and it does but Glitches a little bit.\nOther than this out is a stunning looking system, very quiet run and fast enough for everything else you could want to do.\nIt is my sons first pc and he's over the moon with it.\nVery pleased with our purchase!",
            "Replacement computer fantastic much better than last super fast",
            "I bought this for my son for his 12th birthday and he is very happy with it. It looks great and does everything he needs it to do. A great buy.",
            "Great computer my son loves it runs all the games he wants to play online, It also look really smart with the see though panel and LED’s",
            "Product was as described and works well.",
            "To play games like rust your gonna need to add more ram which will need two 8gb ddr4 sticks and I would recommend dropping a gtx 1050ti in for a later upgrade just for better graphics and your good to go I think",
            "This PC is great for anyone who is looking to get into gaming for the first time on a pc. I'm not new to gaming but I didn't have a very good pc beforehand and so most games didn't run very well. This PC is great! The cable management is out of this world and is definitely worth your money. Most games will run 100 fps plus om medium to low settings (E.G. Rainbow six siege, league of legends, Rust, Overwatch et..) The red fans give this PC some life. Very good. Would recommend to anyone!",
            "Great gaming pc, Looks great and its perfect for a price range, affordable and achieving good performance.",
            "The PC is running nice and smooth, quiet, the LED are a nice touch, hopefully is gonna go like that for a long time, I do enjoy it",
            "Love this machine. Only thing missing for me was a dvd drive , but I can soon.buy one of those.",
            "My son is very pleased with the new computer. Works fast, no issues.",
            "In general the computer is good. Graphics are amazing for the games that i play and they all run smoothly. The computer is quite and its really cool seeing all the fans turn on when pressing the button. However i did come onto an issue. My first example of this computer glitched and froze a few times on me. However i did call argos and, along with stormforce, i got a brand new computer (which is running perfect).",
            "Running 90s FPS games on Steam runs with large black borders in low res and poor framerate.\nPUBG did run and I enjoyed that.\n\nWhen I had important questions for Stormforce they could not be contacted over the phone. I do worry my 3 years warranty could be useless."
        ]
    }
}