{
    "899/9670": {
        "remotekey": [
            "899/9670"
        ],
        "item_category": [
            "For real slick performance and truly stylish engineering, take a look at the Lenovo IdeaCentre AIO 3i. It's powered by 10th generation Intel Core i3 processor, DDR4 memory, and a hybrid storage, so can handle any task. With its streamlined stand and near-borderless display, it saves on desk space, too. Whether you need to work or kickback, you can tilt the stand on your IdeaCentre AIO 3i to the perfect angle. You can also adjust the screen with one hand, perfect for when there's an annoying light distracting your view. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "27 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "90%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "18 July 2021",
            "14 July 2021",
            "6 July 2021",
            "23 June 2021",
            "17 June 2021",
            "28 May 2021",
            "20 May 2021",
            "18 May 2021",
            "18 May 2021",
            "16 May 2021",
            "5 May 2021",
            "5 May 2021",
            "10 April 2021",
            "30 March 2021",
            "29 March 2021",
            "11 March 2021",
            "25 February 2021",
            "9 February 2021",
            "3 February 2021",
            "23 January 2021",
            "20 January 2021",
            "5 January 2021",
            "29 December 2020",
            "23 December 2020",
            "22 December 2020",
            "20 December 2020",
            "16 September 2020"
        ],
        "review_title": [
            "Great all rounder",
            "Stylish, Sleek, Affordable",
            "Excellent - great purchase!",
            "Idea centre",
            "GREAT COMPUTER",
            "Perfect PC for me",
            "A word not much used in this design - ergonomics.",
            "Love my Lenovo",
            "A quality All in 1 PC",
            "Very nice PC, however...",
            "It freezes",
            "why no CD/DVD drive?",
            "An Excellent PC",
            "Lovely",
            "Great pc in a tidy design",
            "The Perfect PC for your needs",
            "IdeaCentre AIO 3i (27\" Intel)",
            "Compact excellent for office",
            "Easy",
            "IdeaCentre 3i (27\")",
            "Fantastic view",
            "Not bad for a price",
            "This was a replacement for my previous IdeaCentre",
            "Good buy.",
            "lovely",
            "New Good and works Great",
            ""
        ],
        "review_text": [
            "Love this desktop. First time in ages I've bought one and really impressed. Excellent quality, looks stylish and spec is great for price",
            "The IdeaCentre AIO 3i is the best computer I have purchased. It's stylish, sleek and very affordable. The screen is vibrant, the computer itself is fast. I would recommend this computer to my family and friends. I wished I'd have tried an AIO 3i before.",
            "We bought this computer for our adult grandson and he is really enjoying the experience.   Very easy to set up and use!",
            "Pleased with product in terms of performance and aesthetics. Wanted some information on extended warranty- but found this difficult to work through on the website",
            "Brilliant Computer, easy to use, Just what we wanted",
            "Great new computer for me.  Space saving without the box on the desk is fantastic.  So far the speed is excellent, lots of memory/storage.  Nice big screen, perfect for my diary work.",
            "Ergonomics. Whomever designed the product gave scant attention to the practical use of it. The USB slots are mostly at the rear which involves moving a heavy screen each time one mounts a USB storage device, but worst of all, the SDHC card reader is nigh on impossible to use when an external speaker is attached in the slot above it!",
            "Brilliant all in one pc I could not be happier and at a great price. Its also is a real space saver and looks great.",
            "A wonderful all in 1 PC. Fast and does not lose speed when 1 or more window is open. So glad i upgraded",
            "Very nice PC, however just 14 days after purchase, a black/grey mist appeared all the way down the lefthand side of my monitor screen. I did 1 or 2, minor things to try and get rid (i.e. turnon on and off) however, it would not budge. The well known online retailer did their own remote tests and declaire it could to be returned for refund or replacement. I took the refund. Such a shame, it was really a nice PC, I liked it alot, only I didn't want to risk a replacement from the same online retailer.Once bitten and all that.",
            "It keeps showing down and freezing. I regret buying it",
            "The IdeaCentre AIO 3i is excellent BUT why no CD/DVD drive?????",
            "A very very good PC, excellent Screen size and quality, very well specified",
            "Excellent pc does what it says on the tin",
            "Great pc, runs everything super fast even photoshop! Great screen quality as well only let down by mouse and keyboard, change for a wireless set and youve got a great looking system",
            "Absolute brilliant pc ,does what it says on the box , couldn't be more pleased with it thank-you,  can recommend to everyone",
            "Great looking PC that was unbelievably quick to set up. I am really pleased with the purchase. It was a good price too.",
            "Excellent  pc for office and gaming",
            "Easy purchase, quick pick up",
            "up graded my previous Lenovo AIO with 22\" screen as it was now reaching its 5th birthday to this 27\" screen with both sata drive and hard disk drive for storage . It's fantastic much quicker than my previous Lenovo  and having reset my old Lenovo to factory condition and passed on to my stepson .That is also performing well . So for  a Quality built PC that performs as well as it says on the tin you can't beat  lenovo for quality and price.",
            "Amazingly big monitor with fantastic view, more like a TV. Bought for my son for his remote learning. He is more than happy so far.",
            "Big screen and compact. Nice sound.\nFast till you start using too mach GPU\nNoisy sometimes\nOverall good buy for this price was small upgrade for my kids to do home work.",
            "This was a replacement for my previous IdeaCentre that my new Siamese kitten destroyed! The bigger screen is such a bonus for my 50 year old eyes. Beautiful picture quality. As before this is a lovely bit of kit and the base is screwed to the desk to protect it from kittens this time. If I had one gripe, it would be the placement of the power switch as it is difficult to access. Otherwise I am very happy.",
            "A first class computer, that has increased my zooming pleasure . I was very happy with my previous Lenovo, so knew this one would be fine.",
            "Got this to replace my hp all in one which was getting tired. Use it mainly for home browsing and writing reports. Would have liked the Microsoft office as part of the package that's why its a 4 star\nFast, efficient and does what it says on the tin and great up to now.",
            "Great WELL PLANED also I liked the style of it. Easy to setup and that is about all I can tell you.",
            "Good product, easy to set up"
        ]
    }
}