{
    "795/5763": {
        "remotekey": [
            "795/5763"
        ],
        "item_category": [
            "The space-saving Vivo AiO V241 is remarkably slim and light. It features an impossibly thin bezel for edge-to-edge viewing and an impressive 88 percent screen-to-body ratio. This stunning 23.8 inch widescreen display includes wide-view technology that makes it perfect for sharing pictures or videos with friends and family. It's Powered by and AMD R3 processor which helps to deliver an effortless performance for smooth multitasking. So whatever task is at hand, you'll finish it quicker. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "13 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "92%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "25 April 2021",
            "14 April 2021",
            "7 April 2021",
            "18 March 2021",
            "31 December 2020",
            "2 December 2020",
            "18 November 2020",
            "10 November 2020",
            "13 October 2020",
            "4 October 2020",
            "23 September 2020",
            "22 September 2020",
            "22 September 2020"
        ],
        "review_title": [
            "sleek look and easy to use",
            "Great machine at reasonable price",
            "Very good quality!",
            "Works fast",
            "Amazing",
            "This PC is fab",
            "Lasted a day",
            "Very Satisfy good Quality Products",
            "Excellent",
            "Highly recommend.",
            "Superb",
            "Love my desktop.",
            "Impressed"
        ],
        "review_text": [
            "Did a lot of research before purchase and read reviews. Glad I made the choice. Easy to setup, love the keyboard, very user friendly, and love that it is wireless and the mouse too. \nSo far seems very fast and responsive. I'm sure I haven't used it to it's full capabilities yet, but it suits my purposes so far. Very happy with my purchase.",
            "This PC looks great on the desk. It’s enough powerfull to run smoothly all office apps.\nVery happy with purchase:-)",
            "Very good quality! Thanks.",
            "Affordable price Good at work.",
            "It does everything I need to do and runs smoothly",
            "This PC is fabulous.",
            "Refused to power up day after  purchase",
            "thank for the Product Very Happy",
            "Excellent very quick keyboard feels nice it also looks very smart.",
            "Not being familiar with the name I hesitated to purchase this computer.  I need'nt have worried.  It is easy to set up and performs well. Would thoroughly recommend this computer.",
            "My first all in one, decided on it to save space amongst other things, It's a fabulous piece of kit, set up in seconds, works so fast compared to my previous ones, can't fault anything at all, would 100% recommend it",
            "I always use a certain make when buying desk, but this time they were out of my price range. I choose this desktop for the looks and I am not disappointed.\nCrisp sharp easy setup etc, to much to mention.\nI would recommend this brand name to all my friend who are on the lookout for computer product. With ref to the product quality, I should know within 3 months of use. I would love to come back to update this product",
            "I needed to upgrade my PC and searched for many weeks & read numerous reviews on these PC's. I was tired of wires, so my main criteria was value for money & a wireless mouse & keyboard.\nI went for the middle priced option, for my personal use, rather than using a work laptop. Easy to set up, connected my printer & away we went!\nIt has performed very well to date. I would definitely recommend."
        ]
    }
}