{
    "869/0687": {
        "remotekey": [
            "869/0687"
        ],
        "item_category": [
            "The HP Pavilion is a tower desktop PC that offers power and performance as well as a premium entertainment, gaming and multitasking experience. With the agile Intel Core i3 processor and 8GB of RAM and 1TB of hard drive space, this computer is ready to handle your everyday computing needs. From creating great presentations to managing work and school documents to watching videos, this is a great all-round PC. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "9 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4"
        ],
        "review_date": [
            "5 May 2021",
            "9 March 2021",
            "2 March 2021",
            "24 February 2021",
            "9 February 2021",
            "3 February 2021",
            "1 January 2021",
            "1 January 2021",
            "28 October 2020"
        ],
        "review_title": [
            "HP",
            "Easy to set up- so quick now-glad I bought it",
            "Excellent Home pc",
            "Early days but pleased so far",
            "More than adequate",
            "The pc looks good",
            "Good all round desktop",
            "Perfect no problems",
            "Good PC"
        ],
        "review_text": [
            "What can I say it's an HP Product supplied by Argos, all great.",
            "Easy to set up and it is now so fast in operation-it’s Brilliant. It looks great- it’s compact and loads of usb sockets\nIt doesn’t have a cd/dvd player but enquiries reveal this is virtually across the board now as everything is digital- do what I did and buy a cheap external usb CD player - perfect.\nI am very happy with my purchase.",
            "Brilliant computer for home use, for children and adults, great for working from home or even just your own pleasure to use",
            "Haven't had it long enough to give a proper review but pleased with it so far. Purchased to replace a desktop that although Windows 10, was originally a Windows 7 and was very slow. This one much quicker. I don't use it for gaming - just video editing, browsing the web and for storing photographs mainly. Was easy to set up and you can remove any of the included apps that you don't want easily. It's nice and compact and has enough USB ports etc to satisfy me.",
            "A good choice, plenty of storage and fast enough for Minecraft and Roblox type games. A simple set-up with no obvious faults, takes up less space than a traditional tower. HP products have been reliable in the past.",
            "My son loves this ps, looks good and smart, the black box is not big and can fox easily\nIn his room",
            "Good all round desktop suitable for most things even light gamming. my only niggle is it could do with a bit more RAM",
            "Looks amazing perfect size has had no problems with it so far and works fine would definitely recommend",
            "The PC seems OK. It appears fast. Its got good storage. No SPEAKERs separate purchase required. It was advertised as NEW and there were no reviews to go by. Unfortunately I had to return it to the store as 1. It was poorly packaged 2. it's warrently was only 10 months. 3. All the free trial's were activated. I took it back to the store Argos gave me a replacement unfortunately the second PC has a warranty of 9 months. I haven't returned it as it is to much hassle. So buyer please be aware."
        ]
    }
}