{
    "920/2854": {
        "remotekey": [
            "920/2854"
        ],
        "item_category": [
            "A powerful desktop PC loaded with performance and style. This HP Pavilion desktop exceeds expectations with a new generation of performance, the freedom to store what you need, and a sleek Natural Silver design. All your activities become easier and faster than before with an AMD Ryzen 5 processor and A 1TB hard drive. Watch videos, edit photos, and connect to family and friends with all the power you need to get things done. Make a statement with a new slim design featuring a sleek profile that does not compromise performance. "
        ],
        "summary_star_rating": [
            "4.9"
        ],
        "no_reviews": [
            "10 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "100%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "21 July 2021",
            "6 July 2021",
            "9 June 2021",
            "8 June 2021",
            "3 December 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "24 November 2020",
            "18 November 2020"
        ],
        "review_title": [
            "fast and",
            "Not bad but could be better",
            "Great features",
            "great pc",
            "Good solid performance from HP All-in-one",
            "A great desktop computer",
            "Fantastic!",
            "Fabulous",
            "All in one PC looks great",
            "Good Machine for home working"
        ],
        "review_text": [
            "i bought this for my son, he is able to edit his video now",
            "Bought to replace 12 year old tower system.  Good looks and screen, soild feeling keyboard and mouse, useful to have SD card slot under front of screen (only takes standard SD cards).  Two main annoyances are the hard drive (1TB)/ fan not sure can get noisy at times and I find it annoying that the 5 the USB ports are at the back 2 of which are taken up by the mouse and keyboard so you might need a USB hub if you have several devices.",
            "Does just what  needed it to do",
            "i bought a week ago and love it works so much better",
            "Replacement for early 2000's HP laptop that was struggling with latest upgrades. Bit worried about \"all-in-one\" idea, but now set up and I am now sold on the idea. Very clean and tidy lines. Loads of HP variants and very difficult to compare one HP version with another, but went for \"Ryzen 5\" processor rather than the \"Intel\" alternatives as these appear to provide better results for same outlay. So far I have no reason to doubt this. Overall very impressed.",
            "This desktop computer is great.  It has everything I want and is a pleasure to use.",
            "Had to buy a ne PC, as I work from home more often now. Looks great, love that it's an all in one PC design, not quite a laptop but, does save on space! Price as expected, performance great.",
            "Fantastic look and performance. Big screen, crisp colours, very good quality computer.",
            "Bought it for my daughters collage course in graphic design and it's great",
            "Bought this for working from home, good performance, easy set up and it goes with my lounge decor!"
        ]
    }
}