{
    "916/4239": {
        "remotekey": [
            "916/4239"
        ],
        "item_category": [
            "Beautiful All-in-One design. Built to perform. This beautiful, powerful 24-inch All-in-One PC has the storage to satisfy all your family's needs and help you get things done. Whether it is for work or play—you have found highly attractive design to match high performance. With an Intel Core i5 processor and 1TB storage and 8GB memory for you and your family, seamlessly go from sending work emails to uploading holiday photos with ease. "
        ],
        "summary_star_rating": [
            "4.1"
        ],
        "no_reviews": [
            "9 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4"
        ],
        "review_date": [
            "2 June 2021",
            "12 January 2021",
            "1 January 2021",
            "27 September 2020",
            "17 September 2020",
            "19 August 2020",
            "13 August 2020",
            "12 August 2020",
            "12 August 2020"
        ],
        "review_title": [
            "Amazing",
            "The PC is amazing",
            "IT WAS NOT WHAT I WANTED IT WAS RETURNED",
            "Great Home & personal use PC",
            "Very good everithing",
            "",
            "Great purchase",
            "My computer looks very good and fast",
            "Looks stunning and fulfils my computing needs"
        ],
        "review_text": [
            "This lovely stock of argos by HP,  is really amazing but could have been better for that price with wireless mouse and keyboard,  in comparisons with other products in review.",
            "This PC is amazing.No doubt. I would hundred percent recommend anyone looking to buy a super fast and beautiful pc to buy this one. Ive had no issues and its been running fine!",
            "NOT WHAT I WANTED I RETURNED IT",
            "Exactly as described but for the amount could have been touch screen. Mouse/keyboard are a little chunky could have been flat and sleeker designed. Hp should consider opting for wireless mouse/keyboard as wires are very long and cosmetically ugly.\n\nAdjustable screen and with plastic not glass screen. \nThe speed is great, able to connect to WiFi easily from upstairs.\nWindows 10 home and intel 10th generation stated on actual PC.\nNice neat design, been complimented on many times in the home.",
            "is working very nice and quick, didn't meet any problems yet.",
            "Good quality good price",
            "Excellent piece of kit.",
            "I thought I get wireless keyboard and mouse but it didn’t happen",
            "An ideal computer for everyday home or office work."
        ]
    }
}