{
    "884/8068": {
        "remotekey": [
            "884/8068"
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "25 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "96%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "8 June 2021",
            "28 April 2021",
            "21 April 2021",
            "20 April 2021",
            "14 April 2021",
            "14 April 2021",
            "1 April 2021",
            "4 March 2021",
            "23 February 2021",
            "18 February 2021",
            "9 February 2021",
            "26 January 2021",
            "31 December 2020",
            "3 December 2020",
            "22 November 2020",
            "1 November 2020",
            "28 October 2020",
            "22 October 2020",
            "13 October 2020",
            "1 September 2020",
            "26 August 2020",
            "22 August 2020",
            "12 August 2020",
            "4 August 2020",
            "29 July 2020"
        ],
        "review_title": [
            "Fast internet connection and easy set up",
            "Superb laptop",
            "Computer works excellently !",
            "Powerful laptop",
            "Omen",
            "Go omen 15 is good",
            "Excellent M/c",
            "Great performance and look good",
            "Perfect gaming laptop its very fast!! Fabulous!!",
            "Fast enough",
            "From Playstation to Pc !",
            "My laptop is great",
            "Gaming laptop",
            "Amazing Performance",
            "Better performance than expected",
            "Great performance",
            "Great Laptop",
            "good all rounder",
            "",
            "Great laptop",
            "Very Dissappointing for what should be great!",
            "Fantastic and reasonably priced gaming laptop.",
            "Fantastic for mobile gaming",
            "Running games quick, the graphics is brilliant",
            "Good performance im happy with the product"
        ],
        "review_text": [
            "Really like this laptop- only downside is the charging - doesn’t last long so have to charge continuously. Apart from that everything about it is great",
            "Excellent laptop , superb performance , speed graphics are another level",
            "Argos had this in stock , it was delivered more quickly than promised ! Product is excellent! Easy to set up even for a novice like me  !",
            "Excellent PC . The only drawback is the guarantee which  does not start from the delivery date, i.e. only 9 months guarantee left when I bought it.\nI am using this gaming PC as my laptop for work: ventilation is much more efficient and therefore the laptop is much more suitable for CPU intensive tasks.",
            "Its good to use but the battery life is bad, you have to keep it on a charger all the time if you keep on using it. Other than that it's all good.",
            "Nice to start good graphics",
            "Specced computer and the price was good, Click and collect worked well",
            "Fast , look great, good performance only bit expensive. Worth the money.",
            "Perfect gaming laptop!!Fabulous!! The only downside is the charger is big, heavy and gets really really hot. \nArgos delivered item within 12 hours, amazingly fast!!!",
            "Good choice of configuration, love to use it.",
            "Recently i made the transition from PlayStation to Pc and after ALOT of research, i went with the Omen.\n\nThis thing is a beast! I specifically play MMORPG's and this handles the servers at max capacity, aswell as background apps like Steam, Minion and Discord to all run smoothly along side your games.    If you're thinking about swapping, this is the one.",
            "Very good laptop good speed and good memory",
            "We are really pleased with this devise only concern is it gets really hot . Poor battery life.",
            "Upgraded to this from a previous Omen (3 year old one).\nThis one has more RAM and way better CPU and GPU.\nRuns anything I throw at it and the screen is amazing.\nI know it will last as my last Omen had zero issues and was in use daily.\nHighly recommend for anyone wanting a good gaming laptop and a reasonable price.",
            "I love the design of the laptop, slightly understated but unique. It immediately feels like a quality product when you take it out of the box. Performance was better than expected, I was connected to a 4K TV, so games below run at 4K. I enjoy sim games, so far played iRacing easily 80FPS, flight sim 2020, approx 40 FPS with a mix of mid/high, and Assetto Corsa Competizione same at flight sim. I was using Fanatec wheel and pedals. Boot up time is approx 15-20 secs.",
            "It is fantastic computer. Very powerful and plays everything ive thrown at it.\nOnly few downsides are, it gets really really hot, so a laptop cooling mat would be recommended and also keep it plugged in, this due to battery not lasting very long.",
            "Advertised as gaming laptop but also works really well for CAD users for our business",
            "had the laptop for nearly a mouth now found it works really well, its got a nice smooth keyboard, battery life is good and a very vivd screen",
            "Awesome laptop ....amazing to use",
            "Worth of every £ great for the money especially the Sounding",
            "A very disappointing laptop! Had to buy 3 laptops in the space of 5 days!\n1st laptop had screen issues - screen flickering and damaged pixels. Was told it was a hardware issue. Returned to store and got a 2nd replacement only to find again straight out of the box had screen issues! Screen glitches and pixelation! Trying one last time hopefully 3rd time lucky on what looks like a great product on paper but the reality isn't so. Very disappointed.",
            "A great performing gaming laptop that looks great, no issues with heat either. The SSD storage makes a massive difference to windows and game loading too. Very impressed considering the price.",
            "Fast and furious. Head phones recommend for long gaming sessions due to the Inevitable fan noise.",
            "The best deal for a good gaming laptop",
            "Gaming is good\nFast response \nNo problems with the cooling system"
        ]
    }
}