{
    "401/7312": {
        "remotekey": [
            "401/7312"
        ],
        "item_category": [
            "Fire HD 10 Kids Edition tablet is Amazon's largest and fastest kids tablet, includes a full-featured Fire HD 10 Tablet, Kid-Proof Case with built-in stand, 1 year of Amazon Kids+ and a 2-year worry free guarantee. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "68 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "99%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "20 May 2021",
            "19 May 2021",
            "5 May 2021",
            "21 April 2021",
            "14 April 2021",
            "8 April 2021",
            "30 March 2021",
            "28 March 2021",
            "17 March 2021",
            "3 March 2021",
            "3 March 2021",
            "2 March 2021",
            "25 February 2021",
            "23 February 2021",
            "30 January 2021",
            "5 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "29 December 2020",
            "2 December 2020",
            "2 December 2020",
            "24 November 2020",
            "10 November 2020",
            "3 November 2020",
            "31 October 2020",
            "28 October 2020",
            "28 October 2020",
            "28 October 2020",
            "12 October 2020",
            "18 September 2020",
            "16 September 2020",
            "15 September 2020",
            "9 September 2020",
            "8 September 2020",
            "8 September 2020",
            "2 September 2020",
            "1 September 2020",
            "26 August 2020",
            "12 August 2020",
            "7 August 2020",
            "5 August 2020",
            "22 July 2020",
            "10 July 2020",
            "24 June 2020",
            "23 June 2020",
            "16 June 2020",
            "9 June 2020",
            "7 May 2020",
            "5 May 2020",
            "10 April 2020",
            "8 April 2020",
            "26 March 2020",
            "25 March 2020",
            "24 March 2020",
            "7 January 2020",
            "2 January 2020",
            "1 January 2020",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019"
        ],
        "review_title": [
            "My sons love it",
            "Toddler tablet",
            "3 year old birthday gift",
            "fab for kids easy set up too",
            "Kids love it",
            "The tab is excellent in every way",
            "its great",
            "my granddaughter loves this",
            "kids love it",
            "My grandson is delighted with his “Big” screen tab",
            "Amazon Fire 10 HD looks fabulous and works  perfec",
            "Great toddler tablet",
            "Very happy girl",
            "Excellent kids tablet",
            "This tablet is wonderful, we feel safe about it.",
            "A fantastic piece of equipment",
            "Amazon fire tablet",
            "Excellent better than the old model",
            "Perfect for my 6 year old",
            "Amazing tablet",
            "Amazing for kids",
            "My little princess tab",
            "It a perfect upgrade from the 7inch",
            "Fantastic",
            "The tablet look amazing",
            "Good",
            "U brake it we will replace it",
            "Sturdy build with good features as parents for kid",
            "My nephew loves Amazon fire HD",
            "Excellent for children",
            "My 2+ year old Great Grand Daughter’s Buddy",
            "Fab tablet",
            "Amazon fire 10 kids tablet looks great.",
            "Amazon tablet",
            "Tablet",
            "My son loves the size and it keeps its charge for",
            "Work perfectly",
            "looks good and robust.",
            "Great my daughter loves it",
            "My kids love their tablets",
            "",
            "Lovely Tablet",
            "Tablet is great, my son loves it!",
            "Fab",
            "",
            "Lots of fun for a little boy",
            "The best tablet for kids!",
            "The best tablet ever",
            "Amazing kids tablet absolutely 5 star",
            "My daughter loves her new tablet",
            "My daughter is very satisfied with it,",
            "Fantastic purchase",
            "This Amazon fire is excellent in design",
            "Great tablet",
            "Looks great",
            "Love the kids tablet! For me and the child",
            "Bought 2 of these for my children",
            "Just Perfect !",
            "Excellent value.",
            "Brought for 3 and 5year old",
            "The best kid safe tablet about",
            "Fire tablet",
            "great performance easy set up for hd kids fire tab",
            "Great tablet for kids",
            "Best for kids",
            "This is really good the kids love it",
            "fire kids HD10",
            "Great tablet"
        ],
        "review_text": [
            "I bought this tablet about two weeks ago. My boys 6 and 9 love it. You also can download and share apps and websites you like. I can not agree on that with other people's review. It is good to watch some videos on you tube to learn how to do that. I am so happy with my purchase so far, mostly because adds completely disappeared from my kids lives.",
            "I bought this for my great grandsons 3rd birthday it’s a very good educational tool for little ones x",
            "This is so easy to use for kids and adults. I like that there are parental controls and you can disable the internet. There are alot of apps and games etc that i think most are compatible. The only thing id say is that the movies and tv shows aren’t available for you to put into the watchlist so it can be a bit annoying if your child is trying to find their favourite episode of something. Other than that its the best thing ive bought for my daughter.",
            "Brilliant tablet - we switched from ipad and don’t regret it! \n\nThe cases are good and the content that comes free for 12 months is really good. \n\nThe 2 year replacement warranty is amazing perk too! \nReally impressed",
            "This is the best tablet that I ever had. Very educational and brilliant for my 4&6 year old. It has loads of apps I would definitely recommend it. And I will be getting another one for my nephew",
            "My grand daughter absolutely loves it.",
            "Grandaughter loves it, has never put it down since she got it",
            "it is great love it glad i went for this one sturdy/ lots of features my granddaughter has the oamazon fire 7  but this upgrade is perfect, and her younger sister will use the 7 all happy .",
            "Great tablet for kids",
            "We had priced the tablet at a few places and it compared favourably with them. It is the tablet we wanted to upgrade him from the smaller screen. He is very pleased and now he and his younger brother have a tablet each.",
            "Amazon Fire 10 HD Kids Edition 32GB Tablet - Blue\nIs perfect for my  wee  boy , he's  loving the apps and games , very  durable and good  value for  money  \nPerfect tablet for  children",
            "Great toddler tablet for my son, he loves the educational games. However I didn’t realise you couldn’t have Netflix on there like on other tablets",
            "Super pleased with this tablet, easy to use and great sturdy case included.",
            "So far we have found this to be an excellent tablet for my daughter. The 2 year replacement guarantee definitely influenced me to choose this one. It’s sold out on amazon at the mo so was thrilled to get it quick n easy from argos. It’s very easy for her to use, screen brightness is good and the amazon kids feature is perfect for her. She can do games, videos, colouring, maths etc. Everything can be controlled from parent dashboard on my phone. The case is good protection and design.",
            "This tablet is wonderful, we feel safe in this regard, because there can be no drawings and many others that are not specific to the child's age, as we make the setting for the child's age so it remains no error or anything. We are glad both we and my child of this tablet Amazon fire10.",
            "Brilliant activities fir children & easy to work with a reassuring guarantee , I highly recommend",
            "This tablet is very good as it comes with the free 1 year Amazon Kids. My 5 yo daughter is very interested in all the games most that she likes are educational and is helping her with spelling, puzzles, books that she is reading by herself and watching the cartoons she likes but we didn't have access on our TV as we had to subscribe to a platform. Also has the camera for her to snap away. At the moment, we haven't explored much more as there is so much choice on the dashboard.",
            "Easy to hold and use even for toddlers",
            "Very quick to order and collect immediately. It is quite big my daughter is quite tall so i wanted a bigger screen for her. She loves the big screen and also it’s easy to use and set up if you have an Amazon account. Just sign in and set up your child’s profile. Only just got into these tablets as avoided my children to be kept away but with covid restricted what to do,where to go. My main reason for purchasing was I can limit how long she is on it with no arguements afterwards.",
            "Had this for my four year old for xmas and she absolutely loves it. Has everything on it. And paid an amazing price for it",
            "Bought for my son and he loves it. Fabulous battery",
            "My Daughter love this Tablet and enjoy learning and playing . \nQuite lot of application for Kids for learning . You can automatically control screen time by set no of hours everyday .",
            "I got it as a Christmas gift to replace my son's 7inch  kindle. Its so much bigger and faster.",
            "Great for the grandkids",
            "The tablet is easy to use,My son loved it",
            "My kid loves it but batter not very good but in all other ways very good",
            "That's the reason why I brought this item from Argos \"u break we'll replace it\" well this is not true Argos dont replace it",
            "The price was as advertised on Amazon site. The product was readily available on Argos which was a surprise to me as it showed unavailable on the Amazon site. Well done Argos on that. Pick up was like a breeze and painless even in this pandemic. Product is good considering the kids account and parents control. The external case is nice, to hold and from damage control. My daughter loves it.",
            "It was really handy for my nephew to play with.",
            "My daughter loves it. Its easy for her to use and has lots of features for children.",
            "A Brilliant Teacher, Great Friend & A Fantastic Entertainer too. Thanks",
            "Gd pics gd videos plus easy to use & suitable for kids & adults",
            "I would highly recommend this product",
            "This kids tablet is perfect for my 2 year old son its light to hold and very easy to use",
            "Bought this for my grandchildren.when a t my home and love it .. so easy to access apps and lots of fun things for pre school",
            "Make sure you read instructions especially to keep your child safe .",
            "The item is very educative and entertaining, my boy love it.",
            "The 2 great granddaughters have 1 each now,  they both love them and particularly like the stand,  everything thing seems to work well and I hope it continues.",
            "There is no dos or Dont’s",
            "The tablets are really nice. They are loaded with a lot of options for my girls to explore such that they have not fully exhausted the features. \nI love the parental control which allows you set a daily screentime limit with the option of setting educational goals to be met before they can use other features.\nThe only downside is the battery capacity,if only the battery could last a bit longer.",
            "The amazon kindle keeps my child occupied  it was a good buy",
            "Beautiful for children to navigate. I would recommend. Great parental control!",
            "Well designed, light, great safe cover. Can set up two accounts: child and adult one.\nBig screen, easy to use, great looking.",
            "Perfect for my 8 years old daughter",
            "Great for school work and fun for gaming.",
            "My son loves his new ipad loads of fun big screen and hours of games to play",
            "The best tablet! Daughter had the previous 3 years, gave her younger brother,  now we bought her this one for her birthday. The best tablet for a kids.",
            "My toddler love it . Very easy to use ... Parenting control ... Highly recommended!!!",
            "Its the best truly in every aspect.\n5 star hands down all my kids want their own now!",
            "Thank you , it’s perfect for my daughter with so much choice of games . Great case that come with it perfect for little ones",
            "This tablet is very good, good screen quality, volume is ok, it’s very good because we can put time limit for children to play with. There are not some bad internet apps, sites. There are useful games , and also informative program about animals , countries. We can learn , play, watch video. It’s very good tablet for kids, no very expensive.",
            "A fantastic buy. Loads of entertainment and games to keep my son occupied. Would definitely recommend",
            "The design has a built in stand which is excellent particularly when charging. The battery life seems to be very efficient. Overall a very satisfactory purchase.",
            "Bought this for my grandson and he absolutely loves it .money well spent with a great guarantee. Highly recommend this product",
            "It’s a great product",
            "Great tablet! Love how it has the amazon kids section so I can keep all my child's content on one app and I can also use the tablet for my own apps. Very easy to use, lots of content and great parental controls takes the worry away of kids browsing unwanted pages",
            "This version is brilliant, we had the 7 for years and these are much faster, brilliant screen with 1080p, excellent battery life too unlike the 7. The charger has been improved too.",
            "I brought this as a Christmas present for my 18 month old grandson. The family went on a long haul flight shortly after Christmas and said the tablet was the ultimate in keeping him occupied. With colourful games and downloads there was plenty for him to watch and share with family members.",
            "My grandson loves it, he has had the previous models, but this one with the stand, bigger screen & grip, is a lot better",
            "Great product even with Amazon kids profile restrict content etc. Great product.",
            "Very good and easy to use battery lasts for ages and quick to download apps",
            "Lovely product for kids",
            "does everything i want kids love it easy to set up",
            "Excellent tablet, great parental control, comes with a year's access to kids books, movies games etc",
            "Really nice my 6 year old girl love it must have for kids .",
            "It's really good and the kids love it",
            "Easy to set up straight out of the box, little one was on her own profile within an hour - battery life is great (got around 10 hours solid use from first charge) big screen but lightweight and well protected. Very happy with it",
            "Brought this for my 2 year old. So far really glad great content and lots of learning for her age."
        ]
    }
}