{
    "827/1824": {
        "remotekey": [
            "827/1824"
        ],
        "item_category": [
            "With the 11 Tab S7, you've got some serious screen space to enjoy. That means plenty of room to immerse yourself and craft your latest masterpiece or work report with the S Pen. If you're looking for a laptop experience, just activate the Samsung DeXmode and add the Book Cover Keyboard* to feel the PC-like power. Alternatively, leave as is and use Split View to maximise your productivity and video chat with your boss while you refer to your research –or chill out watching YouTube while you message your mates. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "13 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "75%"
        ],
        "review_rating": [
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4"
        ],
        "review_date": [
            "21 June 2021",
            "28 April 2021",
            "3 February 2021",
            "26 January 2021",
            "13 January 2021",
            "13 January 2021",
            "12 January 2021",
            "7 January 2021",
            "28 October 2020",
            "27 October 2020",
            "28 September 2020",
            "15 September 2020",
            "8 September 2020"
        ],
        "review_title": [
            "Lifeless Screen and lacking in connectivity",
            "My Samsung s7 tab is amazing",
            "It’s excellent tablet",
            "My S7 tab screen is great and fast charging.",
            "Love the tablet  works a treat",
            "Excellent",
            "Fabulous display immersive experience",
            "Slightly disappointed",
            "Mr Marsh",
            "LCD Display?!?!",
            "Excellent device, Samsung you nailed it!",
            "Samsung have done it again!!!",
            "European Version of Tab S7 and S7+"
        ],
        "review_text": [
            "I brought this to replace a Tab S6 that I dropped. I didn't want a 12\" screen so opted for the Standard S7. This was a mistake. I didn't think I would notice the lack of an OLED screen but it was immediately apparent with washed out blacks and pitiful brightness. Samsung have let themselves down here by removing features from the physically smaller model with no sensible reasoning - given that the s6 had an OLED screen in a similar size. As for why they couldn't be bothered to include 5g who knows.",
            "Very happy would recommend to anyone easy to use battery life 100% perfect",
            "I love it I’m still getting used to it I can almost do all my uni work with it, battery life is good I didn’t expect it to last as long as I expected the pen comes with it is great although I use my finger is there when you need it.",
            "Its very good features brighter screen display and very fast charging speed.",
            "Love it it a great piece of kit still  so easy to set up to be honest it virtually does it itself  not sure about the stylus pen rested on the back of the tablet but it is somewhere safe to keep it",
            "All good - great size, easy to use in the hand but also big enough on the go / around the house in place of a laptop. The s pen works brilliantly - and the handwriting recognition means no need for a separate keyboard for a lot of day to day tasks. Really impressed - and great service from Argos as usual.",
            "Pros-\nImmersive display\nSuper fast\nGood battery life\n\nCons-\nBit pricey \nSize is bit bulky but ok",
            "Although the device is good, I feel for the price it should of came with atleast earphones the charger supplied with it feels cheap, I feel the keyboard should be included, Better of buying a laptop around the same price you would get so much more for your money",
            "Great feel light weight but not cheap great screen resolution Dolby d all you need whether at home or on the go. Highly recommend",
            "An expensive tablet without an AMOLED display when the S7 Plus has it? Booooo to Samsung. Boooooo. Oh and I have to sign up for marketing to post this review.",
            "Well I was a bit worried to be honest as my last 2 tablet from samsung was amoled. But I thought I'd gave them a chance. And the screen really surprised me to be honest, I find it better on my eyes and can't see much of a difference at all. The 120 refresh rate is very nice, the 6gb of ram is enough hard core gaming zero lagg as the process carries it. The build quality is superb looks and feels more premium than my s20 to be honest, I like that I can take calls and receive texts on this aswel, when connected to my phone. I thank samsung for the 3 years updates policy about time. All in all this is a fantastic table which has actually taken me by surprise. Looking toward to  the next phone a tablet in a few years time. Will take pleasure to upgrade as you give higher trade in value. Thanks samsung",
            "Processor, clarity, features and colour! \nI am so impressed with this tablet. I wanted something to speed up my work progress and I have found it. The features and apps are a great way to interact with the tablet, it is light weight as well and very stylish to look at. \nThe pen is amazing to hold and use and the precision is perfect, I find myself forgetting that it is just for the tablet.\nOverall I love everything about it and well done Samsung!",
            "While this Device is the best Tablet on the Market right now I would like to ask Why Samsung are always lowering the spec for European markets that to me is unfair Everywhere should get the flagship specs.  I wish to purchase the 256g version of the Galaxy Tab s7+ With the 8 gig of ram other markets get but instead we are limited to 6 gig here in Europe please listen to us Samsung"
        ]
    }
}