{
    "918/4484": {
        "remotekey": [
            "918/4484"
        ],
        "item_category": [
            "Get bumped up to first-class experiences through the Lenovo Tab P11's eye-catching 2K visuals on its 11-inch display, quad speakers with persistent user-facing stereo tuned by Dolby Atmos and 15 hours of battery life. It also comes with the latest new kids mode with Google Kids Space, featuring content that helps kids discover, create and grow. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "24 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "91%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5"
        ],
        "review_date": [
            "12 July 2021",
            "24 June 2021",
            "10 June 2021",
            "8 June 2021",
            "28 May 2021",
            "19 May 2021",
            "27 April 2021",
            "13 April 2021",
            "12 April 2021",
            "31 March 2021",
            "31 March 2021",
            "20 March 2021",
            "16 March 2021",
            "16 March 2021",
            "16 March 2021",
            "10 March 2021",
            "10 March 2021",
            "26 February 2021",
            "26 February 2021",
            "25 February 2021",
            "25 February 2021",
            "20 February 2021",
            "18 February 2021",
            "15 February 2021"
        ],
        "review_title": [
            "First tablet",
            "Lenovo P11",
            "Lenovo P11",
            "So nice to use.",
            "Great tablet",
            "Handy little device",
            "P11",
            "Great sound but patchy video playback",
            "Great tablet at affordable price",
            "My new tablet",
            "Great tablet",
            "Good screen shame about the OS and support",
            "",
            "Looks good design is up to the current standard",
            "Good but a bit buggy",
            "My tablet it's perfect for movie and play games",
            "Great almost stock Android tablet",
            "Good tablet",
            "Great Laptop",
            "Fast and affordable with decent screen size.",
            "A good basic tablet",
            "Good value for money, require more regular updates",
            "Switched from Apple.",
            "Excellent tablet for media and web browsing"
        ],
        "review_text": [
            "Still learning, but super-easy to set up and get going. Paired with my mobile, so apps copied across. Great size screen for my projects.  Long battery life.",
            "It took me a while to get used to this tablet from my Yoga 3 but the processor is very fast and I now have got used to the larger screen. It has many features and I have disabled some apps as they are not for me. I really like the Lenovo range and they are priced competitively",
            "I bought 2 week ago Lenovo P11 tablet working perfect good sound good value for the money.",
            "So easy to use, no problems with it, just so easy to work .",
            "My dad is satisfied with the clarity and the speed . he uses it for browsing, streaming, reading, movies, etc",
            "The device is very capable and the keyboard is a treat",
            "I really like this tablet I brought it in addition to my laptop. U can stream all I want and normal browsing in the normal tablet mode. However in the productivity mode it is  brilliant as I use it for my education purposes. Its easy to use and switch between both modes.\nI would recommend",
            "Really impressed with the whole unit, mum loved the big 11 inch screen and the sound for a tablet I thought was very loud and clear, it has 4 speakers, 2 at each end. The only down side is it doesn't seem to like ITV player or the UKTV apps. They work, but video playback is very juddery. BBC iPlayer and YouTube work fine every time in full HD, but the other 2 are unfortunately unwatchable.",
            "Amazing tablet. \nThe screen is very clear and bright to use indoor, (I haven't used outdoors but i don't think it will be good in direct sunlight).\nQuick and snappy processor and great for multi tasking and split screen.\nThe sound is one of the best things in this tab. Loud, clear and well tuned 4 speakers offering great surround sound experience.\nOverall very happy with the device and for this price it's a highly recommended tablet.",
            "Excellent tablet. Terrific size. Love Lenovo.",
            "Easy to use and great picture quality",
            "Spears and feels well made, good screen responsive touch. New Android system glitchy some apps including Chrome will not load some like room will not down load. Little or no information on the Lenovo site P11 not even listed in the help sections, if you are going to launch a upmarket product it should be well supported or its supposedly great features will not be used. Writing this review on my Tab M10 as it's a lot more usable!",
            "Can’t download anything and if u do manage it it is always closings the app,but the only thing that is good on this is the screen contrast which is very good",
            "Bought for the missus and she likes it sa it's light and can be used in different places around the house... Bigger than average screen is a bonus and speakers also very good for the price",
            "Its a great tablet, good screen, light weight and retains its charge for a long time.\nI find that it is a bit buggy, sometimes the screen freezes and can only be unfrozen by switching between apps.",
            "My tablet it's perfect for movie and play games and working very fast",
            "Had this tablet for about a month now and it's been brilliant. Came from a Lenovo Duet Chromebook and this almost stock version of Android is in my opinion much better than Chrome OS at the moment. The screen is great and the size is very useful.",
            "Nice wide clear screen and good sound, much better than my now defunct Samsung Galaxy Tab S2. Was looking to replace the Samsung which developed a fault dropping off my WiFi network, a common fault as it turns out. Samsung Tab's seemed to be underpowered or more expensive for the range of features I have been looking for. I'd say at this price point it's a good candidate to consider if you're in the market for a tablet but don't want to buy an Apple device",
            "Have been very happy with the Laptop, quick and plenty of memory, with a nice clear display.",
            "Nice tablet quite fast compared to my old Huawei M3. The screen and productivity mode was the main points for buying this tablet. Their was a few issues chrome would lock up the tablet (seems fixed) and some apps don't work in productivity mode but pair this with mouse and keyboard nice little device.",
            "Good quality tablet. No headphone jack so Bluetooth headphones only. A large screen that's good for productivity. Hard to find screen protectors for it at the moment.",
            "Tablet is fast, came with Android 10, but so far no update to Android 11. Has facial recognition. However it came preloaded with software that cannot be uninstalled. So far I did not figured out how to disable camera in locked state",
            "Superb. Bought this to replace an older Ipad that was getting a bit slow.\nWas worried about switching from Apple but so glad i did. Found it easier to use, better screen and much faster.",
            "I bought this tablet to replace an old 7\" tablet for watching Netflix etc. and it's perfect. Put a wall-mount for it in the kitchen for entertainment while cooking and the size and brightness make it excellent - I can see what's going on without being right in front of it.\n\nI tried playing a fairly intensive 3D game on it and the framerate wasn't great but that's to be expected at this price point for a device with such a high resolution screen. This isn't a gaming device, but for everything else it's crisp and fantastic. I can get through several hours of television on a single charge, and web browsing and voice chat work great."
        ]
    }
}