{
    "827/1965": {
        "remotekey": [
            "827/1965"
        ],
        "item_category": [
            "With the 12.4 Tab S7+, you've got some serious screen space to enjoy. That means plenty of room to immerse yourself and craft your latest masterpiece or work report with the S Pen. If you're looking for a laptop experience, just activate the Samsung DeXmode and add the Book Cover Keyboard* to feel the PC-like power. Alternatively, leave as is and use Split View to maximise your productivity and video chat with your boss while you refer to your research –or chill out watching YouTube while you message your mates. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "59 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "86%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "4",
            "4",
            "5",
            "2",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "15 May 2021",
            "6 May 2021",
            "13 January 2021",
            "2 December 2020",
            "1 December 2020",
            "1 December 2020",
            "24 November 2020",
            "1 November 2020",
            "30 October 2020",
            "28 October 2020",
            "24 October 2020",
            "21 October 2020",
            "21 October 2020",
            "7 October 2020",
            "22 September 2020",
            "21 September 2020",
            "20 September 2020",
            "19 September 2020",
            "17 September 2020",
            "17 September 2020",
            "15 September 2020",
            "14 September 2020",
            "14 September 2020",
            "14 September 2020",
            "14 September 2020",
            "14 September 2020",
            "14 September 2020",
            "14 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "4 September 2020",
            "2 September 2020",
            "30 August 2020",
            "30 August 2020",
            "29 August 2020",
            "23 August 2020",
            "20 August 2020"
        ],
        "review_title": [
            "Stunning Samsung",
            "THE BEST TABLET IN THE WORLD!",
            "TAB7 7+ wifi",
            "Fabulous screen, and powerful tablet",
            "Far better than my ipad which I have replaced,  it",
            "My daughter loved the tablet",
            "",
            "Samsung instead of ipad",
            "Good, but not enough",
            "Amazing s-pen, lovely screen",
            "So much better than my last tablet",
            "Excellent tablet except the charger",
            "Very near perfect, but not quite",
            "Extremely portable with sleek design",
            "Impressive",
            "Rubbish",
            "Best tablet to own",
            "Great Tablet (not sure about the colour!)",
            "Genuinely amazing!",
            "Arrived with damaged sharp pen.",
            "Nice",
            "A powerful gem",
            "KEYBOARD",
            "Great samsung galaxy tab s7+",
            "Great tablet",
            "A Joy To Use",
            "LOVE IT!!!",
            "Great tablet",
            "Faulty Galaxy Tab S7+",
            "Good screen/sound but......",
            "Shockingly good.",
            "Vibrant screen",
            "AMAZING.....but not perfect",
            "Awesome tablet, but why only 15w charger",
            "Let down with the lack of keyboard option.",
            "My first tablet",
            "Great features",
            "Samsung 7+ tablet",
            "Tab s7 plus",
            "Amazing Tablet",
            "Superb",
            "You've Never Watched Movies Like This",
            "Samsung galaxy tab s7 plus",
            "Best tablet ever!",
            "Tab s 7+ plus takes place as my new daily device..",
            "Does everything I want from a Tablet.",
            "Excellent tablet",
            "Awesome tablet with great features",
            "Amazing tablet",
            "Amazing display, perfect for media.",
            "Works really fast",
            "Amazing screen",
            "Exceptional Device",
            "quality product great screen",
            "Best Graphic Tablet",
            "Ipad killer",
            "Disappointed",
            "Is a ipad pro killer",
            "iPad Pro killer"
        ],
        "review_text": [
            "I bought this 4 weeks ago and just wished i'd owned one years ago!. Amazing clarity and speed even editing photos",
            "Well done Samsung for doing a great job with this tablet. I sold my iPad pro 2020 to buy this tablet and I am very happy to own the Galaxy Tab S7 Plus. It was soo expensive for me but the performance of this tablet made me forget about the price, It worth it spending that much money on this tablet. \n\nThe display is just soo beautiful and I can't stop admiring it. It is also fast and it can play all games with no difficulties. I have always been a big fan of Samsung products especially their Galaxy S family. I love you soo much Samsung. Keep producing good products like this for us. \n\nI am a big fan of display quality so don't even think of going back to a lower display like you did to the S21 and S21 plus which is has really make me angry. Also please don't remove the memory card slot in the future like you did to the S21 family. We really need it to boost our storage. It makes absolutely no sense to take away features that makes your devices far better than other companies devices. DON'T COPY APPLE'S MISTAKES!",
            "Large screen for reading and great battery performance.",
            "I've had this tablet for a few weeks now, and have been very impressed with it's ease of use, the fabulous display, and the ability to use this like a laptop when combined with the Samsung keyboard.\nIt's easy to set up, handles multitasking, and watching movies is fantastic.  The sound from the speakers is also very good.\nIt's an expensive tablet, but you get what you pay for, and the build quality will ensure it'll last for a few years.  I can recommend this as a portable powerhouse.",
            "Very satisfied with product, would recommend",
            "It’s a good tablet specially it’s size and clarity",
            "Awesome tablet ever i had.",
            "Decided to try the Samsung over the iPad as it’s £200 cheaper and you can download a lot more apps not like the iPad where you are tied into apple for everything. Very impressed time will tell but first impressions are really good",
            "I am a loyal customer of your tablets, for some reason you are progressing slowly in tablets but not enough, 1) Why not put better cameras like there are in small devices? 2) Why does not have the nfc component in the tablet?\nIn the s7 you improved, you returned the 3.5 port to the headphones, and you also returned the flash to the camera\nHopefully the following tablets will also incorporate what I mentioned above, and then it will be perfect",
            "I bought this tablet for the s-pen and it did not disappoint. I love taking notes on this thing. \nThe AMOLED screen is gorgeous and large but is not 4k which should really be the standard now. My other minor gripes is there is no hadphone jack and only 1 USB-C port. But otherwise again Samsung have produced a great tablet.",
            "My old Samsung Galaxy S2 is still working and so is my laptop, but with the new Samsung Galaxy S7+ I only need to take it with me when I travel which has definitely lightened my load. I love everything about it including the pen. I would definitely recommend it. I was going to buy it on Amazon but they would take a week to deliver. Ordered with Argos and they had it for collection in a local store the following. Great as I was taking a trip and needed it urgently. Five stars to Argos*****",
            "Fantastic screen, very quick and decent battery. Mains adapter stopped working within minutes and for the money why not a fast charger",
            "I've had a number of tablet's over the years and this among the top ones I've had. The screen and the speed is amazing. For most this enough, but when spending serious money you want a serious tablet. For the most part this is, but the cost of the case or keyboard case are ridiculous. Secondly, no wireless charging. I've got 3 around around the house but none of are any good for this tablet. Finally, the last point being no flip out stand. You could have built-in stand and it still fit with in a case. 4/5 from me",
            "* Very portable device\n* Sleek design\n* Cheaper than IPad Pro with similar functionality\n* Amazing display",
            "After few minutes using this device I was just speechless! Never been so surprised about a piece of tech since the Nokia N9.\nI won't talk about design and quality, as it's obviously top class...\nThe performances of this tablet are on different level! It's so fast and smooth that probably you will need to get used to. Multitasking and Dex are a game changer on this device, as Samsung's apps (Internet, Mail, Notes, Write on pdf...).\nI've been using few professional apps like Miro, Adobe Comp, Clip Studio and I'm more than satisfied. I've also installed Figma as a webapp using Samsung Internet and I'm impressed how it works with the S Pen.\nLastly, the battery is infinite. \nBest tech purchase in the last 10 years.\nIf interested, buy it without hesitation.",
            "no headphones socket, Bluetooth headphones are another extra expense, magnetic S pen falls off easily, an accidental loss waiting to happen, pressing  two buttons simultaneously to turn off doesn't work ,tried this up to twenty times, it looks and feels cheap also camera looks like an afterthought stuck on the corner, attempting to turn this pile of junk off ended up dropping it less than two feet dented the side and cracked screen,  had this tablet two weeks,  on contract through three mobile  will never touch Samsung products again as I recently got Samsung Galaxy S10 lite and that looks and feels cheap , I also have a Samsung nine note I think is a good phone and the S 8 before that was brilliant,Samsung seems to have gone backwards and the quality has gone will never touch Samsung products again....",
            "Very excellent tablet, big screen, a good pen for writing.\nOverall you guys did great  in producing such a powerful tablet.",
            "The tablet is really really good, the screen is fantastic, sharp and vivid and the 120hz refresh rate is stunning, it makes everything thing so smooth in operation.\nThe only downside is that the Mystic Bronze is really not as advertised, in reality it is more of a pink rose gold and I have to say that was quite disappointing as the images online and even on the box made it look much darker. It will have to live in a case to cover it up!",
            "Having owned a Tab S2 for five years, I finally decided to upgrade and honestly, I couldn't be happier!\nThe vibrance of the colours, smoothness of the video and depth of the sound... Wow!\nThe only disappointment is that the cases weren't available at launch - a missed sales opportunity and a tad silly.",
            "Arrived with a damaged s pen with a sharp plastic edge. \n\nFelt very fragile, the case is a waste of money no protection. magnetic hold isnt strong enough. I would definitely not recommended the case if you do buy this tablet.",
            "Enjoy it, works gud (☞ ͡° ͜ʖ ͡°)☞ ​​​​​​​​ ​​​​​​​​ ​​​​​​​​ ​​​​​​​​",
            "Its mighty quick with a smooth delivery. Fantastic quality screen picture. Brill !!!!",
            "It's actually severely disappointing that the keyboard case is never in stock. The main reason people buy this tablet is so they can use it as a laptop replacement but without the keyboard case which is never in stock they cannot and end up wasting money on a tablet.",
            "Cool,nice size,S pen features great,apps cool too.enjoying samsung tab s7+ oneui 2.5..upgraded from tab s4 which is still a great galaxy use as second galaxy..",
            "This is without doubt to best tablet I have owned. The screen is brilliant with sharp crisp colours and sound that is clear with plenty of volume. Battery life is good although I do tend to turn it off if I am not going to use it for a while.",
            "The screen is like seeing with brand new eyes, never seen anything so clear and vibrant before and I am a total tech nut. S pen is fabulous, I am an artist and have used many graphics tablets in my time and this is up there with the best. Fast and responsive in all areas so far. Don't be put off by the price tag it is worth every penny and more, just buy one.",
            "Loved my Samsung S2 tablet but love this even more\nEasy to use,\nGreat quality pictures",
            "I have discovered Samsung Dec to use my tablet as a laptop",
            "Unfortunately, I am NOT the proud owner of a S7+ tablet anymore as had to.send it back after 2 days as it kept freezing and then restarting itself. \nI would love to have got to use the tablet to its full potential but alas it was not.meant to be.  I can't justify spending so much money on a tablet if it turns out to be faulty.\nTruly gutted as was really looking forward to it.",
            "I've owned a few tablets in my time , so have an idea of what to expect.  The Samsung is the most expensive I've bought to date , and while picture?and sound are fine, (excellent speakers) the whole package is let down badly by poor battery life....Im not using this for business , but for entertainment , and do not do much multitasking , and I still find whether its music or films , the battery is discharging way too quickly !  For the high asking price , I expected way better!!",
            "I knew this tablet was going to empress me as I have used a Samsung note 10.1 tablet for many years and loved it.. But I was not expecting the new tablet to be so closed to perfect.. I absolutely love the pen, its literally amazing.. and the screen is beautiful.  Most amazing is the efficiency of the tablet, I have been editing my holiday video's and drawing and writing on it non stop.. last thing to add is the battery which seems to last for days of good use.",
            "Having a Samsung S20 ultra 5g, setting up the Tab S7 plus was a breeze, the tablet replicates the S20 with ease, 4k video brilliant  on the Oled screen.\nOnly 2 snags, can't find my samsung 46mm watch at all, tried everything, have to revert to my S20 for that.\nSnag 2, why have Samsung swapped the volume and power buttons compared to the S20. S20 has on/off below  volume keys and the S7 plus has on/off button above volume keys, why !\nBesides that can comunicate between the 2 with ease, storage via sd card brilliant.\nHaving had an Ipad pro this S7 tab is far superior",
            "Maybe I'm being too harsh but from the outset I should say I love using this and this really is a phenomenal tablet!\n\nIf you're looking at the size I was worried the size would be too much but the 12.4 inch was perfect, big but not too big.\n\nThe screen as other reviews say blows anything else I have out the water. At times I now prefer to use this tablet rather than watch things on my tv.\n\nThe only reason I can't give it 5 stars is simply the software. At times things are just not right for a tablet experience, scaling in particular going from landscape to portrait throws everything. In general as well there's only specific apps which can be optimised.\n\nNothing there however is Samsung's fault and it's not a deal breaker for me and is easily manageable. For me they have easily constructed the best table in the world and once the software comes together it would be perfect. \n\nStill a joy to use and I'd recommend it to anyone except the ultra particular.",
            "Having upgraded from a tab S4 to the tab s7 plus it's so much better! Larger screen, in display fingerprint reader and it's lightning fast! Even faster than my galaxy S20 ultra 5g. It's let down by being supplied with a 15w charger in the box. Luckily I have the 45w charger which is rapid with this.",
            "The tablet itself is fine . Does everything id have expected of it really. But the lack of option a keyboard/cover stand really let's the experience down as I have to hold it all the time. So defaulted back to ipad sadly.",
            "As someone with no experience of tablets I'm having a really nice time with this one, I am a long time customer of Samsung and like to waste a bit of money on a new flagship phone once a year. I love how I can connect them both together so seamlessly - its perfect for what I want it for which is mostly completing uni assignments on Microsoft word and doing research etc. And also for streaming and gaming which I do in my own time \n\nAll in all it works really well for me, the only thing is I feel like the pen charging is a poor design as the magnet is not as strong as I would like, as I haven't got a case yet it is easy to lose the pen!\n\nCant wait to try the keyboard case when I can get my hands on it!",
            "Great features and value for the price \ncolourful display",
            "Excellent tablet being the 12.4 size great features apart from where they have placed the s pen.It should have been put somewhere so it would not impede the excellent style of the tablet also not being able to put it down without it coming away from the magnetized area.",
            "My first real tablet an not phablet...am so far very impressed..give it 4.5 stars as so far have only used for media music video streaming. As am waiting for pre order gamer pack so can not honestly comment about that but can not wait to try it out ...just received my keyboard cover which now gives the tablet laptop feel which am really impressed with and am enjoying getting to grips with it and also dex the pen flap big thumbs up as was worried about loosing it..love the bigger pen than my note 20ultra works great and the drawing experience on art apps is 5 star.. build  .feel. looks is 5 star camera also..overall am glad I waited a few wks to pre order and also didn't go with the rival equivalent offering .thanks all at samsung for the great devices over many years an hopefully many more to come .\nSorry for the honest 4.5 star score but I'm shore once I've tried the gaming experience it will rise to 5 plus star rating \nYours thankfully and happy customer...",
            "Picture quality is amazing, music sounds great as well and Gaming is very good.  When I need to do office work I prefer to Bluetooth to a keyboard but you don't have to.  Half of the house is Apple and the other half Android and they all think it's brilliant, they can't keep their hands off it.",
            "I bought this to replace a Tab S4. I was never that won over by the S4 but this is superb - the screen is fantastic, the integration with other Samsung products is excellent, it is fast and performs well, Dex is great -- really good. Not quite a replacement for my laptop (because not all the software I use will run on it) but very close. Only two faults. First, the S pen would get lost easily without a case. Second, the keyboard case (which I haven't bought) is expensive, too much so given the tablet itself is pretty pricey. But, overall, an excellent tablet and a great purchase.",
            "After having this tablet for a few weeks, I can come to the conclusion that this is by far my favourite place to watch movies. HDR content is truly stunning and the AKG quad speakers are so much better than I could have ever hoped  for. \nThis is also a fantastic place to play games and the latest chipset from snapdragon has allowed me to emulate and play gamecube games in much higher resolution than I thought possible. \nUsing the included Spen really makes interactions with the beautiful display a breeze, the included gestures help me to screenshot and create fun little notes to send to my friends. \nTab S7+ has one of the most elegant in hand feels I have had for any device, being super thing while still feeling solid.",
            "this tablet is outstanding in build quality, its a massive upgrade from my original tab s 10.5 form many moons ago, but the screen is simply stunning and at 12.4 inch is amazing for viewing media content, and it seems like a work horse, keep up the good work Samsung.",
            "I have always preferred Samsung tablets to Ipads.\nThe latest, Galaxy S7plus, which I have had for nearly 3 weeks is brilliant.\nGreat screen, great build quality, great everything really.",
            "I have owned all the tab s tables and the tab s6 was my daily device. The S7+ takes the best of last years tablet and gives me a bigger and better screen. Not to say how good wireless Dex is.. 10 out of 10... Looking forward to another 365 plus productive day's.",
            "I like the screen size, the pen and the performance. The volume control seems to be back to front (you increase the volume by pressing the left button)\nCompared to a similar ipad the Samsung is much better.",
            "Just love this new S7+ especially the larger screen which I find is crisp clear.  I have not yet gone through all the features that there is to try but what I have treated very good.\n\nMy only gripe is I got the Samsung cover and when fitted protrudes ever slightly above the volume buttons which are nearly flush with the top of the frame so making adjusting volume little hard.",
            "I like the most of this tablet cos of screen(crispy clear deep bright eye catching colours) and capability of multitask without any slow down, got also lots of features like gesture with pencil, (when spotify music is on, press pencil button once, pause the song, press twice skip the song to next of your playlist) all the same time u using yout tablet for browsing or facebook or just painting etc so it's pretty cool.also handle any latest game with all settings on ultra, the processor does job pretty well, camera is just about right,(snap a selfie with pencil is pretty cool), tablet is even the big size very comfortable to hold and it's also slim  and light even with book cover i got with it,all so far good and am happy with purchase a lot, thanks",
            "This tablet is the best one yet I have had it for a week and everything is good about it definitely recommend",
            "The Tab S7+ is perfect for watching videos, streams and live feeds. It also has very impressive sound quality, putting most of my laptops to shame.\nMainly using it for university, the screen size has been perfect for writing down notes from lectures, with Samung DeX perfect for the Microsoft office package. DeX has been a very solid addition to the tablet, setting it apart from like devices on the market.\nThe Tab S7+ has been very useful over the time I have had it from launch, I dont think I'll be looking for any replacement for several years to come.",
            "Fast processor,  good pen, great graphics. Slightly annoying survey.",
            "The screen quality of the S7+ is unreal , the extra size and super bright colours make it like a portable cimema .",
            "Galaxy Tab S7+ Review. \n\nThe Galaxy Tab S7+ is a fantastic device, has one of the best screens I have seen on a tablet and the sound is amazing, I sometimes think I have surround sound, so its great for watching movies. The spen is amazing as always, being someone who currently has a note 10+ I wanted somthing with a bigger screen and a spen so this tablet was just what I wanted. I would normally go for the colour black however I chose the bronze edition instead, and I am so glad I did! The colour is amazing, and very premium, along with the build, i am loving the squared off edges. It is also a great device for the xcloud service from Microsoft xbox which I have been testing, so far its been great just to connect my controller to the tablet and play wherever I am. Tha batter life has lasted me a couple of days which is also great. The finger print sensor has also improved from my note 10, it works so much better. \n\nNow my only downfall is I ordered the device one day after preorder so missed the chance to claim for the keyboard book cover which I am gutted about....any chance for a free one to be sent out? ;) :D",
            "Get a case one isnt included, nice the pen is included",
            "When I first saw it in person at the store, I was impressed by its design and build quality! The music black is stunning! \"Matching\" mystic gold Note. This is an awesome tablet. Very thin, light, the largest is not huge. Being a tablet creative, more than pc -although I need computing, it is a great value. \nSamsung bring back the creative focus of the tablet through marketing. \nThis is hands down the best Wacom tablet replacement on the go. I love my Wacom. With S7+ you made my dreams come true to have a portable tablet. The N20 is my absolute dream of pocket graphic tablet... \nThank you, the tablet should have 12gb Ram to be a top dog. I don't get why it had less than the Note. Please why can't Europe choose between both processors? \nS Pen is fabulous for business, writing, sketching, noting, creativity, Art, drawing, painting, using the tablet for me precision than the finger with creative apps. \nSamsung... It is time for you to bring Procreate to the S7+\nYo! Do your thing and get us exclusivity.\nI like Sketchbook too, but Procreate is all you need for all. \nThank you!!!❤",
            "Thank you Samsung for the nice tablet I hope hes got more ram 6gb ram not  Enough",
            "When I first received the Tab 7+ I was very excited. THIS IS MY FIRST TABLET... ever!\nI was happy to pay a Premium price for a premium device. I did pre-order but soon after I was disappointed. First thing I noticed was before even I did the pre-order - The Keyboard cover! I did not expect for the cover to come with the tablet (even though I was hoping it does for the price that you pay), not only that you can't claim it as a pre-order bonus... you can't even buy it! That's it! Why advertise the tablet with the cover if it is not even available for purchase upon the tab release! It was not available during the pre-order but also it is not available til this day!? \nUpon unpacking the tablet I noticed that it doesn't have 3.5 headphone jack. And I understand as this is the trend right now and also they are trying to push the Galaxy Buds but you don't even receive the Type-C to 3.5mm Adapter! NO! You have to buy that separately! \nThe other negative thing I have to mention is the pen. And not the pen itself but the \"position\" of it. It stay attached to the back of the tablet by magnet and it's very easy to loose it. If you are laying bed or on the couch and simply pull the tablet closer to you - that is enough to disconnect the pen.\nThe sound quality is also very low in mine opinion.\nYes the display is beautiful, with vivid colors and high resolution but it is a very heavy device. I could only hold it in my hand for a minute before I need to place it down!\nI also don't like the apps grid! There is a lot of space left between the apps. I wish I could fit more apps on one page! Some apps are also not optimized for tablet use like some games and Instagram where you can't use them in landscape mode!",
            "Stunning screen on 12.4 s7+ and has 5g as well ,quad speakers are excellent, a must buy .samsung galaxy s7+ 5g. (This tablet will kill off the ipad pro 12.9)",
            "I am switching from being a lifelong iPad person to this galaxy tab, I love the OLED screen, so much better than the iPad Pro, the battery life is better, its thinner and lighter, and you get pre-order bonus than Apple would never do.\nI prefer the 16:10 aspect ratio, Amazon Video and Netflix are a pleasure to watch on this screen and Dolby Atmos through quad speakers. I also bought the Buds Live and they work very well with this tablet, no lip sync issues, and very good bass, with the most comfortable fit ever."
        ]
    }
}