{
    "931/2562": {
        "remotekey": [
            "931/2562"
        ],
        "item_category": [
            "Lenovo Smart Tab M10 FHD Plus comes with the standout metal design, premium look and feel with modern simplicity. Inside lies a 10.3inch FHD screen and dual speakers for immersive entertainment. When your device is idle, put it onto the Smart Charging Station and transform it into a smart screen, hands-free and with immersive visuals. You can manage your daily information, choose music and even control smart devices in your home - all via voice control using Google Assistant Ambient Mode. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "38 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "81%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "1",
            "1",
            "2",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "13 April 2021",
            "10 April 2021",
            "4 February 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "26 January 2021",
            "26 January 2021",
            "26 January 2021",
            "20 January 2021",
            "19 January 2021",
            "19 January 2021",
            "14 January 2021",
            "13 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "2 December 2020",
            "2 December 2020",
            "1 December 2020",
            "27 October 2020",
            "21 October 2020",
            "21 October 2020",
            "20 October 2020",
            "14 October 2020",
            "14 October 2020",
            "13 October 2020",
            "7 October 2020",
            "7 October 2020",
            "6 October 2020",
            "6 October 2020",
            "2 October 2020",
            "1 October 2020",
            "29 September 2020",
            "22 September 2020",
            "22 September 2020",
            "22 September 2020",
            "8 September 2020"
        ],
        "review_title": [
            "Battery drains quite quickly & abit slow in genera",
            "My lenovo m10 tablet was easy to set up",
            "Lenovo tablet, very good so far",
            "This Tab is nice,smooth and reliable",
            "very basic tablet",
            "looks good and easy to set up",
            "Lenovo M10 Plus",
            "Brilliant tablet",
            "Bought as a present ,seems to like it",
            "Fantastic",
            "OK basic Tablet",
            "Tab par excellence",
            "Freezing tablet",
            "Not impressed",
            "Mr",
            "There was a cover in the box with the table",
            "Tablet great but don’t",
            "Great product at a good price.",
            "Keep clear",
            "The Lenovo M10 plus is everything it says and more",
            "Updated my lap top to Ipad",
            "Great value",
            "Lenovo",
            "Nice piece of kit!",
            "Very happy with it",
            "Easy to use.",
            "",
            "Slim and portable.",
            "",
            "Lenovo",
            "Lenovo tab",
            "A great Lenovo Tablet",
            "Tablet.",
            "Handy little tablet",
            "great tab",
            "Lenovo m10",
            "Excellent value",
            "Fantastic product"
        ],
        "review_text": [
            "Tablet itself slow, battery drains quite quick. Will charge it over night leave it off charge during the day whilst at work come home and it will be on approximately 60-50%",
            "I have always had the Samsung tablet but this time I got the lenovo m10 . It looks great easy to set up and the battery lasts for days love it .",
            "Very good processor for the price, I should have bought the one with more memory, but this is alright so far",
            "I bought it almost 3 weeks ago for my daughter and so far its running smoothly and nicely.no problem at all.comes with two chargers..a good purchase",
            "limited app compatibility",
            "Nice big screen and easy to set up. I bought this to upgrade my current smaller Lenovo tablet, I use it mainly to browse and read when i go to bed. The inclusion of the docking station is brilliant and I can place it in the docking station prior to going to sleep. The cover has to be removed prior to charging but apart from that its an excellent tablet",
            "I have had several Lenovo products over a number of years and found them to be well made. This tablet works well and happily sits on the charging dock always ready to be used. It comes with version 9 of Android and updates to version 10 once connected to the internet. It's performance is quick and so far no issues. The build quality is good to so for the tablet and docking station I'm very pleased.",
            "An excellent product... Great display and great sound. Would highly recommend this product best tablet I have owned",
            "Granddaughter seems to be enjoying using it nanbabs",
            "Its awesome its allowed my daughter to continue online learning with my grandson and her studies as she is doing a further education course",
            "Wish I'd saved my money for another brand. Its OK for basic things like email, fb ect. Games are very laggy to the point I removed them all which gutted about. \nLove the Dock its brilliant when video calling or when kids are watching videos.",
            "Excellent tab for online classes... good investment during COVID times",
            "Easy set up. Keeps freezing all the time. When it does work, I like it. Customer services are ok, but not brilliant. I would take it back, but Argos make returns extremely complicated, due to Covid. If you could get one, that does not freeze, I would say that it's a good machine. Docking station useful.",
            "Plugged it into charge once it was all set up - charging it drained the existing charge in the tablet?!?!",
            "I'm not happy this time because I bought the tablet and Mass offered a gift cover but if I gave a cover larger than the tablet I do not understand why you gave more",
            "The cover is incompatible with the tablet disappointing",
            "Don’t buy with the case and screen protector as advertised by Argos as they do not fit they are too big",
            "Ordered click and collect same day. No problem. My purchase was available to collect at the designated time. Would definitely use click and collect again.",
            "Tablet keeps crashing should have chosen Samsung",
            "If you want a great gift for someone buy this! The tablet is easy to master and the docking station is so simple to use. Wish I had had one before.",
            "So far so good ...easy to set up from my Google account.(even for me) I would recommend.",
            "Very clear visuals and audio!",
            "Lenovo it is one the best brand in terms of quality product,design,affordable and long battery life.",
            "The tablet itself is excellent and no complaints.\nThe charging dock appears to hold the tablet at its charge level so it’s only use is as a stand. \n\nExcited when I opened the box to see a case and screen protector but both are too big for the tablet. \n\nThat being said I love the tablet itself and the items itself if they fit would have been great. One star deduction is for the dock as I don’t think it’s particularly useful based on the above.",
            "It has worked much better than I was expecting, would definitely recommend it",
            "I like Lenovo products.  I have a Lenovo laptop and this is my 2nd tablet.",
            "Very good product, I recommend !!!",
            "Great tablet.\nEasy to set up. \nFab for watching YouTube. \nDownloading movies and watching \nIn FHD. \nAudio loud and clear",
            "Very good product. Does everything you expect.",
            "The price was right come on down",
            "This tab is very poor I had nothing but problems with it I've since returned this item and swapped for a different tablet",
            "Nice design and good picture quality. Zoom meetings are a pleasure and the picture at the 'other end' is of good standard. A worthy tablet and built in charger/stand.",
            "Brilliant bit of kit. Runs smoothly and a fast charge time. The extra charging stand is convenient.",
            "Handy little table and a good idea with the charging dock making it more versatile for reading or copying notes. Very easy to link other devices via blue-tooth or wi-fi such as printers if required.",
            "bought this tablet for my wife, she loves it,1 down side it came with wrong case other than that brilliant",
            "Very happy with the tablet only problem was the tablet case to big",
            "Fast with great display . Supplied case doesn't fit and Argos doesn't stock one that does ? Otherwise brilliant package .",
            "This lenovo product is brill just what I needed well worth the money"
        ]
    }
}