{
    "934/8880": {
        "remotekey": [
            "934/8880"
        ],
        "item_category": [
            "The HUAWEI MediaPad T5 is an eye-catching tablet with a premium, refined design. Its symmetrical metal body is crafted with care and is sleek and lightweight, enough to be conveniently portable and easy to hold. The HUAWEI MediaPad T5 comes with a stunning 10.1\" display (1920 X 1200 resolution) that delivers excellent detail. The 16:10 aspect ratio makes it perfect for watching movies or TV shows and browsing websites. Dual speakers produce high-quality, robust audio for your favourite music. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "10 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2"
        ],
        "review_date": [
            "4 August 2021",
            "4 August 2021",
            "4 August 2021",
            "30 July 2021",
            "30 July 2021",
            "9 June 2021",
            "8 June 2021",
            "19 May 2021",
            "19 May 2021",
            "4 May 2021"
        ],
        "review_title": [
            "Amazing tablet",
            "Good value easy to use tablet",
            "technophobe friendly",
            "Very good quality product",
            "Excellent tablet for value",
            "Great product",
            "Perfect glad I got it.",
            "Good battery life and fast",
            "Huawei media pad t5",
            "Slow. Crashes. Disconnects. Got a refund"
        ],
        "review_text": [
            "The graphics on this tablet are amazing. I couldn't be happier. The perfect addition to go with my Huawei phone",
            "I have found the tablet nice and enjoyable to use. Good battery life. Lovely sharp screen image.",
            "I bought this for the technophobe wife and she has mastered reading her books and watching videos. very easy to set up and use",
            "I perches this to replace an existing one this is perfect compared to the other one very please with the product",
            "Brought as a gift for my mother who's buzzing with it great size easy to use can not be more pleased with purchase",
            "I bought this tablet for my daughter and she absolutely loves it.",
            "I bought this on impolse glad I did worth the money would recommend this .",
            "I bought it for my 12 years old daughter its brilliant and she loves it",
            "Absolutely amazing tablet 100% recommend people buy it",
            "My dad always used to tell me \"you get what you pay for\" and unfortunately I paid for a low budget tablet and got a low quality product. Whilst aesthetically pleasing that's where it stops. I used it for 2 hours, the tablet disconnected and crashed frequently. Response times were also very slow and I became despondent quickly. Took it back to Argos for a refund. If you're after a budget tablet steer clear of this and go for a Lenovo if you cannot afford the extra for a decent mid range slate."
        ]
    }
}