{
    "896/1323": {
        "remotekey": [
            "896/1323"
        ],
        "item_category": [
            "Live every moment with the ultra-handy 7 inch Alba tablet in black. Designed with a bright IPS screen and easy to navigate display, this palm-sized device is perfect for keeping the little ones entertained. There's even a parental control app, so you can be rest assured knowing they're safe from adult content. With front and rear cameras, take photos in an instant and enjoy storage of up to 16GB and 64GB with a micro SD card. "
        ],
        "summary_star_rating": [
            "3.2"
        ],
        "no_reviews": [
            "50 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "53%"
        ],
        "review_rating": [
            "4",
            "1",
            "5",
            "5",
            "3",
            "5",
            "1",
            "2",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "3",
            "4",
            "1",
            "2",
            "4",
            "3",
            "1",
            "3",
            "5",
            "5",
            "4",
            "5",
            "1",
            "1",
            "2",
            "2",
            "4",
            "5",
            "4",
            "3",
            "5",
            "1",
            "1",
            "5",
            "3",
            "5",
            "4",
            "3",
            "4",
            "5",
            "2"
        ],
        "review_date": [
            "5 August 2021",
            "4 August 2021",
            "4 August 2021",
            "3 August 2021",
            "31 July 2021",
            "31 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "21 July 2021",
            "2 June 2021",
            "2 June 2021",
            "2 June 2021",
            "22 May 2021",
            "19 May 2021",
            "5 May 2021",
            "5 May 2021",
            "5 May 2021",
            "4 May 2021",
            "26 April 2021",
            "21 April 2021",
            "21 April 2021",
            "20 April 2021",
            "20 April 2021",
            "19 April 2021",
            "15 April 2021",
            "14 April 2021",
            "13 April 2021",
            "9 April 2021",
            "4 April 2021",
            "1 April 2021",
            "31 March 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "30 March 2021",
            "26 March 2021",
            "25 March 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "23 March 2021",
            "11 March 2021",
            "10 March 2021",
            "28 February 2021",
            "25 February 2021",
            "24 February 2021",
            "23 February 2021",
            "23 February 2021"
        ],
        "review_title": [
            "Good product but a littledifficult to set up",
            "Terrible",
            "great stuff",
            "Epic",
            "Ok for a cheap tablet",
            "Great",
            "Tablet alba7inch",
            "Alba 7inc tablet",
            "Great product",
            "Ok for a child",
            "Super product",
            "Bought 3 and 2 worked",
            "DO NOT BUY",
            "Great product.",
            "Great value for the price",
            "Alba Tablet",
            "Battery life terrible!",
            "Alba tablet",
            "Bad.",
            "Okay for children",
            "Portable",
            "The screen stopped working after 2 days!!!",
            "Very slow had to return",
            "Great tablet for the price .",
            "It's what you'd expect for the price",
            "Waste of money.",
            "Good for money",
            "Did as exactly what it says",
            "Tablet is great for its money.",
            "Alba 7\" Tablet",
            "Great product!",
            "Costs 45 , worth 45",
            "Cheap & Nasty - Avoid!",
            "",
            "Sadly not what we'd hoped for or expected.",
            "",
            "Great for kids",
            "Very good",
            "Good, cheap entry in tablets",
            "Works well as my gaming device and social media",
            "Just poorly made tablet.",
            "Stay away",
            "Just the job",
            "Nice tablet",
            "Cheap and does the job",
            "Very good value for money",
            "An alright budget Tablet",
            "Great value for money",
            "Tablet",
            "Really disappointed with the picture quality"
        ],
        "review_text": [
            "Bought this for my grandson. Excellent product once we had managed to set it up",
            "Bought 2 of these 2 weeks ago, have now had to return both because the screen stopped working and we couldn't turn it on. Definitely won't be buying again",
            "i bought this around one month for my girls and them very happy for this tablet",
            "Am extremely happy with my purchase",
            "Seems fine since it's the cheapest tablet on the market",
            "I bought this for my son and it easy to use and is nice lightweight for long trips",
            "Not very happy with this tablet it's brush.",
            "I was not happy with purchase the tablet was running very slow but you get what you pay for .\nIf you want a good fast tablet do not buy this one as you will be waste your money save your money and buy another",
            "I month this product over 1 month ago and I love it its good for games etc",
            "I bought it for my son hes had 2 before and broke the screen on one and the charging point on the other but the software is adequate for a child",
            "Extremely happy with Alba 7inch Tablet. Very reliable product.",
            "I bought 3 of these 2 weeks ago to entertain my children. On the second use Google services framework stopped working, making it useless.\nPlanning to get a refund as its very disappointing. \nNo problems with the other 2, work perfectly",
            "The tablet keeps disconnecting from wi fi , the screen is so bad  to be honest my eyes started to hurt and the viewing angle are bad I dont recommend this tablet if it's for a child it's okay because there not going to worry about the angles  but for the same price I think u should get the Alba 7 inch tablet THE ORIGINAL. NOT THE HD",
            "I bought 2 of this a month ago for my little cousin. It came with 2 free cases each and that is amazing for the price . The table is a good choice if you are looking to buy it for kids. Don’t miss out on this deal.",
            "Takes great photos great color and it fits in my bag thank you",
            "Terrible, lots of problem blemish with using very slow that’s why I returned it",
            "Unfortunately the battery life is very poor. The tablet has also stopped working completely after 4 weeks of use. Will be returning. Usually buy the Huawei Mediapads, will be returning to a brand we trust.",
            "This is about 5th tablet I've bought in 3 years, they freeze after a while so I put up with them but this one was freezing and is now functioning straightaway",
            "Slow and unresponsive.",
            "Brought this for our little boy to just watch YouTube Kids on. Crashed a few times when we first downloaded the app but seems okay since. Battery life isn’t that great, and find that if the charger is at a certain angle it stops charging the tablet. It’s okay for our child to watch for a short while but I wouldn’t purchase it if you intend to spend lots of time on it.",
            "My daughter likes it and it comes with 2 back cases",
            "Bought for my little boy on his birthday it stopped working after 2 days I've contacted Argos but no one bothered to ge back to me",
            "Very slow tablet not really worth it",
            "Great tablet for the price . Provides all the things needed.",
            "It's the cheapest tablet available, so it was never going to be amazing. However, for the price it does the job of being a tablet. If you want a basic device then it's fine for the price, but if you want something that will perform well I'd recommend spending a little extra for a higher spec tablet.",
            "Terrible, don't waste your money on it, very slow and my other devices are fine.",
            "The tablets is worth the money you pay.\nSlows down, but is good for toddlers.",
            "Great for the price and ideal what I wanted it for",
            "The tablet is great for its money so cheap and does what it needs to do xxx",
            "Bought the 10\" for my eldest grandaughters & it is great but a bit big for the 3 yr old so opted for the smaller one. It's a little slow at times, battery not brilliant but it does for her to go on her YouTube kids and play some games when she's here. She loves her tablet, even comes with it's own rubber case which is great as you can't find them anywhere else. I would definitely recommend for the younger ones.",
            "The perfect tablet for someone who just wants something simple. Great for browsing online, and easy to use if you're not very technically minded.",
            "Blocks every time the screen gets a bit dirty. Needs restarted few times a day",
            "I'm afraid this is too cheap to be any good. The screen is really bad and hard to look at from any angle. Without installing any apps it struggles to run its OS and is laggy and crashes all the time.\n\nI would really urge anyone thinking of purchasing a tablet to invest a little more and go for anything apart from this.\n\nI have to be fair to Argos and commend them for their fantastic service in dealing with the return. I have purchased a replacement from them and they have been great.",
            "This product is extremely slow you can’t do anything without having to turn it off an on again. It comes with 2 cases but it charges a bit quickly. Even if you have internet it acts like you don’t. I wouldn’t recommend this product.",
            "Sadly a negative feedback from me. Certain apps permissions (Display over other apps for example) are disabled & cannot be adjusted, The backlit screen has colour distortion make viewing VERY painful/eyestrain bad. Of the 3 units purchased 15/3/21, sad to say NONE work correctly. Charging 2hrs+ for 2-4hr use even in dark mode reading a text file or in standby! Touch sensitivity intermittent clicking when not trying to, or freezes and becomes unresponsive. A shame as previous models are awesome.",
            "Cheap and easy tablet value for money.",
            "Bought for my babies first birthday as she likes to watch videos.\n\nThis is a good little basic tablet that seems sturdy and the right size for my daughter to be entertained and have a little bit of independence in touching the screen",
            "My 5 year old loves it",
            "Small, light and easy to use. It's not going to compare to the likes of Samsung etc, but pretty good value for the price!",
            "Works well for my social media needs and gaming services I'm well impressed would highly recommend for on the go gaming",
            "Just a poorly made and lagging tablet with poor and quote \"HD\" display. \n\nDisappointed with the manufacturer and Argos for selling it.",
            "Please don't waste your time and money on buying this. We bought this and it has so many major technical failures, I will be returning it as soon as Argos change their store return policy.",
            "Perfect tablet for the price. It works perfectly for our needs.",
            "Nice little tablet but has problems with Google games the main reason I got it but overall it is a nice item",
            "Bout this as a emergency replacement for home schooling as tablet we had broke. Had no problems with it did everything we needed it to do.",
            "Budget tablet for young children. My 7-year-old daughter uses it for gaming and youtube. Display, performance and battery life are all reasonable for the price.",
            "First 2-3 days I wasn't sure bout the tablet as I was quite disappointed with the performance and the screen as well as the touch screen response. But, later on the performance slightly improved and I was like \"I get what I payed for...\". Additionally, this tablet charges rapidly compared to other higher end tablets I've purchased in the past. Moreover, it came with two rubber-made tablet cases: one in red and the other in orange colour .Decent tablet if you're not willing to spend over £60.00.",
            "Bought this tablet for our 4 year old son to play games and watch his favourite programs and movies and thought it would be great to keep him entertained during long car journeys. We bought it to replace his Amazon kids fire tablet which we found to be slow and the volume was too quiet. This tablet is great value for money, especially for kids when you don’t want to pay for an expensive tablet. It’s fast, charges quick and the sound is great. The only downside is the picture quality.",
            "Easy to use\nReasonabley priced\nFast charging",
            "No matter how we alter the colour/ contrast/brightness the picture quality has a haze that is very poor. When you tilt the screen the picture quality goes from bad to worse depending on the angel you have the devise. I would of spent a bit more money if I had known it would be like this. But reviews didn’t mention this!"
        ]
    }
}