{
    "834/5073": {
        "remotekey": [
            "834/5073"
        ],
        "item_category": [
            "Whether it's mastering the art of multitasking or keeping yourself entertained, the slim and portable Galaxy Tab A7 has got you covered. With a stunning 10.4 display and Quad Stereo Sound, you can lose yourself in the latest blockbuster and listen to your favourite tracks. It's super light and sits evenly on any surface, so you can take it anywhere. And with a long lasting battery, you can play all day and then some. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "12 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "83%"
        ],
        "review_rating": [
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5"
        ],
        "review_date": [
            "4 August 2021",
            "14 April 2021",
            "7 March 2021",
            "17 February 2021",
            "19 January 2021",
            "13 January 2021",
            "5 January 2021",
            "1 December 2020",
            "18 November 2020",
            "21 October 2020",
            "13 October 2020",
            "6 October 2020"
        ],
        "review_title": [
            "Very Capable device",
            "Doesn't play basic videos",
            "Superb Tablet",
            "Very nice",
            "Nice bit of kit",
            "Mr",
            "Samsung A7",
            "Perfect",
            "The Samsung tablet looks good and works great",
            "keeps the wife quiet",
            "not free",
            ""
        ],
        "review_text": [
            "This tablet has a great screen, good battery and does everything I need, watching movies, YouTube and shopping.  My only complaint is it feels a tiny bit slower than expected but far faster than any if the fire tablets. Well worth the price.",
            "I buy Samsung products. But this is terrible. It can't play itv player loads of delays. No solution or fix from Samsung. Don't buy this. Many consumers have said video playback is an issue.",
            "I bought this tablet as a companion for my Samsung phone. Very happy as I always am with Samsung products, the only disappointment is, there's no fingerprint sensor on the back of the tablet like the phone.",
            "Good for children. Fair money",
            "Pleased with tablet and a nice screen size. Easy to set up.",
            "I want to buy it to get all things I want am 12 is old am boy and done.",
            "Great mid range tab, worth spending extra for more storage, space. Overall a great gadget.",
            "Perfect for my son he is very happy thanks Argos always great service very happy costumer",
            "The tablet was easy to use.",
            "bought this as a birthday present and it couldn't have been a better choice. wife is absolutely delighted. samsung really is a quality product.",
            "its not free that means its trash ugh such a stupid tablet tab s7 is so better",
            "Good for kids school and gaming. Very pleased with it"
        ]
    }
}