{
    "918/3595": {
        "remotekey": [
            "918/3595"
        ],
        "item_category": [
            "Lenovo Tab M10 HD is a 2nd-generation 10.1-inch HD tablet that packs a wallop while sporting a premium metal look and feel. A great device that offers top-notch visual and audio, it's also built for families, featuring curated kid's content, parental controls. "
        ],
        "summary_star_rating": [
            "4.2"
        ],
        "no_reviews": [
            "10 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "4",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "30 July 2021",
            "1 April 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "24 March 2021",
            "17 March 2021",
            "10 March 2021"
        ],
        "review_title": [
            "Great Pad",
            "Efficient",
            "Gift for hubby",
            "Lenova tablet",
            "Big value for money",
            "Good tablet just a shame the dont take sim cards",
            "Review",
            "Limited functions, not happy",
            "Nice lightweight tablet, great value",
            "Great tablet"
        ],
        "review_text": [
            "I bought this Levono for my wife for her 80th birthday she loves it. She finds it a lot more easer to manage than her Kindle Fire.",
            "Good value for the price",
            "Bought this as a replacement for ancient Hudl which was running really slowly. Mainly used for emails and youtube music videos. Just the job for that, very happy",
            "Works well does everything I want it for and misses is happy as plenty of space for games",
            "Bought it for the kids during lock down and made it kids safe mode, and downloaded loads of educational apps. They love it and kept them busy.\n\nI was close getting a second hand ipad but went for this and good thing I did. \nSound camera and screen quality all perfect.",
            "Good tablet baught for my son",
            "Works great. Good size  good speed",
            "Was very excited, now wish I'd spent more on a Samsung... respect ):",
            "Really pleased with this replacement for my older Lenovo tab which had decided to give up the ghost. The only negative is a very smooth and shiny back, which means it has a tendency to fall onto the floor if you put it down on the arm of a chair!",
            "Decent size, great display, fantastic battery life and responsive operating system, altogether an excellent choice."
        ]
    }
}