{
    "769/9359": {
        "remotekey": [
            "769/9359"
        ],
        "item_category": [
            "With 3 GB RAM, 64GB storage and a powerful quad-core processor, Fire HD 8 Plus delivers a smooth experience whether you're browsing the web or binge-watching your favourite series. Download and stream more with up to 12 hours of mixed-use battery life and up to 1 TB of expandable storage. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "8 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5"
        ],
        "review_date": [
            "16 March 2021",
            "6 January 2021",
            "31 December 2020",
            "3 December 2020",
            "10 November 2020",
            "26 August 2020",
            "25 August 2020",
            "29 July 2020"
        ],
        "review_title": [
            "Good quality tablet",
            "",
            "Reliable and easy to use",
            "just awesome.",
            "My HD plus 8 is a great upgrade on my old model",
            "It looks good and is a good size!",
            "",
            "What I wanted"
        ],
        "review_text": [
            "Impressed fron the outset. Good quality HD providing clear graphucs with good colour balance. Upgrade from 7''Fire which developed charging problems.",
            "More than happy with this product.It does just about all my iPad did.For a third of the price.",
            "Comfortable sized screen making for ease of viewing use. Good battery life. \nLightweight. Fast response between websites (on our in-house wi-fi.) \nA nicely designed product.",
            "i've had a few Kindles and this is definitely my favourite.\nit's more powerful than my previous Kindle's which causes apps to open quicker and run smoother, the 64GB memory has plenty of room for my books, music, and apps, and thanks to it using a USB-C it charges very fast.\nthe battery also lasts longer than in my old Kindles and the ability to add up to an extra Terabyte of storage via an SD-Card is very much appreciated,",
            "Kindle HD plus 8 is a faster than my old one, battery lasts much longer before needing charged, larger screen is a bonus for watching movies etc. Highly recommend.",
            "It’s stylish, has a good screen size and a good battery life.",
            "It seemed like a good tab to have but I have that the audio was very poor. \nOtherwise the tab is okay for it’s price",
            "Works well like size and vesatilaty"
        ]
    }
}