{
    "272/3653": {
        "remotekey": [
            "272/3653"
        ],
        "item_category": [
            "HUAWEI MediaPad M5 lite 10 is a 10.1-inch tablet with a Kirin 659 octa-core processor. The MediaPad M5 lite 10 comes with an IPS screen with a resolution of 1920 x 1200 pixels. Supporting high-speed Internet connectivity, office work, GPS navigation, and other features, the M5 lite 10 functions as a smart assistant and entertainment center. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "108 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "5 May 2021",
            "6 April 2021",
            "31 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "9 March 2021",
            "24 February 2021",
            "23 February 2021",
            "3 February 2021",
            "3 February 2021",
            "3 February 2021",
            "27 January 2021",
            "15 January 2021",
            "12 January 2021",
            "31 December 2020",
            "2 December 2020",
            "1 December 2020",
            "1 December 2020",
            "26 November 2020",
            "26 November 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "11 November 2020",
            "3 November 2020",
            "29 September 2020",
            "27 September 2020",
            "2 September 2020",
            "2 September 2020",
            "26 August 2020",
            "18 August 2020",
            "13 August 2020",
            "6 August 2020",
            "4 August 2020",
            "4 August 2020",
            "29 July 2020",
            "13 July 2020",
            "8 July 2020",
            "8 July 2020",
            "2 July 2020",
            "2 July 2020",
            "1 July 2020",
            "1 July 2020",
            "1 July 2020",
            "1 July 2020",
            "27 June 2020",
            "23 June 2020",
            "17 June 2020",
            "16 June 2020",
            "16 June 2020",
            "16 June 2020",
            "14 June 2020",
            "11 June 2020",
            "10 June 2020",
            "10 June 2020",
            "10 June 2020",
            "9 June 2020",
            "9 June 2020",
            "27 May 2020",
            "27 May 2020",
            "26 May 2020",
            "25 May 2020",
            "15 May 2020",
            "13 May 2020",
            "13 May 2020",
            "8 May 2020",
            "5 May 2020",
            "5 May 2020",
            "5 May 2020",
            "30 April 2020",
            "28 April 2020",
            "28 April 2020",
            "28 April 2020",
            "22 April 2020",
            "22 April 2020",
            "22 April 2020",
            "22 April 2020",
            "16 April 2020",
            "15 April 2020",
            "18 March 2020",
            "14 March 2020",
            "12 March 2020",
            "10 March 2020",
            "4 March 2020",
            "4 March 2020",
            "19 February 2020",
            "19 February 2020",
            "19 February 2020",
            "11 February 2020",
            "5 February 2020",
            "4 February 2020",
            "29 January 2020",
            "26 January 2020",
            "22 January 2020",
            "14 January 2020",
            "9 January 2020",
            "8 January 2020",
            "2 January 2020",
            "28 December 2019",
            "27 December 2019",
            "27 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 November 2019",
            "20 November 2019"
        ],
        "review_title": [
            "Wouldnt buy any other make",
            "Very neat tablet pleasing to the eye",
            "Works a treat",
            "It's a bit slow and keeps freezing",
            "Very easy to handle and operate",
            "Excellent screen and capabilities for this item.",
            "My daughter mediapad",
            "Very stylish",
            "So si happy with my purchase",
            "Fab tablet",
            "Perfect to replace ipad mini",
            "Very good",
            "Good stuff",
            "Easy to use tablet",
            "So easy to use",
            "Fantastic value tablet",
            "Fabulous tablet with full Google Play capability",
            "Nice and sturdy tablet",
            "Great media pad",
            "HUAWEI tablet",
            "Good for the price",
            "Excellent tablet",
            "Easy set up runs quick",
            "Excellent value for money",
            "Such good value",
            "tablet",
            "",
            "Brilliant",
            "My new tablet is great",
            "Great value for money, comes with Google Play.",
            "Looks nice",
            "It’s a great device",
            "Bad item don't west your money to slow",
            "Great Tablet",
            "Its great had the older one just upgraded fantisic",
            "",
            "Table is great",
            "Very light, Good quality sound,Good picture",
            "No Google Play Store. Returned for refund.",
            "A brilliant little 10-1 tablet.",
            "Excellent piece of kit",
            "Excellent performance, screen and sound",
            "Tablet is ace",
            "Great tablet very efficient",
            "Huawei m5 is great",
            "Excellent, just what I was looking for.",
            "Good choice",
            "My new tablet is amazing the graphics and sound is",
            "Lovely tablet and fast working",
            "I love the sleek design of this tablet",
            "amazing great for my son school work on zoom",
            "Great",
            "A great and stylish tablet!",
            "Its  good but has some weak points",
            "Great device. Purchased for busy office work.",
            "Worth the price",
            "Excellent value for money",
            "Great tablet",
            "Looks great",
            "Quality tablet",
            "Super quick, lovely screen, sound and battery life",
            "",
            "Excellent producy",
            "Brilliant",
            "Better than expected",
            "Not a heavy duty tablet",
            "Ideal size",
            "Brilliant Sound and Picture also Fast and Quick Ch",
            "GOOD VALUE",
            "It's fab product",
            "Huawei MediaPad M5",
            "Absolutely Fantastic!",
            "Excellent tablet",
            "Value for money",
            "poor sound",
            "",
            "Great",
            "Be careful !",
            "This tablet is working fine till now ....",
            "Really good speakers",
            "So far so god",
            "My tablet has a beautiful screen with excellent to",
            "Not for gamers",
            "Better than my previous tablet",
            "Good specs",
            "Excellent tablet",
            "I'm very pleased with this media pad...",
            "It's awesome",
            "Great Tablet, fast and reliable.",
            "Good media tablet",
            "Very decent performance for the money",
            "It's amazing and it's really fast loading apps.",
            "Great service",
            "Great tablet. Working vert well.",
            "Patch1",
            "Nice looking tablet",
            "Adequate price for the product.",
            "Tablet is great",
            "Excellent tablet",
            "Good value for money",
            "Good for site work",
            "Quality build",
            "M5 lite 64 gig ram 4 gig rom",
            "Really quick and responsive",
            "Good tablet but very difficult to grasp.",
            "Very sleek android tablet",
            "Tablet is fab",
            "Looks aa it's picture"
        ],
        "review_text": [
            "Upgrade from previous huawei tablet as i needed more storage, absolutely brilliant, wouldnt buy any other make of tablet or phone, argos fantastic as ever, buy most electrical items here",
            "Very neat and very pleasing to the eye. Well made. And light",
            "Already have the 32gb version of the tablet and I wanted another for work so I got the 64gb one just because it had that more space, very happy with it, you can add all your apps you use and live streams no problem.",
            "Keeps stalling and a bit slow running",
            "Very easy to set up ,but can be a bit slippery in your hands best to get a cover ASAP,",
            "Excellent value for money.",
            "I bought this mediapad for my daugters birthday, she was happy she likes it, only little problem that the power button is on down side and sometimes she turn off accidently. All togrther fine, run fast, clever, easy to use.\nThanks",
            "Bought this for my wife's birthday 57 years old. She uses it all the time and ls very pleased with the product. So I'm happy and of course she is",
            "Excellent tablet so responsive , battery is fab to all device users just buy it it's  brill",
            "Great quality tablets for streaming and zoom calls etc, very happy with it",
            "Brought this to replace a mini ipad, and only had it for about 3 weeks, however the improvements are quite noticeable it's big, it's screen is clear, the sound is fantastic from its 4 speakers, perfect replacement, and the added bonus, is I can extend the memory by a further 256gb\nWhat's not to like",
            "It's an excellent device, it fulfilled all my expectation, excellent for games and Netflix! And the best practicality and agility of buying by Argos.",
            "Fast   ,  bright , loud ,thin long lasting....  What more:-)?",
            "Easy to use, clear screen and lightweight storage. Also easy to set up even for the untechnical like me",
            "Bed dance social and able t",
            "So far very pleased with this mediapad, we are basic users so this is not the most professional review. First things realised is an incredible picture and sound, outstanding battery life and we purchased an M-pen to go with it what makes it more fun. Would recommend this pad over the much higher priced tablets.",
            "I've been waiting for nVidia to bring out an upgraded \"Shield\" tablet for years. But it doesn't look like they have any interest in end users... So I thought I'd pick up something from Huawei at the tail end if Android/Google Play support. I am so glad I did - so far it's been buttery smooth and handled everything I've thrown at it.",
            "Bought these as my other product from them have been good. Not tested yet as for Christmas presents",
            "Very fast. Excellent battery. Very good value for money. Would recommend.",
            "Great value for the price. Would recommend this device. The camera and video are of a good spec. Easy to use and set up.",
            "Knows everything I need.",
            "Light portable easy to use.",
            "Bought for partner said it was a bit heavy but good all rounder. Wanted to give half stars but could do it.",
            "Bought this tablet as an early Christmas present for my husband. He's very impressed with the quality. Excellent value for money.",
            "Such a good tablet for such good value. Does everything you need it to",
            "good tablet with many choices of security!\nand good performance",
            "very good for Christmas pr",
            "Very good for every day use, very fast. Ready for pick up immediately. Extremely satisfied with quality. I would strongly recommend.",
            "Great tablet, best one I've used.",
            "It is a great tablet. Feels very premium, great audio that will fill a room and is very rich, very smooth UI with no lags seen from me, the battery life is insane, getting 2 and a half hours screen on time with just 20% battery used (although I do know how to optimise android to get better stats) Fingerprint works 100% of the time. I don't play demanding games but Minecraft plays fine. Kids mode is excellent, they use their own fingerprint which takes them straight to kids mode!",
            "It's nice to use and very fast \n\nBattery life isn't that great but I guess this is far better than my old tablet",
            "Great tablet,Very stylish",
            "Bad item don't west your money to slow",
            "Got this tablet for using on the move, it is great, good screen, works quick, can not think of a fault. Battery lasts three days or so and is best charged up over night as it takes quite a long time to charge.",
            "Fantastic tablet this is the second one just upgraded and it didnt let me downluv it",
            "Great tablet in this price range",
            "easy to use transferred all my stuff with no problems",
            "i like this product, no comments",
            "When first switched on wants you to sign up for Huawei account, no Google. I did not proceed any further but researched on the internet why no Google.\nFound out not available due to USA trade restrictions will not allow Huawei to use Google Playstore, and no chance of installing as Tablet blocks tries.\nAlso beware this is a WiFi only tablet.",
            "A brilliant little 10-1 tablet. \nI love the Huawei brand anyway & they've certainly not disappointed with this tablet, it's packed with loads of tech for it's mid range price, including the fingerprint & face recognition security, it's a really fast tablet & the battery life seems to last for ages. (Regardless of controversy with Huawei & the UK/USA at present) It's a fantastic bit of kit for the price & I definitely recommend it.",
            "High spec low price tablet.\nGreat sound. \nEasy to use. \nI am so glad i conisered this Huawei over Samsung and Apple over price and functionality.",
            "My new mediapad is great. I bought it to replace my broken ipad and is perfect for watching videos on YouTube, prime and Netflix etc. My son uses it for playing games like roblox and hello neighbour.\nIf you have a Microsoft 365 subscription like I have, you can pair it with a Bluetooth keyboard and it's perfect for creating and completing documents whilst out and about. \nI bought the 64gb version and it's worth the extra, plus you can use sd memory cards and cloud storage for extra. Buy it!",
            "Looks Nice and sound is amazing we'll worth getting",
            "This tablet is sleek looks good is very quick and has a very good battery much better than my last one which was a Samsung .this huawei lite M5 which I bought is very good",
            "Huawei M5 media player is ideal for email and Web searches etc. It is also excellent at being a book reader and I have not put it down for long have read four books in the little time I have had it. Would recommend this product as a really good tablet.",
            "Good buy, great service!",
            "Easy to use, quick set up.",
            "No negative needed very pleased with it",
            "Have ad other tablets and this one is lovely. Very tactile and easy to use, does everything I want it to. One of my better buys. No regrets and would recommend to anyone else who wants a lovely handy little tablet to supplement other serious  heavy duty computers.",
            "I bought this tablet as I have the P20 phone and love it.  Love the tablet too.\n\nWould recommend and a great price, 64gb and you can add a micro sd for more storage should you need it.",
            "10 out 10 \ngreat for home learning\nzoom \nand easy for mum to help\nwith and use \nfantastic for zoom chat with \nfriends big screen \nwould recommend top \nbattery life",
            "Great item the sound is the best I've ever heard from the 4 speaker system\nWorth buying just for the film music side of things\nI've run a lot of games haven't come across anything it has struggled with even when I switch graphics to max",
            "I bought this to replace my Amazon Fire HD 10 as I was having trouble using Android apps on it. This tablet boasts a faster processor (but still has 8 cores) and more RAM (a whopping 4GB) plus it has 64GB of storage with the ability to add a cheap SD card for more storage.\nThe tablet is fast and easy to use. It is also great on the battery life as with fair usage, I am only needing to charge it every three days or so.\nAll in all, a great bit of tech!",
            "Happy with the tablet but not fully satisfied.",
            "Superb Android tablet. Being used for commercial purposes with no problems.",
            "I bought it because it was recommended from some artists online to start learning approaching the digital drawing. \nI mainly bought it just for it and it's awesome: no lag, good response with the capacity pen I bought (waiting to receive the M-pen), no complaining so far.\nIf you can't afford a samsung tab or an ipad, this mediapad M5 it's a good compromise, even just buying Meko stylus which is cheaper than the M-pen.",
            "OK so buttons are in a weird place but other than that this tablet is great. Currently in use by both my children aged 9 and 6 - does everything then need from uploading school work to SeeSaw to playing Roblox and watching Netflix. Great sound quality and great picture quality. For the money I don't think there is a better tablet out there. Performes as well as our ipad air 2. There is also a great app for managing kids access, screen time etc.",
            "Top spec and performance is good too, does everything we wanted so why pay more for a Samsung or Apple iPad !!!\nRecommended !!!!",
            "Really user friendly especially if you are used to android operating system",
            "Perfect for what I need it for- streaming",
            "Great tablet, I've used many others but for the money this offers so much. Far better than other brands I've tried and have owned.\n\nScreen quality is very nice and sound is amazing. Can't fault it whatsoever, so fast and easy to use. \n\nAbsolutely Love it :)",
            "Excellent product and worth the money",
            "Excellent value for money, fast and very clear",
            "Fantastic, exactly what I expected, does everything I need. Excellent sound and reasonable cameras for video calls. Would definitely recommend!",
            "Neat little tablet. Picture quality is very good. Excellent sound quality as it has 4 speakers. Runs on all apps.",
            "Although the battery life is very good, this tablet, meant for kids lacks the memory to smoothly one demanding games.",
            "This is the ideal size, works very quick very pleased with product.",
            "Brilliant Sound and Picture also Fast and Quick Charge  Thanks Argos",
            "Very similar to my previous Galaxy, quicker to respond. However there is no back arrow on the keyboard which I find annoying.",
            "Fab product , very fast , nice design.",
            "Excellent tablet and well worth the money, a good rival to the much more expensive Samsung S5/6 and the Ipads.",
            "Absolutely Fantastic. Huawei is a brilliant tablet. So much better than the Samsung version I had before. Its fast and very responsive. The screen has an amazing display and the battery life is really good. Defo recommend 100%",
            "A superb tablet, great battery that lasts a long while for me, terrific performance for my uses but I don't play 3D games so can't comment on how it copes with those. The Google apps and services all work fine, I shall be sorry when Huawei products are no longer allowed to access Google. One small point to note is I believe this product only uses Android 8",
            "It's a good middle range product. A good substitute at home for my mobile phone in listening to music and digital radio as well as news reading. Four speakers with good sound quality. \n64GB version is recommended because it can reach 32GB very soon.",
            "Tablet great for space poor  sound volume from it sturdy tablet good for price at time not now should be more like 100 at most",
            "Fantastic, ordered and picked up next day.",
            "Very pleased with my purchase. Had already decided on this tablet, but confirmed my decision after reading the reviews. It's fast, lots of storage and expandable, lightweight and easy to use. The colours are sharp and clear and it takes acceptable photos. The only critism I would have, is that the on/off and volume buttons are at the bottom of the tablet, in portrait mode, which seems a bit odd to me and not that easy to control. Maybe better when I get used to them. Overall very happy.",
            "It is an excellent tablet. However, do not buy a case which is 10.1 or 10.8 inches as per the model's description as it is only 9.5 inches across. Apparently, the 10.8\" refers to the diagonal, but when buying a case it is measured horizontally left to right. I think the manufacturers for each should speak the same language.",
            "I love this tablet so far I have used it.... battery life is very good....",
            "I couldn't decide which one to get... Good job my brother has this tablet for the last 8 months and he totally recommended it to me. Very happy with the purchase.",
            "Only been using for little over a week. Only had to charge 3 times. Happy with that. Fast and responsive and the fingerprint security works a treat.",
            "Very good product. Beautiful screen with excellent touch control features.",
            "I like the look of the tablet. Its very sleek and has a good graphic. The only downfall is, its not for online gamers like me, which is the sole purpose of why i bought it. It lags sooooo much that you just want to turn it off. So disappointed as i can’t  return it anymore. Shame.",
            "After some research I chose to give this tablet a try following the demise of my previous android tablet. The item arrived quickly and well packed. The tablet was discovered to be well made with a well engineered metal back. A improvement on its predecessor. On switching it on it was discovered to be easy to set up and the screen produced an excellent  colour and brightness level. The face recognition system works well in well lit conditions but has a tendency to struggle.",
            "Good specs in good price",
            "Excellent tablet good value and great performance",
            "Very pleased with this Huawei mediapad...it's faster than my ipad air...and looks really nice....",
            "Looks grate. Works good. Good colours and sound. All family likes it.",
            "After buying a few Tablets this one is the best. It has a nice, heavy feel to it like many 3 times the price. Fast with and excellent screen.\n\nWould buy it again.",
            "The tablet is exactly what the name says, a media tablet. Very nice screen for watching videos or browsing the Internet. It responds fast to commands and the normal day to day aps work just fine. Only if you want to play games with a lot of detail it will only play them on low res, like COD Mobile or Asphalt 9. Overall a really good tablet for the price.",
            "While significantly cheaper than a Samsung 5e the performance is pretty close to it. For a budget of £250 in the Android tablet market I think this is the best option.",
            "I think Huawei are the new apple, if you haven't tried a Huawei device then what are you waiting for because this performance is amazing and I'm very happy with my product.",
            "Slim Design, sharp colors.",
            "So far. No problems. Working very well. Much pleased with my purchase.",
            "Great product. Easy to set up. Easy to use.\nDoes everything I need at the fraction of the cost of a ipad. \nDelivery from argos same delivery was awesome also.",
            "I am very happy with this tablet so far. It has a very clear screen and is easy to use. It appears to be well constructed and the sound is quite adequate for me. I recommend this product.",
            "The tablet is amazing, it works great as a birthday present.  It has very good sound system and a lot of memory.",
            "Well impressed with it 4 speaker sounds great, it is fast on downloads plays the games with out a hitch, the display is nice and clear, deffinetly recommend it to anyone considering in buying this, it is worth the money",
            "Needed a fast tablet for viewing films etc and general day to day things. This tablet is fast. Very fast. There is no lag, or delay when using it. The size is excellent for viewing videos and it has 4 speakers which produce some great sound. I've played a few games on it and again it's superb. Can't really fault it to be honest. Very pleased with my purchase",
            "Very good and the sound is unbelievable.\nRecommended.",
            "Does the job, quick, colourful and light weight \nNeeds additional memory to be useful and nightly charging to last",
            "This pad is excellent it does exactly what I want the looks and build quality are great, it is a great alternative to a more expensive ipad.",
            "Had the Huawei M5 lite 64 gig for 2 weeks..very impressed..fast...easy to set up...suggest you consider the 64 gig model over the 32 gig as it has 4 gig of rom..a gig more...runs a tad faster and smoother...a great little mid price tablet...highly recommended",
            "Bought because I needed something to do college work on as my laptop broke, really good I have a Huawei p20 Pro and it is just like a big version of it, fingerprint scanner is quality at any angle. Screen very good definition and has a good amount of RAM to make it speedy for everything.",
            "This tablet is a great product ,looks really great with good sound volume but very difficult to hold as it is very slippery.\n\nIf you buy this you must get a cover or it won't be long before it slips out of your hands.",
            "Absolutely love this. Bought it as I have an Huawei phone. Great for storage, being a 64 gb. Picture is very sharp. Camera is fab. Tablet is very slim and light. Loads quite quickly too. All in all a great little android tablet. Would highly recommend.",
            "Bought the tablet as a gift as I was sick of replacing iPads for performance very impressed",
            "Boots up very quickly, screen is very clear and colours are very true."
        ]
    }
}