{
    "789/8167": {
        "remotekey": [
            "789/8167"
        ],
        "item_category": [
            "Do more with the Lenovo Smart Tab M8. Combine the portability of a brilliant media tablet with the convenience of a smart home hub. Boasting a modern design and slim profile, this tablet has style. The narrow bezels and premium metal casing, it's the perfect everyday companion. And by attaching it to the Smart Charging Station, you'll unleash its full potential. All you need to do is say the word, and the Google Assistant will put you in full control. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "111 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "97%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "4 August 2021",
            "30 July 2021",
            "30 July 2021",
            "19 May 2021",
            "5 May 2021",
            "14 April 2021",
            "8 April 2021",
            "31 March 2021",
            "31 March 2021",
            "30 March 2021",
            "24 February 2021",
            "23 February 2021",
            "15 February 2021",
            "5 February 2021",
            "28 January 2021",
            "27 January 2021",
            "26 January 2021",
            "21 January 2021",
            "13 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "2 January 2021",
            "1 January 2021",
            "31 December 2020",
            "2 December 2020",
            "26 November 2020",
            "25 November 2020",
            "24 November 2020",
            "23 November 2020",
            "11 November 2020",
            "30 October 2020",
            "28 October 2020",
            "21 October 2020",
            "20 October 2020",
            "16 October 2020",
            "16 October 2020",
            "14 October 2020",
            "14 October 2020",
            "13 October 2020",
            "22 September 2020",
            "15 September 2020",
            "15 September 2020",
            "9 September 2020",
            "20 August 2020",
            "19 August 2020",
            "30 July 2020",
            "22 July 2020",
            "22 July 2020",
            "21 July 2020",
            "21 July 2020",
            "8 July 2020",
            "8 July 2020",
            "2 July 2020",
            "30 June 2020",
            "24 June 2020",
            "16 June 2020",
            "27 May 2020",
            "26 May 2020",
            "20 May 2020",
            "20 May 2020",
            "20 May 2020",
            "20 May 2020",
            "14 May 2020",
            "14 May 2020",
            "14 May 2020",
            "13 May 2020",
            "13 May 2020",
            "13 May 2020",
            "12 May 2020",
            "10 May 2020",
            "7 May 2020",
            "7 May 2020",
            "6 May 2020",
            "5 May 2020",
            "22 April 2020",
            "16 April 2020",
            "14 April 2020",
            "8 April 2020",
            "8 April 2020",
            "8 April 2020",
            "7 April 2020",
            "7 April 2020",
            "3 April 2020",
            "2 April 2020",
            "24 March 2020",
            "24 March 2020",
            "20 March 2020",
            "4 March 2020",
            "4 March 2020",
            "3 March 2020",
            "1 March 2020",
            "27 February 2020",
            "26 February 2020",
            "25 February 2020",
            "25 February 2020",
            "24 February 2020",
            "24 February 2020",
            "23 February 2020",
            "22 February 2020",
            "22 February 2020",
            "22 February 2020",
            "22 February 2020",
            "21 February 2020",
            "19 February 2020",
            "19 February 2020",
            "19 February 2020",
            "18 February 2020",
            "17 February 2020",
            "15 February 2020",
            "15 February 2020"
        ],
        "review_title": [
            "Fabulous for smaller hands!",
            "Really pleased - great gadget for the price",
            "OK for a cheap tablet.",
            "Brilliant.",
            "Nice looking Tab",
            "Lenovo 8in tablet",
            "Excellent",
            "Great",
            "Light and easy to carry.",
            "Perfect for my needs.",
            "Fits the bill",
            "Tablet",
            "Great",
            "Good product for the price",
            "My tablets works fast and efficiently!",
            "great little tab, very quick",
            "One very happy Mum!",
            "Great little tablet",
            "Brilliant for the money",
            "Lenova Smart Tab M8",
            "Lenovo  smart tab",
            "Far better than Kindle Fire",
            "good value",
            "Great tablet",
            "Great calue",
            "",
            "You get what you pay for",
            "Standout tablet",
            "Good tablet for kids",
            "Smart tab m8",
            "Awesome Lenovo tablet",
            "Very sleek. A little gem of a tablet.",
            "Ideal as a small tablet & performed as I expected",
            "Handy size. Good value",
            "Tab m8",
            "Good, compact tab",
            "Product was everything as advertised. Good Tablet",
            "Great tablet for son.",
            "Great value product for the money",
            "Very good tablet",
            "Great little tablet for our child",
            "Perfect for kids study and gaming",
            "Love it",
            "Cons: Low specs and Lenovo logo on the main screen",
            "My first tablet",
            "Nice compact tablet",
            "Lovely little tablet",
            "Perfect for kids",
            "Lenovo m8 Tablet",
            "My Lenovo M8 Smart Tab is so sweet",
            "Excellent replacement for previous Lenovo 8.9 n/a",
            "My Lenovo M8 Smart Tab is good",
            "Great tablet",
            "I find it slimline and lightweight.",
            "Good value",
            "2 in 1 smart dock is fabulous",
            "Great tablet",
            "Slick and Quick",
            "Great tablet",
            "Excellent budget tablet",
            "Absolutely brilliant",
            "Great value for money tablet.",
            "Quick & easy to use",
            "Lenovo M8 Smart Tab g",
            "Great purchase",
            "This tablet is good value for the money.",
            "The tablet is fabulous and easy to use",
            "Very useable small tablet",
            "Not so smart",
            "Much better than I thought it would be.",
            "Replacement from an older version",
            "It is very quick and easy to use",
            "I like the feel of this tablet looks great",
            "Works very quick and easy",
            "Great tablet",
            "Great looking Tablet",
            "great tablet",
            "",
            "Amazing product!",
            "Nice product",
            "Great",
            "Great purchase",
            "Great tablet just what I  needed",
            "I've had it a month or so now.  All good so far!",
            "Pocketsize marvel .luv it ...",
            "",
            "Pleased with this product.",
            "Nice and slim, easy to transport",
            "Good Tablet",
            "Fantastic Features",
            "",
            "Great 2 in 1 product",
            "Great little tablet",
            "Fantastic tablet",
            "The tablet I’ve always wanted!",
            "Stylish and useful",
            "Stylish",
            "Lenovo smart tab 8",
            "Lenovo m8 smart tab",
            "tablet",
            "Sleek and Efficient",
            "Portable and fast",
            "Nice design and good idea with the dock",
            "Well Done Smart M8",
            "Good tablet",
            "Such an easy tablet to use",
            "Great tablet and base unit",
            "Great small tablet",
            "Great little tablet",
            "Smooth fast tablet",
            "Great Tablet."
        ],
        "review_text": [
            "Bought this for my 9 year old son, it’s perfect size, quick and easy to charge! Excellent so far!",
            "Have had it almost a month and really pleased. The charging dock/stand has been a really nice and useful addition.",
            "For the price it's fine but the tablet does crash/freeze quite often even tho the OS and software's have been updated.",
            "Replaced an earlier model, great for price.",
            "Very good value Tab at a reasonable price. With 32GB of storage, it's great for storing all my holiday photo's. Extra storage can be got by adding an SD card. It also has a good quality screen and the battery life is brilliant.",
            "Fast delivery , good price with docking station. Suits me as an OAP.",
            "Excellent for kids with good storage..",
            "Great tab. Sister always breaks her charger so this tab is a great solution",
            "I like the feel of the screen. Soft to touch and fast. Easy to access my apps and watch videos",
            "Perfect sized tablet for my needs.\nMaybe a little restricted for more intense requirements but for my general surfing and media viewing, it fits the bill.\nOperating system is close to stock android with no bloatware and the dual speakers and stand are excellent.",
            "Bought as a present.  Easy to set up.  Ideal for novice user.",
            "Excellent defeltnly worth the money",
            "I love Lenovo Smart Tab my daughter set it up for me it has taken a bit of getting use to but i am getting there.",
            "Nice tablet for the money excellent display long battery life but it misses the extra ram when playing games it does tend to stutter a bit at times playing some games. However for the money very good value",
            "Brilliant tablet! Works fast and efficiently! Has everything already on it and more! Worth every penny!",
            "no dont's all do's, sits on docing station great.",
            "Bought this for my Mum and she has never used one before. However, she found It the perfect size to hold and very easy to use.",
            "I was sceptical about purchasing this tablet given the price, but I'm glad I did. It does everything I need from a tablet, the screen is clear and responsive, sound is ok, it's quite fast and comes with a great docking station/ stand.",
            "Easy to set up and very quick snd easy to use. Definitely worth the money.\nI’d read good and bad reviews but I’m glad I went ahead and bought it.",
            "Really good tablet, also excellent battery life no complaints here.",
            "It's always freezing, I need to reset sometimes as it's stop loading and it's slowing down to load. And it's go back to the main page by it self while I'm opening a page.",
            "I bought this as a replacement for a Kindle Fire. This is a different league. Fast, clear, not clogged up with the ugly Amazon interface. Full access to the Play store, comes with a neat docking station and is just easy to use. Forget Kindle, this is the way forward.",
            "Easy to use and good clear screen.\nI liked the charging stand and the slim design",
            "This tablet is the perfect size for me. It can be held easily in one hand so is perfect for skype calls. It lives on the charging station, which you appear to pay extra for. If you prefer a tablet in a case i suggest you purchase a tablet without a station as it is unlikely you would use it. The tablet can also be charged with a cable. The camera takes decent photos and the battery loses about 10% per hour if in constant use. Speed is good but i mostly use it for browsing the net.",
            "A lovely tablet for my daughter of 6 plenty of power to run all her apps would recommend",
            "The tablet is great and the docking station but you cannot use the docking station if you have a cover on the tablet",
            "For the price, you really can’t beat it. But it can be a little bit slow coming to life when you first go on it. After a little while it definitely speeds up and is very quick to do stuff. The size is perfect for what I wanted it for. I haven’t used the smart charging station so can’t comment on that. But overall very happy",
            "Brilliant tablet. My more expensive older one was not supported by it operating system anymore so looked for a replacement. This is compact, easy to use, so quick to set up and a delight to use.  The ease of buying it on the site was amazing and I took in all the reviews and am really pleased with it. Highly recommend it.",
            "I bought this for my kid for her birthday. She loves this tablet. It is the right size for her. She uses it for doing school homework, playing games and watching videos. This tablet came with the charging dock which is convenient. However I have not been able to use the Google Assistant while in charging mode. I enabled the assistant feature but while charging and locked the tablet won't respond to the 'ok google', not a big deal or may be it is some settings.\n\nOverall a nice tablet.",
            "Great little tablet. Bought one for my 6 yr old and one for the inlaws. My 6 yr old finds it easy to use and can navigate it with ease. Perfect for video calling and minecraft. The inlaws will use for photos, videos and video calling. Bought this because if the charging stand and it was a good price.",
            "First time buying a Lenovo tablet, usually I have Samsung, but could not afford one, so I brought-definitely-next best thing. Quick,easy set up. Runs on Android, worth the money",
            "A little gem of a tablet.",
            "Ideal as a small, back up tablet, excellent for my purposes",
            "I chose this tab for its handy size , also the charging stand is great , much easier than plugging in every time.",
            "This tablet is amazing as a back up it has all the app that are mostly use and good for game play. That battery last very long and it come with this dock so you can charge it the other way. I do recommend this tablet",
            "Bought mainly as an e-reader due to its battery life. But as an 8inch with a footprint of a 7, it works well for surfing, reading the news, transferring pictures from cameras and phones. And no bloaty apps. \nAfter buying one for me some months ago, this is a second for my wife...there did not seem to be anything as good for this price.",
            "Im pleased i bought the Lenova tablet. Its easier to do face time now.",
            "Excellent tablet.Son loves it.",
            "Spend more money on memory",
            "The tablet and related docking station are very good and this tablet does everything as advertised.",
            "We got this as a Xmas gift, he loves it and it works great, its light, portable and links to our Spotify. Would recommend to anyone",
            "Perfect size tablet for kids aged 6 to 10 years.\nVery good sound quality.\nWorth spending.",
            "I love my tablet as its very fast and very quickly to charge up. Its very thin and sleek and the right size for my hand.",
            "Very low specs with huge lags. Nothing agains Lenovo, but you have to live with an annoying Lenovo logo on the main screen/software.",
            "Very pleased with this tablet. Took a little while to set up but not difficult and easily downloaded quite a few apps. I bought this to be used as a cross between my mobile and my laptop but so far I have mainly used it for streaming music so I have found the docking station handy, it sits neatly beside me. The sound quality is excellent. I have never had a tablet before so cannot compare with other products but I feel the price was reasonable for what it can do.",
            "Bought as a gift. Recipient happy with it. Good replacement for Hudl2, good price. Screen and audio very good.",
            "I needed a new tablet, my old tablet was a Lenovo Yoga 2 which had been great, very reliable, but old now & slow, decided to stick with Lenovo, glad I did this is a lovely light tablet, a nice size & easy to use. Very happy with it & would recommend.",
            "bought this for my 6yr old and he loves it. The battery life is good. The charging dock is excellent as you don't have to fiddle with the micro usb port you just plug it into the dock, which wont then damage the micro usb port.",
            "Replaced 6 year old Lenovo tablet with new M8. Very impressed with the new tablet, great build quality and easy to set up.",
            "I'm enjoying this item, good seller and nice deal. I encouraged anyone that a Lenovo M8 Smart Tab to buy this one ... Good product.",
            "All photos and files from all previous android tablet downloaded automatically.\nEasy to set up. Bright screen for troubled eye sight.\nReasonably priced. Ordered mid afternoon, delivered before 10 am next day. Can't get any better.",
            "It was very easy to set up, battery life is great, it loads quickly, screen is clear, brilliant.",
            "Great tablet being 8” it’s portable and lightweight, very easy to set up and use, battery life is good so far (it is new) clear screen with options to have an evening/night mode which changes the colour of the screen slightly to reduce glare in lower light making it great for reading in bed. I had a Nexus 7 and loved it till it died, this Lenovo so far matched everything I loved about the nexus and I haven’t explored it all yet, love it.",
            "It is so much lighter than my last tablet and clear screen.   The only slight downside is that I have to take it out of the case to charge on the stand.",
            "It is just what I was looking for. The price was good. Easy to use.",
            "I was really impressed with the smart 2 in 1 dock that effectively turns this tablet into a hub and I love it. It can charge at the same time as displaying photos watching streaming sites etc whilst in the dock. We love Google assist with many other devices and they all work together adding stuff to shopping lists or alarms set everything you need. It is light to carry but isn't your typical plastic casing so is heavier, screen size is all visual so no wasted screen face. Battery life is great",
            "Brought for 9yr old, a great purchase. Good value for money.",
            "My old tablet is glacial in comparison.",
            "This is the second Lenovo tablet bought for my son. Great size, easy to use and set up.\n\nOnly reason for we bought a new tablet was it was four years old and was running slow.",
            "Nice sturdy design, good battery life, clean and uncluttered android implementation.\n\nIts not the quickest, but you can't expect that for the price. Works perfectly well for you tube, light gaming (eg Pokémon go), we browsing - my young son is very pleased with it as a first tablet.",
            "This product brought for my daughter and she absolutely loves it to bits",
            "Great value for money tablet. Good size for viewing but small enough to be fully and easily portable. Fast start up and responsive. Easy to follow instructions.",
            "Good reliable and quick tablet, the docking station is brilliant when u want to charge it and it's also fab to use when u want to go hands free and watch video/YouTube, my 9 year old loves it.",
            "I bought because of the large GB available and the battery life.\nI wanted mainly for reading but decided against a Kindle or similar as I could do more with this.\nHave use for Zoom call and works great",
            "Great purchase, service was superb. I haven't used the tablet much but have found it easy so far. I strongly recommend it.",
            "The tablet was delivered quickly and on time. I like that it came with the charging stand which is stable and robust.",
            "I bought Lenovo tablet for my son, he's liked it so much because it's very easy to use and have long battery life.",
            "Bought this to replace a Amazon Fire 8 which only got a couple of months ago - I didn't get on with it at all, it did not have google or skype and you couldn't load it on.\nAmazon system is very intrusive, any search for anything goes through Bing and goes to Amazon sites first, Nothing against Amazon I do use them but when I choose, also Alexa was always trying to switch on. \nThis Lenovo is brilliant, very portable, good quality and very user friendly, don't get tempted by Amazon Fire 8",
            "The smart option as Lenovo named it is nothing else but an extra stand with a charging function. All other functions act like on every other tablet or phone. \nAll together nice tablet well built, maybe a bit slippery case makes it not so much comfortable to hold.",
            "Great for video and pictures. Good all rounder.",
            "Very good upgrade model",
            "It is very useful and easy to use.  Very compact and portable to carry around.",
            "This tablet feels nice and sturdy in your hand, the picture quality it displays is great. So far the battery life seems good (I've only had it a couple of weeks)\nI love the stand for charging and for accessibility in the kitchen, it's great it's there ready and waiting.\nThe only one tiny minus so far, is that it is a bit slippery in the hand so I will probably purchase a grippy skin case for it.",
            "Well worth the money",
            "Very happy with this tablet. Not had my own before, only ever used my kids' kindle fires but wanted one to use for Zoom mainly and also social media and TV.",
            "Bought this for my wife as an upgrade to her old lenivo tablet, a lot faster than the old one, more memory and exelent graphics",
            "Easy to use and set up ,good quality screen and the charging cradle is a real bonus.\nat this price you can't go wrong",
            "Starts a lot quicker than my previous nexus tablet.  Very good all round.",
            "Great tablet. Does everything you need and on top of that is smart as well. Would definitely recommend it!",
            "Good value for money, would definitely  recommend.",
            "A great product. Highly recommended",
            "I can use this tab one handed better then a larger one. This was primarily bought to use with my drone for a larger display. The thing is I now don't just use it for my initial reason I use it daily to surf and watch movies too and the image quality is very good as is the battery life. I also love the performance as it is quite responsive. The charging dock is brilliant with a fast charge and acts as a viewing stand. Very happy I chose this model.",
            "the storage on this Lenovo is great, you can also use a sd card as extra storage to move apps etc, battery good, the only thing I would say is the screen is a bit dull, but just have brightness to 100% if needed, very light and easy to set up, can also cast to TV which is what I always look for in a tablet, touch screen very responsive, and its fast to load, much better than a previous Huawei I have had.",
            "I've had it a month or so now.  I have only used for playing a few games and for internet searching watching you tube etc and for emails.  All good so far!   Have not used the cradle much as can be charged with a usb charger.  Also haven't used the Google Assistant feature.  Just bought this to replace my Amazon Fire which I wasn't that fond of - this one I feel is better and hasn't got all the advertising on it.",
            "Excellent tablet , portable with great sound and vision .long battery life ,charging dock converts to Google hub just brilliant..",
            "Tablet Lenovo od the best .Is light .The battery lives for a long time .And works very smoothly .",
            "Bought this tablet as a modestly priced replacement of an older tablet that was having battery problems.\nEasy to update and load and generally pleased with a good all round performance. Excellent value for money.",
            "Good screen. Expandable memory. Size, can be carried in a pocket. Apps work seemlessly. There is a lot of capability at a very competitive price point. I happily recommend the product and customer experience met expectation, Best tablet for the price by a million miles. The specs are far superior when compared to other tablets in the same price bracket. Perfect for kids with smooth running games or even for adults where it will easily be able to handle every day tasks, love it",
            "Good budget tablet very clear screen good value, docking station handy",
            "Tested this fantastic product.Outstanding performance.Amazing features.Battery life is fantastic.Great design with the perfect size to take any where with you.Slim design is just perfect.Everything you could possibly want compact with loads of great features.Easy to use.I really love this fantastic value for all the family product.Amazing vision crystal clear.I am amazed how great this product is and I wouldn’t leave the home without it.perfect size.Absolutely Fabulous! Well worth the money!",
            "It's a nice little table, the screen is bright and clear with good colour, the sound is great with the dual speakers and goes quite loud without distorting,\nTouch screen is responsive and the apps load and work quite quickly and the included dock is a nice touch,  and works very well as a media centre connected to a bluetooth speaker, \nThe camera is surprisingly good for a tablet, taking a clear bright photo in a dull room,\nAnd there  is more than enough memory for all your apps.",
            "Tablet with a twist. If you're looking to buy a voice assistant or tablet, this is a great choice as it does both. It comes with the dock to charge and turn into voice assistant (you must use the dock with charger if you want it to become voice assistant)\nCouple of downsides in my opinion, the android is pretty stock, however there is some bloatware as default, but you can live with it. The camera protrudes out the rear meaning the back is not smooth when you put it down flat on a table.",
            "You can always rely on Lenovo to provide a good quality product and this is definitely another one of those products. Really easy to set up with Google and it will mirror your mobile screen. The picture quality is clear and crisp. Dolby atmos sound makes for great listening. The styling is really good. The 5mp camera on the rear and 2mp selfie on the front is all you really need on a tablet. The 32gb hard drive should let you download a decent number of apps. Great little tablet.",
            "Fantastic tablet, easy to set up. Google assistant just as good as other similar products. My son loves playing games and watching films. The stand is a great addition. Would definitely recommend this tablet.",
            "This tablet ticks all the boxes! I am an Etsy seller, it’s a lot easier to browse or list my items on it than my phone. Minutes to set up, popular apps already installed. The picture quality is great, I take photos of my creations and instantly list them without needing to edit. The docking stand makes charging easy. Just the right size to comfortably fit in my hand whilst browsing and big enough to watch Netflix and play games. I just made my son a profile in kids mode so he can browse safely.",
            "It is a very stylish and useful bit of kit. It feels nice quality when you hold it and it looks very nice when it is sitting in the charging station. It is a premium metal design with HD display and Dual speakers. It is quick and easy to set up and has many apps already installed. \nIt is great for Netflix, games and searching the web. The battery lasts a long time and it is the perfect size to put in my bag and use when I am out. \nIt is a good price and I would recommend this product.",
            "Slim stylish looking tablet with Google assistant. 8 inch screen and comes with charging docking stand. When not in use simply place the tablet on the stand and your tablet is always fully charged. Fantastic idea. I have mine on my bedside table so it doubles as an alarm clock. Compatible with all you Google apps so you can view your photographs etc. Easy to use and lightening fast. Great tablet.",
            "I love this tablet. The size of it is fab, perfect to take out and about in your handbag. It comes with many popular apps pre installed so thats saves time looking for them and downloading them. It was very quick and easy to set up no problems at all. \nThe stand is a fab idea as you can leave it in there while you watch your film or listen to your music. You also charge it in there too....which is fab because my kids and charge ports dont mix.\nThe battery life is brilliant. I would recommend.",
            "The lenovo M8 smart tab is a great addition to the lenovo range you can use it as a normal 8 inch tablet ot use it with the stand/charger that comes included with it. The device has a 32gig expandable memory it only weighs 305G it also has the android Apple pie system the m8 is not the rolls-Royce of tablets but its a great start.",
            "lenovo tablet works ok",
            "Loving this 8 inch tablet.  Perfect size for fitting in my handbag so I can use in work too.  Brilliant size for watching Netflix and surfing the net without having to squint.  Battery life is exceptional. Charging point/stand is great for hands free use.  Only problem I have is finding which family member has nabbed it.  Great quality cant re commend enough.",
            "I really love this piece of gadget, it is so portable and fast. I used this every day now, especially for the Radio application included, picture and sound quality are superb\nI will recommend this product.",
            "The design of the tablet is nice, it has a quality feel to it and the dock is a novel idea. It was very quick to set up.\n\nThe cable for the dock is a little short, it’s fine whilst it’s put away but if you want to move the unit to somewhere more people can see for example, it limits the usefulness of the dock.\n\nThe tablet itself is essentially just a low to mid range Android tablet and the switch between tablet mode and google hub mode is sometimes confusing.",
            "My kids have had a number of tabs before but this one looks fab. Very solid metal design with dual speakers, easy set up & Google assistant ambient mode when put on charging station, so no mess.  Battery life is amazing. What impresses me a lot is its dual charging mode. My kids would always destroy the charging port with reckless handling. But fortunately this one has got easily accessible charging dock with no chance of damaging the port.",
            "Lovely mini tablet, so easy to use and light to carry around, battery life very good.",
            "This tablet is compact and comes with a charging dock which serves as a good stand too. I am so impressed with how easy it was to set up and the size is perfect to travel with. Lots of well known apps are already pre installed which saved time trying to find them and it was ready to use within minutes of taking it out of the box. Overall I’m really impressed with this tablet and would highly recommend it.",
            "This is a great tablet , screen size perfect for viewing movies on the go and the sound is great . Charges very quickly and I love the charging station , makes it easy to use as a radio and again saves holding it whole watching Netflix",
            "Excellent small tablet. Does everything I need but is far smaller than my usual 10\" device,",
            "I was given this item free in return for my unbiased, honest opinion.... great little tablet, love the docking station, no more messy wires, it is responsive and fast and has great sound for watching media content.\nHighly recommend this tablet.",
            "Have downloaded loads of films and apps on this tablet and am not experiencing any lag at all. \n\nThe kids were on the kids section for a couple of hours and the battery is still at 84%.\n\nThe kids section does seem to lag occasionally but they'll not notice. It would be nice if the kids section was more customisable. I'll probably give them an actual user account and monitor them using it.\n\nThe charging station/clock is a brilliant idea.",
            "I absolutely love this tablet with its many functions. It's lightweight so it's easy to take around and also handle. It can be used as a normal tablet for teens/adults but also has the option of kids mode so you can control the content. When not in use, put it into the cradle and it turns into a smart hub with Google assistant. Play music, ask for baking ideas, video call and much more.\nDefinitely a great buy for anyone who is tech savvy."
        ]
    }
}