{
    "884/5504": {
        "remotekey": [
            "884/5504"
        ],
        "item_category": [
            "More tablet, less frame. We've trimmed away the bulk while still delivering the essentials of a tablet. Galaxy Tab S5e features a polished metal uni-body case design in a sophisticated metal finish. What's more, it comes in a trio of monochromatic tablet colour options, including Silver and Black that blend in seamlessly with your lifestyle. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "54 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "94%"
        ],
        "review_rating": [
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1"
        ],
        "review_date": [
            "28 October 2020",
            "16 September 2020",
            "15 September 2020",
            "14 September 2020",
            "14 September 2020",
            "13 September 2020",
            "13 September 2020",
            "13 September 2020",
            "9 September 2020",
            "6 August 2020",
            "29 July 2020",
            "23 June 2020",
            "10 June 2020",
            "29 April 2020",
            "29 April 2020",
            "29 April 2020",
            "28 April 2020",
            "8 April 2020",
            "8 April 2020",
            "29 March 2020",
            "17 March 2020",
            "17 March 2020",
            "3 March 2020",
            "28 February 2020",
            "19 February 2020",
            "5 February 2020",
            "29 January 2020",
            "29 January 2020",
            "21 January 2020",
            "14 January 2020",
            "3 January 2020",
            "2 January 2020",
            "26 December 2019",
            "27 November 2019",
            "20 November 2019",
            "13 November 2019",
            "16 October 2019",
            "25 September 2019",
            "18 September 2019",
            "11 September 2019",
            "29 August 2019",
            "13 August 2019",
            "30 July 2019",
            "24 July 2019",
            "25 June 2019",
            "12 June 2019",
            "6 June 2019",
            "4 June 2019",
            "31 May 2019",
            "21 May 2019",
            "21 May 2019",
            "3 May 2019",
            "2 May 2019",
            "30 April 2019"
        ],
        "review_title": [
            "The Samsung tab is 1000% recommended",
            "",
            "Not brilliant",
            "Real lmprovement on previous tablet",
            "Great screen!!",
            "Fantastic for Media consumption.",
            "Great  features",
            "Fantastic tablet very fast",
            "Fantastic",
            "Excellent tablet. Amazing picture and sound.",
            "My Samsung Tablet 5se is my pet",
            "My tablet is faster than the old one",
            "",
            "Perfect",
            "I love in it my New Tablet",
            "Very good",
            "Looks great everything I need.",
            "RETURN",
            "Perfect, good price delivers all I hoped for.",
            "Great features",
            "Awesome",
            "This tablet absolutely fantastic",
            "Superb tablet",
            "My first Tablet with phone - love it",
            "Very good!",
            "Brilliant tablet, great price.",
            "Best ever",
            "Just what I was looking for",
            "Brilliant tablet",
            "Excellent bit of kit, love it!",
            "Excellent all round Tablet.",
            "it is nice to hold and pretty to look at",
            "Pleased with preformance and no complaints.",
            "Brilliant",
            "Fantastic. I ll reccomend to my friends",
            "Nice tablet",
            "Stunning quality screen",
            "Brilliant quality and decent performance",
            "Tablet is superb.",
            "Happy",
            "Amazing",
            "My tablet is doing the job I brought it.",
            "Great tablet by samsung",
            "Great Product",
            "Very good buy,you won't be disappointed",
            "My Samsung tablet looks really smart",
            "Fantastic tablet",
            "Very good  every day tablet.",
            "Great value for money",
            "Nothing bad",
            "TAB S4's little brother but packs a punch",
            "Best tablet we ever had",
            "Great",
            "Lags"
        ],
        "review_text": [
            "Absolutely love this tab, husband gave it as a present and loved it... It did freeze on me once but nothing major... Nice crisp display and amazing sound quality... Battery life is great... Over all it's a nice bit of kit for money paid... Definitely well worth to put your hands on one...",
            "I like the tab this is very thin and nice",
            "thought this would be great with the added performance have had Samsung phones for years ,never an issue. This keeps freezing up , took it into the samsung shop, they said nothing wrong, but still keeps freezing up . I have exactly the same apps on my phone and it runs sweet as anything.  My last tablet was an S5 that had to have a new motherboard, why can't you make tablets as good and as powerful as your phones",
            "Screen and sound greatly enhanced on my 2017 tablet.\nBattery life good. I appreciate the USB connection in that the power plug can be inserted either way round to save searching in the dark. There is also a noticeable  improvement in response time.",
            "Lovely, thin Tab, small frame, nice and light. \nThe power on/off button is set to activate Bixby, so you can't power off using it-bizarre!",
            "I was worried that the 4GB RAM wasn't going to be enough to make of similar impression of that of using my note 9 with 6. With every used, non used app and android OS w/Sammys overlay. Running in RAM.  I was righ away disabling them non-removable, never to be used apps which I could only disable 5 of 13 (313mb for all 13 not Updated) and to be honest this tablet hasn't disappointed now I've done the above. :-).\n\nEven with more than 6 apps in the switcher then I continue using my S5e there is no sign of slows or hangs or lagging...... Optimisation sorted.\n\nBattery last for days, with-in that time i get 8-9 hrs screen ontime. I'd would get another 2 hrs w/sim switched off within WiFi signal, Only active 4G sim out n' about. But it's a trade off I  knew about for other's who didn't. \n\nRuns everything I put on it. Meaning the usual apps we have come to know in social and shopping and media.\n\nMedia consumption is fantastic love the Screen size and Res.  I'm a massive fan of these four speakers I cup the bottom 2 not blocking them.",
            "I bought the device because of the look, suitability  for what I wanted to use it for and the exceptional lightweight",
            "the tablets the best I have had very fast and light good screen",
            "A must have purchase.",
            "This is a really neat, stylish tablet. It has an amazing picture and the surround sound quality is excellent. Very light and portable.",
            "Fab little compact thing, does everything, even sings to me, fairly good on the battery, love it.  Got the phone also.",
            "Good value nice and lightweight",
            "Super light unit.\nExcellent picture that can be altered to suit.\nSuper quick response and generally far superior to my current tablet.\nExcellent sound quality too!",
            "Had the tab about 6 months. Bought it complete with the bluetooth keyboard. Absolutely excellent together. Keyboard has never faulted or been a problem.",
            "Atm its brilliant love in it battery long life fast good sleek gadget camera good and the sound is fab",
            "The tablet is really easy to use, is like a phone. The 10.5in its good and i love it.",
            "Good price and quality product .",
            "Once i opened it at home, it was not a new product. Someone else had used it, some applications was installed. Returned it to the shop the manager confirmed that it was not a new one.",
            "I bought the LTE version for internet on the go.\nStreaming movies and TV. \nAs well as email and casual browsing as expected. \nMore expensive again available and the model will be superseded but this unit will meet my needs for a long time.",
            "Will give my opinion after I try it. But as far as I searched it is a great device",
            "I am thoroughly impressed with the tablet it has all the features that I required. Definitely worth the money",
            "I absolutely recommend",
            "Recently picked up this bad boy as a mid range tablet to satisfy my entertainment needs. I've got to say, it's a cracker! I've had plenty of tablets including those who won't be named here but this is fantastic for the price point. Great display for movies, sound is good (even though I usually pair to a Bluetooth speaker) and performance is awesome for general everyday tasks.\nIt's no Pro model, but it's not claiming to be. It's just a great device for the price and can't recommend it enough.",
            "The main purpose was to have internet data and it works",
            "I put an unlimited 4g sim into the tablet and use it as a wi-fi to run all my devices at home, so got rid of cable modem. The tablet is fast and has high resolution. No buffering when streaming. Recommended.",
            "I have really enjoyed this tablet. It's a fantastic size, clear screen. I can download alot of apps and watch movies on it. I have been playing alot of games on it too and the performance is fab.",
            "I’ve had all sorts of Tablets but this one far outweighs my others, I’m soooo pleased with it. It really is perfect, fantastic sound quality and a very easy Tablet to use. I love that it has Cellular as well as WiFi, works 100% on both. It’s a lot lighter than my other Tablets so it really is 10/10 from me :-)",
            "Very nice and slim hish quality",
            "Just the job no problems yet",
            "Bought this & went for the biggest version so I have loads of memory (which was the sole reason of replacing my previous Samsung tablet).\nExcellent bit of kit. Not cheap but given my last tablet from them, if this lasts as well it will be well worth it.\nMy only tiny reservation is the battery seems to run down quite quickly when it is in sleep mode....not sure how or why really!?",
            "Bought to replace my old model Kindle Fire. Set up easily, simply no problems connecting, transferred apps needed from my android phone. Added a 64GB memory card to increase the memory available. Once formatted transferred relevant apps across. Sound and picture quality very good. All in all a great tablet.",
            "penny worth to possess one",
            "Price same as other outlets, would have liked it cheaper. Customer services great. Very pleasant lady served me.",
            "Very good easy to use",
            "Excellent  product from samsung",
            "Brought for my daughter birthday as he old tablet was loading her games slow.\nBut she’s enjoying it and loves the face recognition security.\nIt works great nice a sleek very thin and I would recommend buying. I want one for myself",
            "Sreen quality is superb, it would leave an iPad standing. Only only problem, and it seems to have happened to other people, that is wi-fi drops out from time to time. It's a shame it is a lovely piece of kit. I returned mine to Argos",
            "Brilliant can be used a phone as well but can be slow although I do have a lot off apps :p",
            "Excellent tablet and brilliant that it takes a sim card to use data if no wifi available. 4 speakers also so sound quality is very good.",
            "I have been given the Tab S5e as a birthday gift although i am happy with it i find when i switch it off after 2 seconds it comes back on without me touching any switches. I think it is great exept for that one issue i am glad i have it.",
            "This tablet is amazing, with powerful AKG speaker, the sound that comes from it can be heard from quite a long distance, the tablet itself runs very smoothly and has a sleek design that fits well into your hand. When it comes to size, it is large so it is not so portable, unless you plan on bringing a backpack with you, you won’t be taking this outside.",
            "The tablet is good as I thought",
            "Tablet is one of the best in the market",
            "Very happy with my tablet.  I bought it to use at the hospital.",
            "This is a very good buy, looks good easy to manage and has good battery life.",
            "This Samsung tablet is very thin and light easy to use . Has good battery life and the added advantage of putting a sim card in and SD card for extra storage",
            "I've got an tab S3 and wanted a cheap general tablet to have as a backup.  I have been so impressed I use it all the time and ha e the S3 as the back up.  Cant fault it and better tha. Any Apple or more expensive android tablet.",
            "Great design, handy fingerprint reader, fantastic sound. And stunning Samsung display.",
            "Let's start off with the screen, this is something Samsung always do well and they havent skimped here in anyway, amazing picture quality as always especially for a bigger screen.\nThe speakers sound clear with a good amount of bass.\nOverall design is very nice, face recognition and finger print scanner is the best I've used. Currently got a Note 8 and face recognition is awful and so is the scanner on the phone. Could be from a bad batch so take that with a grain of salt.\n\nThe tablet isnt slow by any means and keeps up well with today's standards, but where you get extra points you have to dull down somewhere which is the CPU; which day to day use it makes no odds. Only matters if you're wanting to game on it which just isnt for me. I've got a PC for that. \n\nOverall I'm very happy with the quality of this tablet and hopefully it doesn't only last a year due to the battery failing like my last Samsung tablet. Please dont disappoint me in that department like your phones.",
            "AMAZING  best tablet I have ever used wat better than an iPad",
            "This tablet is a good substitute for the heavyweight TAB S4.  It's noticeably lighter and slimmer therefore less fatigue when holding it for a period of time.  My only moan is that unlike in Germany you could buy the Gold version whereas here in the UK it's only Black or Silver.  If Samsung treated their loyal customers equally I would have given this tablet 5 stars.",
            "upgrade from ipad\nvery fast\nsuper good looking screen\ngood camera\ngood battery\nOne ui looks great to",
            "We had a ipad but we all like Samsung so we got this and it is very very good super fast great screen really,good 3 days battery",
            "Lags are everywhere in 10inch 64g model. Animations are slow, Chrome has noticable glitches on scrolling. Even switching between apps is laggy. Totally do not recommend."
        ]
    }
}