{
    "257/2196": {
        "remotekey": [
            "257/2196"
        ],
        "item_category": [
            "HUAWEI MediaPad T5 is a 10.1-inch tablet with a Kirin 659 octa-core processor. Comes with an IPS screen with a resolution of 1920 x 1200 pixels. Supporting high-speed Internet connectivity, GPS navigation, and other features, the T5 functions as a smart assistant and entertainment center. The T5 runs EMUI 8.0 (based on Android 8.0) OS, and is equipped with Huawei cloud services. "
        ],
        "summary_star_rating": [
            "4.8"
        ],
        "no_reviews": [
            "133 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "95%"
        ],
        "review_rating": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5"
        ],
        "review_date": [
            "28 April 2021",
            "7 April 2021",
            "7 April 2021",
            "5 April 2021",
            "17 March 2021",
            "9 March 2021",
            "24 February 2021",
            "24 February 2021",
            "24 February 2021",
            "23 February 2021",
            "18 February 2021",
            "15 January 2021",
            "13 January 2021",
            "13 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "4 December 2020",
            "1 December 2020",
            "25 November 2020",
            "18 November 2020",
            "18 November 2020",
            "18 November 2020",
            "12 November 2020",
            "11 November 2020",
            "10 November 2020",
            "28 October 2020",
            "30 September 2020",
            "22 September 2020",
            "2 September 2020",
            "1 September 2020",
            "27 August 2020",
            "27 August 2020",
            "25 August 2020",
            "19 August 2020",
            "11 August 2020",
            "6 August 2020",
            "5 August 2020",
            "5 August 2020",
            "4 August 2020",
            "2 August 2020",
            "31 July 2020",
            "29 July 2020",
            "22 July 2020",
            "22 July 2020",
            "21 July 2020",
            "21 July 2020",
            "1 July 2020",
            "23 June 2020",
            "23 June 2020",
            "16 June 2020",
            "16 June 2020",
            "16 June 2020",
            "16 June 2020",
            "11 June 2020",
            "11 June 2020",
            "10 June 2020",
            "10 June 2020",
            "9 June 2020",
            "6 June 2020",
            "2 June 2020",
            "2 June 2020",
            "2 June 2020",
            "2 June 2020",
            "31 May 2020",
            "27 May 2020",
            "26 May 2020",
            "26 May 2020",
            "19 May 2020",
            "14 May 2020",
            "12 May 2020",
            "6 May 2020",
            "6 May 2020",
            "6 May 2020",
            "6 May 2020",
            "1 May 2020",
            "30 April 2020",
            "30 April 2020",
            "29 April 2020",
            "29 April 2020",
            "29 April 2020",
            "29 April 2020",
            "28 April 2020",
            "22 April 2020",
            "22 April 2020",
            "22 April 2020",
            "18 April 2020",
            "15 April 2020",
            "13 April 2020",
            "8 April 2020",
            "8 April 2020",
            "25 March 2020",
            "24 March 2020",
            "18 March 2020",
            "11 March 2020",
            "10 March 2020",
            "4 March 2020",
            "26 February 2020",
            "26 February 2020",
            "25 February 2020",
            "18 February 2020",
            "11 February 2020",
            "4 February 2020",
            "29 January 2020",
            "28 January 2020",
            "16 January 2020",
            "16 January 2020",
            "14 January 2020",
            "8 January 2020",
            "4 January 2020",
            "3 January 2020",
            "2 January 2020",
            "2 January 2020",
            "1 January 2020",
            "29 December 2019",
            "28 December 2019",
            "27 December 2019",
            "27 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 December 2019",
            "26 November 2019",
            "6 November 2019"
        ],
        "review_title": [
            "My daughters love it",
            "Excellent works well",
            "Very good product and price",
            "Great budget tablet",
            "Easy set up",
            "It's very nice",
            "No hard connectivity",
            "This tablet is excellent in every way so easy to u",
            "My tablet is light weight, clear and easy to use",
            "This was a",
            "Tablet is brilliant!",
            "Amazing Tablet",
            "Good value android tablet",
            "Brilliant",
            "Perfect tablet",
            "Simple set up",
            "My son loves it. Great quality.",
            "Great tablet",
            "Christmas present",
            "Brilliant tablet",
            "Fast and good quality.",
            "Great value tablet",
            "Modern Tablets are Twice as Good",
            "Huawei tablet",
            "Ideal Christmas Present.",
            "My Huawei 10\" Tablet is Excellent.",
            "My medipad is a great replacement",
            "This is the best value for money tablet.",
            "Very clear light weight easy to handle",
            "brought for work, excellent",
            "Stylish midern and a treat to use",
            "Tablet",
            "This tablet is great",
            "Great tablet",
            "Best tablets",
            "Great looking tablet",
            "Very good easy to use well worth the money",
            "Great tablet.",
            "Very pleased with my Huawei tablet",
            "Huawei tablet",
            "My tablet is working fine",
            "",
            "Great tablet",
            "My tablet is so fast",
            "My TV and tablet are the business",
            "Absolutely fantastic pad for the money highly reco",
            "",
            "Fab tablet for my 8 year old to do school work on.",
            "Very good tablet. Fast response.",
            "Not the best!",
            "Fride lovely, exactly like picture",
            "My ipad is stylish.",
            "My first tablet",
            "Love this tablet, light and well designed",
            "This tablet is fabulous! Fast!",
            "Great just what my husband  needed to use in lockd",
            "Very good and quick to respond",
            "Not bad",
            "Good value tablet.",
            "Really easy to get up and running",
            "Perfect for my daughter she loves it",
            "Simple to set up",
            "",
            "Sleek Tablet",
            "An amazing tablet",
            "Everything I need",
            "Just what I needed",
            "",
            "Bought as a gift for daughter!",
            "Very good tablet",
            "Extremely Well finished.",
            "Great performance!",
            "Because of its size very good for reading e-books.",
            "Very good for the money. Good, quality and picture",
            "My son loves it",
            "Better than expected!",
            "Great product",
            "",
            "My son is enjoying his tab it's fantastic",
            "Fair for the price",
            "Perfect to use for home schooling",
            "Perfect",
            "It's value for money",
            "Good Tablet",
            "Great tablet great value",
            "Bought 2 very smart",
            "Amazing",
            "Good design and does everything you expect",
            "my tablet is a perfect remedy for wife's birthday",
            "Nice looking easy to use tablet.",
            "Huawei 10.1 tablet",
            "Huawey Mediapad T5",
            "Impressed",
            "good simple design, nice and light,",
            "Great spec of tablet for the price.",
            "Good price for a powerhouse!",
            "Great tablet.",
            "Huawei MediaPad T5 10.1",
            "Great tablet",
            "Reasonable for the price",
            "My tablet",
            "Nic",
            "Looks as good as it works",
            "Tablet is great",
            "Perfect for my needs",
            "Does what it says it does",
            "Excellent value for money",
            "Speedy , nice and compact",
            "Better than thought",
            "Super quality for the price, recommend.",
            "Better than a iPad",
            "Great battery life",
            "I pad",
            "really pleased with tablet it's f",
            "Good Value for money",
            "Got this for a Xmas present for my wife",
            "Daughter lovers it",
            "My tablet is brilliant",
            "I recommend",
            "Huawei T5",
            "My children were very happy with these tablets",
            "Very good product",
            "BAD picture & video quality.",
            "Ok",
            "My wife loves this tablet",
            "Tablet ideal size for me",
            "",
            "Superb tablet",
            "",
            "Great tablet",
            "SECOND HAND PRODUCT...............",
            "Brilliant",
            "This was bought as a present very happy with this"
        ],
        "review_text": [
            "My daughters love it and they get busy",
            "Excellent product very fast and good charging",
            "Excellent product when you compare it to \n other tablets on the market, competitive price ,would choose the one with the highest storage as it's only a few pounds more",
            "Great budget tablet, having 4GB of Ram this tablet can handle most apps and games without any issues or lag. Screen quality is better than expected the tablet is bright and ideal for youtube and Netflix.\nSound quality is also great and very loud.\nI would recommend this product.",
            "Super easy set up , great picture and sound . No complaints",
            "It's very good prefect",
            "Not able to use the micro usb for anything other than charging and data saving. Will not load from any type of camera other than Bluetooth. I like to use leads with my Ricoh and GoPro as they are made this way. No Bluetooth No pictures, very sad as I purchased as a media tool but it’s not.",
            "I would recommend this product to All my friends it has a really clear screen, very easy to use.",
            "Easy to use for the older person.\nLightweight\nClear and quick with good storage.",
            "Great buy looks really expensive and is superb quality does everything it said on the advert, I'm very happy.",
            "I would highly recommend this tablet. Brilliant size and very easy to use.",
            "Fantastic tablet Huawei brand Excellent features.",
            "Good memory with option to expand\n\nWell spec'd processor \n\nThis model doesn't have the sim card option\n\nCamera and speakers reflect pricing, but meets my requirements",
            "Bought this for my Mum for Christmas, she is made up with it. Although she liked her previous tablet, she was struggling with the size of print.( It was set to maximum  but still not big enough )",
            "Nice tablet with good sized screen and memory. Reasonable price.",
            "Easy to set up for a child. Downloaded all the apps she likes quickly and still has room for more. Has a memory card slot. 2 speakers. Camera seems OK as well.",
            "This tablet is great quality. The images are brilliant and it's very light and easy to use",
            "Bought this for my son who absolutely loves it.",
            "Bought this for an upgrade for the husband and he seems happy with it.",
            "Nice clear screen ,very fast would definitely recommend to friends and family",
            "Mediapad T5 is fast and easy to use.",
            "Very pleased with this tablet - I bought it mainly for watching video and browsing the internet. The screen resolution is great, good colours and the operating speed is very good and not laggy, so it's perfect for my usage. The on/off and volume buttons are in a bit of an awkward place as I often turn of the screen off during use by accident which is annoying but it's only a minor issue really. Overall a great value tablet and would recommend to anyone.",
            "I bought my first 10 inch tablet 5 years ago. The packaging box for this 10 inch Huawei Tablet is half the previous size, the charger is half the weight, and many of the key specifications such as screen resolution, processor speed,, RAM and ROM are at least double on this model.",
            "Great tablet my whole family has one, good size screen",
            "Purchased this for my great granddaughter for Christmas, very happy child with a tablet that gives her everything she needs for schoolwork and to play games on and keep in touch with here friends during lockdown.",
            "Argos collection point and staff first class, Huawei  Tablet is Excellent.\nArgos car parking price is a bit extreme for a click and collect also the ticket machine is not very user friendly , but all in all a good experience .",
            "A great buy easy to setup and a much needed replacement fast good battery and a lovely clear screen very pleased would recommend",
            "Excellent value for money. This tablet is so easy to use, its lightweight, has a good battery life with a 64gb internal memory with facility to have more via SD card. Would highly recommend.",
            "This is the second one I have brought. this  one is for a present as I liked it so much.",
            "Buy the covers and screen protectors",
            "Nice slimline model. Easy access straight forward to use. Quality pictures and i would recommend it.",
            "Its amazing iv brought it for my 8 year for her xmas prezzie so far its great",
            "I got this tablet to replace an old Samsung. I really like this. Nothing that I don't like. Does everything you would want in a tablet. Would recommend as was a lot cheaper than the equivalent higher end tablets.",
            "Purchased for my 8 year old son. Does everything he needs and works well for the games he plays, Roblox in particular. Battery life is good and is very quick and responsive.",
            "Staff very helpful in choosing the right equipment.  I am very pleased.  The Argos card helped me pay for the equipment at a later time.",
            "This is a great tablet, good looking and easy to use. Good amount of storage and I would recommend this.",
            "I like to get for a friend at Xmas she like it so easy to used",
            "Eay to set up and use. Got loads of features including word which is incredible useful. I love it",
            "Very pleased with my new Huawei T5 tablet. Much quicker than my previous Huawei T3 with more storage and features.",
            "Great out of the box easy to set up and use, it's a shame it doesn't come with a case, but plenty available, my case allows the tablet to sit up on my desk.",
            "Lightweight despite screen size, but I don't like the company's willingness to collect all private info, photo and all contacts included",
            "Good allround tablet.",
            "The huewai Tablet is  everything I wanted in a tablet good storage great screen and downloads easy to do",
            "Great item, easy to setup and 75% charges so I was able to use straight from the box.",
            "I'm very pleased with my purchases and an all round thank you to those involved with my products. Highly recommended and looking forward to further purchases x",
            "absolutely fantastic pad for the money highly recommend",
            "Good tablet, easy to use",
            "My son loves his tablet to do school work on. It is well worth the money.",
            "Very good tablet fast and easy to use. Only let down by the battery life/charge time",
            "Not the greatest.  Battery life is poor when gaming or watching a movie.  Alright for light browsing n small games,  but if you are a hard user/gamer,  then this wouldn't be of much use.  \nMuch better out there in terms of battery life.  Specs are otherwise OK and memory decent but does run slow when uploading or buffering things.  Speakers are at the bottom and aren't as loud as other brands.",
            "Orderd fridge, booked time slot, due to coved 19, i didnt think argis would deliver to houe, driver fantasstic,",
            "It's quick & easy to follow instruction, transferring from your old table is quick, it's light weight to hold, enjoying exploring new feature features.",
            "Every bit as fast as my laptop and easier to use",
            "Great tablet for the price, lovely bright screen, great audio and very a responsive touch screen just a little let down by the battery life. Saying that it's probably me on it all the time. Highly recommend.",
            "Perfect! Fast! Perfect for games! Fabulous for kids! My love it!",
            "Would  recommend this tablet to anyone great for the price",
            "Was delivered very quickly and had no problems setting up this tablet",
            "This tablet is my daughter s birthday gift....and she love it.....ok for the price",
            "Good value tablet,nice quality picture .Easy to set up,if I can do it then anyone can.l don't play complicated games so it does everything I want it to.Jukebow",
            "Really pleased with swapping all my apps and files all up and running in half an hour a first for me. Great tablet good battery life. Easy to use. Portable fits in my bag. What's not to like.",
            "High quality tablet glad u purchased and good camera",
            "really delighted with this product it was simple to set up and it works well just what I was looking for.  Colours are good it is slim and light weight",
            "My tablet is great love the screen size easy to work as I'm not a techno wizz .",
            "It's not really been used to it's full advantage yet, hence only 4 stars. Very easy to set up, literally turn it on and select Country/Language.\nNice looking tablet.",
            "Does exactly what I need and is small enough",
            "I wanted to replace my old ipad and opted for this as I have a Huawei phone. Does everything I need it to, its fast and I like the size. I don't think the battery life is excellent but its for use in the house so can charge easily.",
            "This is a very responsive and powerful tablet it was a great buy the processor is very powerful the graphics are brilliant and it's made by a great company its far better than equivalent iPad and less than half the price of one. The numbers speak for themselves try one yourself.",
            "Very good product. Highly recommended",
            "I can only pass on my daughter's comments. She said that it's better than a laptop and rates it very highly!!",
            "Nice tablet. Good quality and good memory. Nice design and easy to work.",
            "I've had other well known brands and found this item outpaced them hands down, quality build and very high spec.",
            "Really easy to set up and works really well, fast and efficient for what I want it for. Which is to Internet broke, watch films and use Zwift!\n\nOnly negative for me is it described as having USB 2.0, which it doesn’t.",
            "It is an ideal tablet for everyone. Simplier to use than IPad.",
            "Very good five stars.",
            "My son loves it, has a big screen and a good sound. No issues until now",
            "I actually bought this because the one I wanted wasn't available for delivery due to the current Covid-19 restriction.  Anyway, it is amazing.  So easy to set up and use.  The camera on it is brilliant and having the larger memory meant more films/games can be downloaded the the family.  Really happy with my purchase.",
            "Nice tablet easy to use",
            "Got my new Huawei media tablet. Charged it up , downloaded my apps and logged in. Very simple to use and so fast. Very pleased with my purchase and great value for money.",
            "I have been using huawie for the past few years it has everything what you need my child is happy what else do I need.",
            "Great item for the price I paid.\nI was no looking for a top level tablet and it just do the job",
            "Perfect for my 6 year old to use for all his home schooling, and happy with the price we paid.",
            "Very good money for this tablet. I am happy.",
            "Nice tablets with affordable prices",
            "The tablet has good battery life and 10.1 inch screen which is quite big. It has sleek and slim design which looks good but at the same time it means that you have to handle it carefully as it might not survive a drop on the floor. So I think it would be good to use a shock proof case for this if you want to give it to kids.\nThe only drawback is that the tablet takes long time to charge due to the fact that it has a micro usb slot rather than a type-c slot (which enables fast charging).",
            "Good tablet great valuev",
            "Very pleased with the product bought 2 of them good quality got 4 gig of ram battery life good would recommend",
            "I can't be more happy! My phone is Huawei too so I knew that the tablet will not disappoint me and I was right! As perfect for me it's perfect for my 4years old son..  Love it",
            "Very strong and sturd. Work a well does everything you need and more",
            "A good performer for browsing the internet,taking photos & games \nDownloading apps & games are quick and easy. It has a large memory so storage shouldn't be a problem.\nThis tablet ticks all the boxes for me , I will say prescription rather than description.",
            "Easy to set up. Was using it functionally within a few minutes.",
            "Bought for use in lockdown for school work.no use a it wil not accept windows teams keeps telling you wrong browser. Not very happy had go buy a laptop.",
            "Arrived next day :)\nWorks as promised....\nKeeps 3-4 h on its own before charging\nstill need something to support it and not to hold it (tiring)\nOtherwise, very happy with it :)",
            "I bought this for my son to do his schoolwork on during lockdown - its really good! I'm no tech expert but in my opinion this is just as good as the Samsung one my family member has which cost £120 more. Its quick and vibrant - we love it",
            "on receiving the tab, its been a really good purchase, just right for my daughter to study with for home schooling, its light and portable, I would recommend this product.",
            "I bought this tablet for my kids. Battery power is good. Usability is good. Screen sensitivity is good.",
            "I was torn between this one and the M5 model, which has almost identicle specs ( the cameras are better than this one. )  The difference between the two is this one has a micro USB connection and the M5 is a more updated USB C. The M5 is compatible with the Huawei pen too.\n\nThe only other difference is the build quality, there are more metal parts on the M5. Weighing out the options I went for this cheaper model as I wanted something cheap to run Pokemon go.\n\nIt runs pokemon go smoothly!",
            "Very good battery. Picture quality is excellent.",
            "Great for the money, my husband loves it",
            "Bought for my son to do his homework on and it has been great :) bought a case with magnetic ley board so typing os easier. Really happy with this purchase",
            "Reasonable for the price. Negative points would be that it would be very easy to drop, especially with glossy surfaces. Also, as an elderly person I find the physical control buttons difficult to use as they are so tiny.",
            "Great tablet, good size too & great price for the make, everything you need on it. Very happy thanks argos",
            "This was a purchase for my 10 year old. She found it very easy to use, it has good storage and a great battery life.",
            "Every thing I wanted plus more",
            "Very happy with tablet great picture and screen",
            "You should offer a discont for suport and covers if you buy them toghether",
            "Wanted the tablet to backup, 30gigs of photos.\nNo problem, with another 30gigs of space spare.",
            "Very good value for money.  Excellent performance.  Great for watching videos on Netflix, YouTube etc.",
            "Very pleased with the product, it's neat tidy and very fast.\nDoes everything I wanted it to do writing documents etc , searching social media and the likes.\nVery happy with purchase, I love my huaweis and buy nothing else these days.",
            "Got this for my wife, had a few problems mainly to do with touch screen.\nThings to be aware of if screen cold or fingers too wet or too dry affects the touch screen but do be patient most comes down to how you are touching especially if you used to be a Samsung fan.\n\nSo far love it I have two more tests to complete before been 100% happy, so when I get the courage to open a banking app to test I'll know but everything else super",
            "Tablet good quality, very well build, just one thing needs to be changed it's charger slot for type c . Rest of item absolutely fine. Good price for the quality.",
            "Excellent tablet... more faster than an iPad in my opinion. I got a mobile phone of the same make and was so impressed went and bought this.. and I've been totally amazed by it. I'd highly recommend this tablet....",
            "Good fast service excellent",
            "On off button not the easiest to use happy with the rest",
            "really pleased with product and would recommend to anyone the make is excellent as I've got mobile phone the same make and would give 5* to both",
            "The tablet is fast and huge memory for the price. Just the screen seems a little bit smaller compare to other 10 inch tab, as the apps icons are quite big and you can't reduce the size.",
            "Got this for my wife has a Xmas present.Has she is very tech savvy I was worried she will not like it has she’s only ever had apple or Samsung products.Wow she loves it and keeps saying how fast it is",
            "Daughter lover it as her digital art looks great and is very responsive",
            "My tablet is brilliant",
            "The tablet is very nice. Fast, great look, very easy to use and Argos offer the best price !!!",
            "Great piece of equipment. This is our 4th device from Huawei and not disappointed. Our previous tablet was the T5 3/32gb version (which we still have and use)but this upgraded verion of 4/64gb certainly proves it is worth the extra few pounds, Fast, responsive and does what it says on the tin.",
            "Exactly what we asked for and work really well",
            "Very good product.\nGood pictures good sound\nI really like",
            "Picture quality is BAD!\n\nIt was bought it to make vlogs. Picture & video quality turned out to be very disappointing sadly.\n\nWith the resolution quality advertised rather than the MP of camera can be very misleading.\n\nWatch out! If you need the camera like we do, look somewhere else otherwise reasonably ok.",
            "Good batery, poor touch screen.",
            "Bought to replace an ageing tablet this one was easy to set up straight from the box. Simple to use and battery life is excellent",
            "Good clear screen, works quickly and easy to use",
            "Nice and slim but headphone socket a bit close to the corner",
            "Really superb tablet that's fast, easy to navigate and performs well. An excellent purchase.",
            "Pro: good baterry life, fast in games and apps. Nice if you want to use it as ebook reader. \n\nCon: to big for me\n\nIf you need a tablet for games choose maybe 8 or 9 inch",
            "Quick and light design plenty of memory best one I purched",
            "UNFORTUNATELY THIS MEDIAPAD T5 ARRIVED IN A DISGRACEFUL MESS, THE BOX WAS DIRTY THE BOXES SEAL'S HAD BEEN BROKEN AND THE UNIT HAD BEEN CLEARLY USED.\nNOT WHAT I WOUL EXPECT FROM ARGOS AS THIS WASNT HARD TO MISS BEFORE IT WAS SENT OUT FOR DELIVERY..............",
            "Very pleased with this tablet. I recently bought a different brand before this one and was disappointed. This one has amazing screen quality and sound. The battery lasts for days. Very fast even after installing data guzzling apps. After my previous experience, I cannot recommend Huawei enough. Superb device.",
            "Bought as a present very happy with the this product will definitely recommend"
        ]
    }
}