{
    "834/5028": {
        "remotekey": [
            "834/5028"
        ],
        "item_category": [
            "Whether it's mastering the art of multitasking or keeping yourself entertained, the slim and portable Galaxy Tab A7 has got you covered. With a stunning 10.4 display and Quad Stereo Sound, you can lose yourself in the latest blockbuster and listen to your favourite tracks. It's super light and sits evenly on any surface, so you can take it anywhere. And with a long lasting battery, you can play all day and then some. "
        ],
        "summary_star_rating": [
            "4.7"
        ],
        "no_reviews": [
            "53 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "96%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "4 August 2021",
            "4 August 2021",
            "4 August 2021",
            "4 August 2021",
            "4 August 2021",
            "4 August 2021",
            "30 July 2021",
            "30 July 2021",
            "21 July 2021",
            "9 June 2021",
            "4 June 2021",
            "1 June 2021",
            "23 May 2021",
            "19 May 2021",
            "3 May 2021",
            "20 April 2021",
            "14 April 2021",
            "24 March 2021",
            "17 March 2021",
            "17 March 2021",
            "17 March 2021",
            "10 March 2021",
            "7 March 2021",
            "3 March 2021",
            "25 February 2021",
            "23 February 2021",
            "17 February 2021",
            "3 February 2021",
            "29 January 2021",
            "27 January 2021",
            "27 January 2021",
            "26 January 2021",
            "21 January 2021",
            "19 January 2021",
            "5 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 December 2020",
            "26 November 2020",
            "25 November 2020",
            "18 November 2020",
            "18 November 2020",
            "21 October 2020",
            "21 October 2020",
            "20 October 2020",
            "20 October 2020",
            "13 October 2020",
            "7 October 2020",
            "6 October 2020",
            "6 October 2020",
            "29 September 2020"
        ],
        "review_title": [
            "Its ok Nothing special",
            "Great feature",
            "excellent",
            "Very Capable device",
            "Great Tablet",
            "Samsung tab A7",
            "Easy to use",
            "Excellent",
            "Great picture, great sound",
            "Great",
            "Great features",
            "Samsung tablet",
            "Good tablet",
            "Wonderful",
            "Excellent tablet.",
            "Brilliant Tablet",
            "Doesn't play basic videos",
            "Tablet is great",
            "Great",
            "Samsung tab a7",
            "Tablet looks good",
            "Seamless set-up as usual from Samsung, powerful",
            "Superb Tablet",
            "tablet",
            "My daughter loves it",
            "Yes",
            "Very nice",
            "Galaxy tab",
            "",
            "Slick and Fast",
            "Excellent",
            "Great peace of electronic",
            "Very good tablet",
            "Nice bit of kit",
            "Samsung A7",
            "My iPad is great",
            "Its excellent",
            "My Tablet is Fab.",
            "Perfect",
            "Best",
            "My daughter totally loves it",
            "The tablet it was amazing",
            "The Samsung tablet looks good and works great",
            "My A7 is great",
            "keeps the wife quiet",
            "Tablets looks amazing",
            "Slimline design",
            "not free",
            "Much improved over the 2016 model",
            "",
            "",
            "Is the best tab .."
        ],
        "review_text": [
            "Its ok Nothing special, not much memory if you get the 32gb model as A LOT is use by the system files. Its quick, performs well enough, a little over priced, and had some Samsung bloatware on it. Camera some what lacking and NO flash on the back.",
            "Very happy I bought it",
            "love it very good product",
            "This tablet has a great screen, good battery and does everything I need, watching movies, YouTube and shopping.  My only complaint is it feels a tiny bit slower than expected but far faster than any if the fire tablets. Well worth the price.",
            "This tablet covers everything I wanted it to. It runs all media apps I have tried faultlessly (IPlayer, netflix, you tube etc) and all the other staple apps internet apps that I am familiar with. I've seen a few negative reviews saying it wouldn't play media etc but it absolutely does without buffering or issues. It's quick to load and blows my old amazon fire out of the water. Works great on the sim card also. Can't comment on serious work use or gaming but as a media player and general internet tab it's great. I  don't know why you would  waste 3 times the cost on an ipad for this kind of use. Battery life seems very long to me also and the sound is very good. Highly recommend this.",
            "I had this tablet a mouth now its a great tablet fast and good quality with good screen very clear with long battery. And the price was a real bargain. I would highly recommend this product",
            "At the moment I am very happy with it.",
            "Brilliant.  What wanted. CELLULAR and that is not always made clear. Very  nice bit of equipment. Slightly  pricey.",
            "Bought this for my daughter and it is a great tablet.  The feature for mobile data is fantastic we all used it on holiday.",
            "Is very good for play",
            "I brought it for my sister and she was very happy",
            "I bought this 2 weeks ago and it's quiet fast but does keep re booting itself,",
            "Bought this a weeks ago eady to use",
            "I brought this to replace another tablet it is extremely wonderful to use",
            "Bought for a child,  so needed to buy a protective cover. But easy to set up, easy to use, great tablet, would definitely recommend.",
            "One of the best tablets I've ever purchased. Highly recommended.",
            "I buy Samsung products. But this is terrible. It can't play itv player loads of delays. No solution or fix from Samsung. Don't buy this. Many consumers have said video playback is an issue.",
            "Great table and has a very good volume on it its nice and loud and easy to use would recommend this tablet",
            "I do love the tablet. Good nice",
            "It's a good tablet for a starter tablet. Fast set up, lovely colour (gold) however you can't get a cover for it from here I had to order it from ebay and a keyboard to link up with it. Wish it had a USB port. Front facing camera isn't great for zoom calls but ok for children to use",
            "Tablet is very big and works very well recomment it",
            "As mentioned great amount of storage and fast setup, bought as a birthday gift so ticks all the right boxes.",
            "I bought this tablet as a companion for my Samsung phone. Very happy as I always am with Samsung products, the only disappointment is, there's no fingerprint sensor on the back of the tablet like the phone.",
            "great table and easy to use",
            "Its great tab at affordable price",
            "Excellent products so happy",
            "Good for children. Fair money",
            "Really good quality sound and graphics",
            "Super produkt jestem zadowolona",
            "It is a fast device with a slick design. I used for movies and tv series it on a flight between the UK and Brazil and the battery lastes the whole flight with p2p head phones and airplane mode on, everything I asked for.",
            "Really happy with my purchase! Does everything I need. Good sound and quality.",
            "Its an excellent device and it works perfectly fine.",
            "Very good tablet, works very well.\n\nFast and efficient\nGood screen resolution \nLoud volume \n\nVery reasonable price considering the other tablets on the market.",
            "Pleased with tablet and a nice screen size. Easy to set up.",
            "Great mid range tab, worth spending extra for more storage, space. Overall a great gadget.",
            "Best thing I purchased it’s fast battery lasts long doesn’t glitch or get stuck \nAll together a good purchase works well on WiFi and with my sim in it no problems at all",
            "I love it . Its working properly.",
            "Easy to use. Very clear images, able to make and receive calls which wasn't possible on my old tablet. So happy with it.",
            "Perfect for my son he is very happy thanks Argos always great service very happy costumer",
            "I am using for study.best battery timing.",
            "The price was perfect for the product, the colour is beautiful and it's easy to set up and use.",
            "This tab looks great. And it holds a lot of battery",
            "The tablet was easy to use.",
            "Great Tab good price 5* love it",
            "bought this as a birthday present and it couldn't have been a better choice. wife is absolutely delighted. samsung really is a quality product.",
            "Price perfect\nMy soon its happy",
            "This item is nice and easy to use and having the sim available is great as your video call is much better to use with. The only down side is argos sells this product but dont sell the cover to go with it as this product does need a case to protect it",
            "its not free that means its trash ugh such a stupid tablet tab s7 is so better",
            "Bought this to replace a2016 model for my son. Much faster and a better screen.",
            "Kids very happy. Does well for school and gaming",
            "Good for kids school and gaming. Very pleased with it",
            "My daughter love her new tab,  the battery is very good and is download  very fast all her games. \nWith the camera still need to remember  to turn it the athoer way,but is ok"
        ]
    }
}