{
    "780/0894": {
        "remotekey": [
            "780/0894"
        ],
        "item_category": [
            "Fire HD 8 is fast and responsive—vibrant 8 HD display with 64GB storage, 2 GB of RAM and 30% faster performance thanks to the new 2.0 GHz quad-core processor. Stream films, watch videos or play games. Enjoy downloaded content all day with up to 12 hours of mixed-use battery life and USB C for faster and easier charging. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "34 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "91%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "2",
            "4",
            "4",
            "4",
            "5",
            "5"
        ],
        "review_date": [
            "28 April 2021",
            "22 April 2021",
            "3 March 2021",
            "26 February 2021",
            "23 February 2021",
            "4 February 2021",
            "26 January 2021",
            "26 January 2021",
            "26 January 2021",
            "26 January 2021",
            "26 January 2021",
            "20 January 2021",
            "13 January 2021",
            "13 January 2021",
            "5 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "25 November 2020",
            "24 November 2020",
            "24 November 2020",
            "27 October 2020",
            "9 October 2020",
            "9 October 2020",
            "8 September 2020",
            "25 August 2020",
            "18 August 2020",
            "18 August 2020",
            "8 July 2020",
            "8 July 2020",
            "17 June 2020"
        ],
        "review_title": [
            "I,m jealous!",
            "Excellent tablet",
            "Amazon tablet",
            "Looks good and works well",
            "Just great.",
            "Limited functions, restricted to Amazon",
            "I'm so glad I chose an Amazon Fire Tablet",
            "Perfect",
            "Very easy to set up and use!",
            "Nice little device",
            "Love the colour",
            "",
            "Brilliant Tablet",
            "An amazing tablet",
            "Perfect",
            "Looks good quick too",
            "Fantastic",
            "The Amazon HD8 is a great eady to use Tablet",
            "Fire is great",
            "Brilliant tablet",
            "Fantastic kindle",
            "",
            "",
            "Ideal as e-reader",
            "Easy to use and loads games fast",
            "My tablet looks fab.",
            "My tablet looks fab.",
            "great buy",
            "Amazon fire 8hd",
            "Tablet charging",
            "Takes too long to charge",
            "Misleading item description",
            "The tablet is portable and good",
            "My kindle tablet ia great"
        ],
        "review_text": [
            "Bought this for my better half for her birthday, have to say for what she uses it for it's a little gem.very quick good battery life and reasonably quick charge,only slight negative was the length of the charging wire which I would have liked longer but a decent piece of kit for the price I paid.",
            "This tablet was really easy to set up and use. Charges quickly. I am extremely happy with this product.",
            "Really good tablet and easy to use and set up. Really happy. Shame about the cover what is advertised with it , it does not for .",
            "Looks good nice picture quality well worth upgrade from kids kindle. Wish we had just got a proper kindle initially",
            "Really happy with my purchase, just what i needed. A nice smaller size so i can pop it in my handbag. Just really happy with how it works.",
            "Nowhere near as good as android, it's Amazon's own version which is very restricting, frustrating and full of adverts, I wouldn't buy another Amazon product after this.",
            "Amazon FireTablet  - great product and excellent value for money.",
            "Great tablet perfect for my son.",
            "Really impressed how easy it was to set this up and link to my Amazon Account. Very straightforward. It has a great display and screen size, good quality and sound. From a predominantly ‘apple product’ household this was purchased as I needed something I could access a sleep app through for my daughter without losing my phone of iPad through the night and this is perfect. Great value for money.",
            "Does exactly what it's supposed to do",
            "Better than my old kindle, love the colour and it does what it is expected of it! Love it! Thank you",
            "Amazon Fire HD 8 Inch 64GB Tablet - White charging not charging",
            "Absolutely thrilled with this tablet.  It is a good size and the sound and screen are perfect. The many apps have enabled my husband to read books and watch films and programmes when and where he wants.  It is easy to set up and navigate and a perfect price.  Really pleased - I would replace my Kindle with one of these...",
            "An amazing tablet where you can download any games and apps (nearly all of them being free). I also love the quality and price of this amazing tablet!",
            "I purchased this in the sale, but would have paid full price for it. Had I known how good it was. Great size memory. Brilliant RAM. The screen is very very clear. The instructions are easy to follow. Ir just pick it up and play, it's that easy. On a girly note, the blue is stunning",
            "Sadly won’t connect to WhatsApp",
            "Absolutely great bit of kit, we have two here, would recommend to anybody!",
            "The Amazon HD8 is a great value easy to use tablet.  It is worth paying more money for the 64 GB (or 32 GB) as the more memory the more apps you can run and the faster it runs.  It's weakness is you are restricted to Amazon App Store apps but you can get round this to some extent by loading the 4 Google Play Apks from the internet and then loading Google Play. There are videos on youtube to show you how. Of course, side loading Apps is not supported or recommended by Amazon!",
            "Xmas gift for grandson , great purchase , good price , lovely colour . Grandson really pleased with it x",
            "Brilliant product bought for my husband as a Christmas box he is delighted",
            "Fantastic kindle probably the best one",
            "Lovely size - no issues at all",
            "Like the product that much we are thinking of getting another for my daughter",
            "Great price and exactly what I need to comfortably read e-books at all times of day & night.",
            "The price was good would recommend to friends",
            "Good tablet for good price",
            "Good tablet for good price.",
            "My first kindle great price good battery performance  plenty of storage lots room downloading books watching movies  great apps very light  would highly recommend would buy again",
            "Amazon fire 8HD is very slow at searching if you get anything at all after registering on the tablet it froze and asked me to re-register ,I phoned Argos technical and they didn't know what to do and they gave me the Amazon Tec number ,all in all very poor.",
            "tablet good but takes forever to charge",
            "tablet id good with lots of memory but charger is rubbish it takes all night and is still mot fully charged",
            "I expected the tablet to be in its own case as, when the \"more details\" tab on the website is pressed it shows on the tab: \"A SECURE COVER WITH EASY ACCESS\nDesigned by Amazon, the slim, form-fitting cover with built-in stand allows for hands-free viewing in landscape and portrait orientation. The cover remains securely closed, at home or on the go, with its magnetic clasp.\" \nThere is NO COVER! I think the words \"available for purchase separately\" should be included.",
            "Always use the battery very flat before you charge it and do not charge it over night.",
            "Great price for a tablet and is amazing too"
        ]
    }
}