{
    "918/4453": {
        "remotekey": [
            "918/4453"
        ],
        "item_category": [
            "Get bumped up to first-class experiences through the Lenovo Tab P11's eye-catching 2K visuals on its 11-inch display, quad speakers with persistent user-facing stereo tuned by Dolby Atmos and 15 hours of battery life, all housed in a slim aluminium-alloy casing with contemporary dual-tone finish. It also comes with the latest new kids mode with Google Kids Space, featuring content that helps kids discover, create and grow. "
        ],
        "summary_star_rating": [
            "4.6"
        ],
        "no_reviews": [
            "9 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "88%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "22 July 2021",
            "21 July 2021",
            "8 June 2021",
            "8 April 2021",
            "31 March 2021",
            "31 March 2021",
            "17 March 2021",
            "16 March 2021"
        ],
        "review_title": [
            "Top product",
            "A great tablet at a good price.",
            "Small price for such a great tablet",
            "great screen size and feel.  Value for money",
            "Great all purpose tablet",
            "Good, but not perfect",
            "Disappointed",
            "Nice Tablet , So-so battery life ..",
            "Keep taking this tabledt"
        ],
        "review_text": [
            "I bought this tablet for work . \nIts really competitive with the much expensive products . In a few words you get a top product with a decent price .",
            "Bought this as a present for my partner & he is so pleased with it. It is easily as good as the big named tablets but at a more reasonable price. It's very light to hold & easy to use. Would highly recommend to anyone looking to buy a new tablet.",
            "Made this choice over a lot of research, great screen and performance for the money. If you looking to buy a tab you will not regret!!!",
            "I bought this after my Samsung Galaxy tablet packed up and the warranty return was going to take 16 days.\n\nSo far this product seems far superior to Samsung",
            "Great value tablet - nice big screen and excellent speakers. Good for media and productivity without being silly expensive.",
            "Good tablet, reasonable price. The screen is sharp and bright, the sound is clear and loud, it's reasonably fast too, there is plenty of RAM (6GB) and storage (128GB). However, the battery life is a bit underwhelming. The bezels are quite narrow around the scree, the camera module is protruding at the back so a case is definitely needed. It plays Netflix brilliantly in 1080p full HD, but it only plays Amazon Prime Videos in 480p which doesn't look good on a 11\" screen. No fingerprint reader.",
            "I bought this thinking it was going to knock the socks off my other tablets, very disappointed with it, so much so that I took it back, I got it so I could watch TV apps and it has a 2k screen, no good having a 2k screen if it can't process anything in 2k, had to take it down to 360p to be able to watch anything, my other tablet is FHD and works fine, this couldn't handle it and at this price it's a big disappointment.",
            "TBH , i was abit underwhelmed on receiving this tablet , if i could have got the larger P11 Pro model in the uk i would have done , my 2yr old samung died suddenly and i just wanted quick replacement and wanted to avoid samsung after the old dead tablet .. so all in all it seems to be a decent enough tablet , seems fast enough , though i don't game on it , as it's a new model there doesn't seem to be many cases out there , so had to send off to a certain Chinese market website ..",
            "Nice compact design,grear picture plays Netflix in HD also if you buy a tablet\nfor work as well as home you need the 128gb + you can also extend the memory to 256gb."
        ]
    }
}