{
    "940/7068": {
        "remotekey": [
            "940/7068"
        ],
        "item_category": [
            "Live every moment with the ultra-handy 7 inch Alba tablet in silver. Designed with a bright IPS screen and easy to navigate display, this palm-sized device is perfect for keeping the little ones entertained. There's even a parental control app, so you can rest assured knowing they're safe from adult content. With front and rear cameras, take photos in an instant and enjoy 16GB of storage and up to 64GB with a micro SD card. "
        ],
        "summary_star_rating": [
            "3"
        ],
        "no_reviews": [
            "27 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "52%"
        ],
        "review_rating": [
            "4",
            "1",
            "4",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "2",
            "2",
            "2",
            "5",
            "1",
            "5",
            "3",
            "1",
            "2",
            "5",
            "2",
            "5",
            "1",
            "2",
            "4",
            "5",
            "1",
            "1"
        ],
        "review_date": [
            "1 August 2021",
            "30 July 2021",
            "3 June 2021",
            "4 May 2021",
            "20 April 2021",
            "20 April 2021",
            "20 April 2021",
            "15 April 2021",
            "13 April 2021",
            "7 April 2021",
            "31 March 2021",
            "30 March 2021",
            "30 March 2021",
            "24 March 2021",
            "17 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "2 March 2021",
            "26 February 2021",
            "25 February 2021",
            "24 February 2021",
            "24 February 2021",
            "17 February 2021",
            "17 February 2021"
        ],
        "review_title": [
            "Good value",
            "2 days it’s stop working",
            "It's brilliant",
            "Tablet",
            "Amazing tablet",
            "",
            "Exllent",
            "Good value entry level table",
            "Amazing tablet",
            "Silver tablet",
            "7inch tablet",
            "Very poor tablet that's crashes and won't run apps",
            "Good value.",
            "Very slow and only worth what we paid",
            "Gr8 tablet Very neat",
            "Looks nice",
            "Wish it had reviews befor I brought this",
            "Very slow and too sensitive",
            "Lit",
            "Looking good",
            "Great first tablet.",
            "Alba 7 inch tablet",
            "flat",
            "Tablet as expected",
            "",
            "Simply awful. Avoid at all costs.",
            "Tablet stopped working after a week."
        ],
        "review_text": [
            "Nice long life battery. Lightweight. Very happy",
            "Very bad only two days it’s stop working",
            "I'm happy with my purchase my grandson loves it for the size",
            "Worst tablet ever.I'm not happy with it at all.",
            "It’s a extremely great table. It’s fast and effective which is an amazing. I would definitely recommend this my family and friends.",
            "Brought this for my son and it was the best choice he loves it the graphics are great and the sound is perfect",
            "Recommended buy it. Morden worth it",
            "Very good option for those who need basic tablet functions including those job seeking and those learning at home.\nSimple setup and very useful OTG option which enables downloading/uploading to a USB stick. Silicon covers make the tablet easy to handle.",
            "My child loves the tablet. it is very easy to use and it looks great. it is a bit slow but that’s not a problem. I would recommend buying it!",
            "Runs a bit than I'd liked but it's ok for my apps",
            "The tablet did not work very good brightness was not to good and also did not like the update and needed to take the tablet back to not working",
            "Very poor battery life , crashes alot and won't play certain apps (roblox which my daughter plays) would of returned if it wasn't for my daughter marking the screen.",
            "This is a fair enough tablet. I only wanted a cheap & cheerful tablet for some quick internet searching & checking emails & this does everything I want. It's an Android tablet so has the Google Play Store allowing you to download many apps. Don't buy this thinking you're getting the latest Apple i-pad or Samsung tablet, you're getting a good more basic tablet that lets you get online. All round this is good & worth the money.",
            "It stopped working after 5 days maybe it was to do with a game that my daughter downloaded and not enough memory on it . Also quite slow only suitable for a quick look online .",
            "My daughter loves her new tablet Its gr8 for emails youtube and so much more",
            "Not a bad device for the money ok for some things but not others runs abit slow and screen sensitivity can be troublesome.",
            "This tablet is horrible it’s so slow and takes for ever to do anything on it. It’s fine for watching Netflix’s /films when you finally get it to load!  wished I had waited until there was reviews on this so I saved my money",
            "Not a very good tablet, screen is very sensitive, when scrolling it acts like you've pressed to go onto a page. This has been made slightly better following us adding a protective screen. Also very slow to respond to touches.",
            "Lit Tablet for the money",
            "Have not had a good product screen bad",
            "Great first tablet, can be abit slow. \nGood for game apps",
            "Was not happy with that tablet I had exchange it with amazon fire 8 inch what is better.",
            "battery flat charged it up next day flat doesn't hold the charge   waiting for shop to open",
            "Good value easy to use",
            "Excellent product for the price. My daughter loves it. Will recommend.",
            "Kids first tablet , on paper good specs. Comes with 2 gel cases. Using device is painful, slow and crashes often. So much better alternatives at same price or a little more\n\nReturned and exchanged, staff at local Argos excellent customer service.",
            "Not happy with it the purchase & can't exchange it yet.."
        ]
    }
}