{
    "787/2073": {
        "remotekey": [
            "787/2073"
        ],
        "item_category": [
            "The Venturer Challenger 10 PRO comes with a detachable keyboard, and the latest Android 10 Software meaning it's equipped with the latest security protection. A large HD 10\" IPS screen is great for gaming, viewing videos and playing all the latest social media apps, and with dual 2MP front and rear cameras you can video call or take snaps. You can expand the 16GB memory with the Micro SD card slot to have more storage. Connect to the internet via WIFI and to other devices through Bluetooth. A device to fit ALL your social needs. "
        ],
        "summary_star_rating": [
            "4.4"
        ],
        "no_reviews": [
            "54 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "89%"
        ],
        "review_rating": [
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "3",
            "1",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "1",
            "5"
        ],
        "review_date": [
            "30 July 2021",
            "30 July 2021",
            "24 July 2021",
            "2 July 2021",
            "23 June 2021",
            "20 May 2021",
            "20 May 2021",
            "19 May 2021",
            "6 May 2021",
            "27 April 2021",
            "21 April 2021",
            "16 February 2021",
            "13 January 2021",
            "12 January 2021",
            "7 January 2021",
            "7 January 2021",
            "6 January 2021",
            "6 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "5 January 2021",
            "3 January 2021",
            "3 January 2021",
            "3 January 2021",
            "2 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "1 January 2021",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "31 December 2020",
            "7 December 2020",
            "4 December 2020",
            "3 December 2020",
            "2 December 2020",
            "2 December 2020",
            "2 December 2020",
            "2 December 2020",
            "1 December 2020",
            "1 December 2020"
        ],
        "review_title": [
            "Tablet",
            "Very easy to use",
            "Tablet",
            "Battery power is a joke",
            "Does what it should",
            "Tablet",
            "Constantly needs charging",
            "RUBBISH!!!!",
            "Decent sized tablet",
            "Amazing works really good",
            "It looks like a laptop and is easy to use",
            "Not great",
            "New tablet",
            "This is good enough to describe as a mini laptop",
            "Its fab for school work",
            "Venturer 10 Pro 10.1 Inch 16GB Tablet with Keyboar",
            "Works good bought to play bingo",
            "Decent little laptop Ideal for a kids first",
            "Good price tablet",
            "Lovely product",
            "Laptop looks good",
            "worth it if on a budget",
            "Perfect",
            "Lovely tablet",
            "Easy to use",
            "Wowsers/Fantastic..lost for words..",
            "Perfect for what my little needs",
            "Fit for purpose, my son loves it!!",
            "Lovely little laptop",
            "Tablet is great. Keyboard is easy to take off and",
            "Good little laptop",
            "Perfect tablet",
            "This tablet is excellent for online meetings",
            "Tablet with Keyboard",
            "Excellent product and price",
            "Well maid heavy .",
            "Good on the move",
            "Kids love this tablet",
            "Disappointing",
            "Good purchase",
            "Ideal gift",
            "Really neat",
            "Good but not great",
            "Looks great",
            "Tablets",
            "perfect for the use of Remote learning",
            "Cheap tablet",
            "Very good",
            "It does what I wanted it for. Good key board",
            "Pleasantly surprised by the value for money",
            "new tablet",
            "My tab looks fab ,but battery draining quickly",
            "No GoogleMeet, Zoom or Skype apps on GooglePlay",
            "Good value tablet."
        ],
        "review_text": [
            "Working is good . \nNice tablet",
            "I purchased this item as I'm a gadget freak and i love it",
            "Very good .am happy to buy this",
            "I bought this less than a month ago and within a COUPLE OF DAYS and from no reason the battery doesn’t last more than a couple of hours from FULL power. Not what it said on site. It glitches a lot, won’t open thing the first time. I’m shocked at the little glitches in a BRAND NEW tablet. The overall running is good but I bought this for good battery life so now totally useless to me.",
            "for what my family and I wanted it is perfect low price sturdy and easy to use the key board is responsive the pad boots up quick",
            "Good , Hardy tablet  . But nice and slim . Easy set up . Great value  and quality.",
            "Tablet is good but needs constant charging as battery doesn't last long",
            "Cheap plastic,  heavy, thick,  slow, the battery hardly lasted me 4 hours! It also heated up a lot when I charged it. I do not recommend this tablet!",
            "Bought this to move up in size from 7 inch tablet which I was finding difficult to read due to the keyboard taking up loads of space when it popped up. Having the separate keyboard is so much easier to type with plus the option to leave it behind to save on weight when out and about. Battery is the only downside, seems to run out really quickly. Not too much of a problem for a light user but may prove troublesome if you need to rely on it all day.",
            "My tablet is amazing works really good loads fast would recommend this to my friends and family",
            "You can use it as a laptop or a tablet. It is easy to use and easy to access your apps. Its good to do work on and watch programmes. Would highly recommend it for the price, and if you need a tablet to work on.",
            "Not that great, runs very slow, takes ages load web pages, only good thing is the keyboard imo, battery runs out very quick",
            "Excellent tablet.\nBrilliant display, excellent keyboard attached.\n100% satisfied.",
            "Bought for 9 yr old disabled son who loves it. As a keyboard it encourages him to type do interactions increased. Yet can swap off for normal tablet mode in car travel.  2 poet options  too give reassurance. Build quality good & robust. Display colours nice & side angles surprisingly good. If it had 32 gb it be perfect but overall for money is very good",
            "Got it my son to help do his school work and its fantastic for the price best buy ever with the covid lockdown he can actually keep up with his school work with this and affordable too on low income so really pleased with my purchase",
            "Got this for our 7 year old granddaughter it seem ok at the moment so far she loves it as it got the keyboard with it that was the reason for buying it as a first tablet",
            "Got for myself to play bingo very good and good for wen grandkids here they love it because has key board",
            "Got this little laptop for my niece.  She loves it.  It's ideal for a kids first laptop/tablet.  It's cheap easy to set up and use plays all the streaming sites.  Great for schooling from home during this difficult time.  If your getting this for someone who wants to game on it I would look elsewhere it's ok for small mobile type games but that's about it with gaming on it.",
            "Great fore price does what you need to do email social networking",
            "The laptop is very efficient, clear and light weight. I would definitely recommend to family and friends. We bought two and was definitely good value for the price we got it at the time.",
            "Bought for grandkids . Excellent for them",
            "sturdy android tablet with keyboard that will come in handy for homework for primary school year 1to 6 and their own use but can be charged by plug supplied or a separate USB which is slower..",
            "Great for the kids and big kids",
            "Lovely tablet with detachable keyboard useful for completing school work.",
            "This was purchased for my 93 year old mother to start her off with online tech.\nShe insisted on a keyboard. with 2 weeks she was able to email, whatsapp etc. now she is starting to write her life story. Great bit of kit",
            "Wow, This is a budget \"Tablet/PC\" and it's fantastic. The keyboard is out of this world, it even has a touchpad unlike other more expensive brands. It's a nice good speed for watching movies etc.. this is now my go-to laptop, I even use a mouse with mine.. I suppose the only downside is the battery doesn't last too long, but hey, I bet most phones only last half a day.. just sit next to a power socket.. graphics are also fantastic.. I highly recommend this tablet/pc..A must have.",
            "just perfect for what my little girl needs",
            "Perfect little laptop/ tablet bought for my son",
            "I bought this for my 8 year old daughter for Christmas she absolutely loves it. She can use it for her homework application and for her games. It’s not the best at holding charge I’d say it works for 2 hours max.",
            "Battery life is a bit low.put not a big problem",
            "I brought this laptop for my daughter i would have like it a bit bigger, it is a tiny laptop however she loves it you can turn it into a tablet with just one click ideal for my daughter and the battery life is good too",
            "Just good as the expensive leading brands. Good connection to WiFi hours of pleasure for work and play",
            "Purchased to replace a defunct Linx, this is lighter, faster with an excellent camera and microphone. I am using it for Zoom and Team meetings and it is perfect for these. It was really quick and easy to set up too.",
            "Bought as a gift.\nPositives\nGreat size, colour, sound and bonus with keyboard with touch pad like a laptop for mouse/pointer,\nCan be used as a mini Android laptop\nAndroid ver. 10 runs Google Meet etc.\nEasy to setup or transfer data/apps from an existing \nConsiderations\nButtons are a little awkward at first\nTimes between charging are quite frequent\nStandard charger is pin type, but can be charged slower via an 8 pin USB.\n\nOverall.\nA great purchase.",
            "Looks better than pictures. Easy to set up.",
            "Easy to set up as a novice ,light to use handy with key board split .",
            "So good to use in the house or in the car or whatever you are very good buy",
            "Very good quality \nMy kids enjoyed",
            "I bought this so that my daughter didn’t have to share a computer with her brother when both were being schooled at home.\n\nThe app functionality is great - downloading Classroom, Docs, and a few games was a breeze and it was able to perform perfectly in terms of word processing and spreadsheets so the processing power is perfectly adequate but, when it came to playing games in her spare time, the graphics were not up to scratch - it froze and crashed with regularity",
            "Good purchase and good value for money ideal for watching the football on I follow \nDecent!",
            "Bought for my daughter-in-law for Christmas, said she loved it",
            "This was a Christmas present for my eleven year old son. He loves it, it is great as an introduction to a tablet, added bonus is the keyboard for practising typing. It has parental controls that are/can be linked to a email to keep an eye on the usage, as well as a timer to reduce the screen time. Well worth the money.",
            "This tablet is good if you are looking for a budget tablet with keyboard. I bought this as a gift for my sister who really likes the tablet. The tablet has a HD screen with good graphics however does look a bit soft and could be slightly sharper. The keyboard is very good and types like a standard laptop keyboard.",
            "Very good, work's well. Light and easy to use",
            "Great for games and educational for kids my daughter loves it great price",
            "It is perfect for Online learning, Especially during these COVID times.\nEasy to carry and as its an android, you can easily download needed apps.",
            "It is what it says it is",
            "My daughter like so much",
            "It's a good easy to use tablet. The key board is a real bonus and very easy to set up from my smart phone. It is now my second essential tech equipment, my phone being first. I will be buying another for my grand daughter home work.",
            "Missing the big Argos stores but your online site was a pleasant surprise, easy to navigate and competitive too.",
            "the price was excellent for value",
            "The product is very good ,but the problem is with the battery, its draining too quickly.",
            "Doesn’t really matter what the tablet looks like when it can’t be used for online lessons and meetings. GoogleMeet, Zoom and Skype applications not available on Google Play. Neither are Facebook and Messenger (less important). Was this product meant to be for young children? Why the keyboard then? Utterly baffled. The tablet is completely useless for my studies. Emailed both Argos and contacted Venturer about this- no reply...Can I exchange for a different product or my money back????",
            "Good value computer ."
        ]
    }
}