{
    "205/2685": {
        "remotekey": [
            "205/2685"
        ],
        "item_category": [
            "HUAWEI MediaPad T3 10 is a 9.6-inch tablet computer that incorporates a high-performance quad-core processor (MSM8917). MediaPad T3 10 offers an IPS screen at 1280 x 800 pixels with an ultra-slim and ultra-light metal body. A robust personal computer and entertainment device that is suitable for home, work, school or on the go. "
        ],
        "summary_star_rating": [
            "4.5"
        ],
        "no_reviews": [
            "78 reviews",
            "Recommended this product"
        ],
        "recommendation_percent": [
            "91%"
        ],
        "review_rating": [
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "4",
            "1",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5"
        ],
        "review_date": [
            "30 March 2021",
            "2 March 2021",
            "24 February 2021",
            "29 January 2021",
            "26 January 2021",
            "21 January 2021",
            "20 January 2021",
            "19 January 2021",
            "6 January 2021",
            "5 January 2021",
            "5 January 2021",
            "3 December 2020",
            "17 November 2020",
            "27 October 2020",
            "21 October 2020",
            "21 October 2020",
            "20 October 2020",
            "8 September 2020",
            "5 September 2020",
            "26 August 2020",
            "19 August 2020",
            "19 August 2020",
            "29 July 2020",
            "22 July 2020",
            "22 July 2020",
            "10 July 2020",
            "8 July 2020",
            "8 July 2020",
            "7 July 2020",
            "1 July 2020",
            "1 July 2020",
            "30 June 2020",
            "30 June 2020",
            "23 June 2020",
            "18 June 2020",
            "16 June 2020",
            "16 June 2020",
            "27 May 2020",
            "12 May 2020",
            "6 May 2020",
            "5 May 2020",
            "5 May 2020",
            "5 May 2020",
            "29 April 2020",
            "29 April 2020",
            "28 April 2020",
            "28 April 2020",
            "27 April 2020",
            "22 April 2020",
            "22 April 2020",
            "22 April 2020",
            "22 April 2020",
            "14 April 2020",
            "9 April 2020",
            "8 April 2020",
            "7 April 2020",
            "26 March 2020",
            "3 March 2020",
            "26 February 2020",
            "26 February 2020",
            "24 February 2020",
            "31 January 2020",
            "29 January 2020",
            "17 January 2020",
            "8 January 2020",
            "7 January 2020",
            "3 January 2020",
            "2 January 2020",
            "2 January 2020",
            "2 January 2020",
            "31 December 2019",
            "30 December 2019",
            "28 December 2019",
            "28 December 2019",
            "26 December 2019",
            "27 November 2019",
            "27 November 2019",
            "27 November 2019"
        ],
        "review_title": [
            "Tablet looks good and robust",
            "Tablet",
            "Very good",
            "Works fine all easy",
            "For price it's fine.",
            "easy to use, looks nice",
            "Tablet that made my year",
            "Good tablet",
            "The kids are enjoying it and it fits the purpose",
            "Ideal for Web surfing etc",
            "",
            "Looks sleek",
            "Very pleased with purchase",
            "Kids love them",
            "Fab tablet for my mum however could be faster!",
            "Really easy to setup and easy to use",
            "Best choice for me",
            "Purchased for my elderly mum. Easy to use & clear",
            "Tablet",
            "My tablet is so easy to use",
            "Looks great lovely picture and fairly quick good b",
            "Tablet",
            "Sleek and stylish",
            "Huawei 10 inch tablet",
            "Huawei tablet",
            "Very slow tablet disappointed returned for refund",
            "Home schooling reward",
            "Excellent product all round",
            "Could be better",
            "Tablet",
            "",
            "it is good tablet",
            "Fast and sharp picture.clean",
            "Uploads things fast",
            "It great my daughter love it",
            "Great Tablet",
            "",
            "Fab tablet",
            "Great tablet for the house",
            "Simple and slim.easy to use and set up",
            "Excellent tablet for price.",
            "The Huawei tablet",
            "Good for the price",
            "I would go there",
            "My tablet is great my daughter loves it",
            "very tactile and good looking",
            "Media pad is a very excellent product",
            "Nice build quality",
            "Stylish tablet",
            "Great tablet",
            "Excellent item and service",
            "Perfect, for a reasonably priced tablet",
            "Tablet for kid",
            "",
            "My daughter loves it",
            "Great purchase",
            "T3 32GB",
            "Slow response dont buy",
            "This mediapad is perfect for my needs.",
            "Cheap and very chearful",
            "Excellent TV",
            "My huawei tablet is working fantastic",
            "So far so good",
            "Superb tablet 100%",
            "Not as good as their phones",
            "",
            "Huawei mediapad.",
            "no thenks",
            "Good quality",
            "8 years old loves it",
            "Perfect for my kids",
            "Great tablet",
            "Awesome",
            "It looks good and works very well",
            "Cheap tablet",
            "Handy piece of tecnology",
            "Brilliant for price",
            "Excellent tablet"
        ],
        "review_text": [
            "Good looking tablet, with great picture quality, ideal for my needs and at a great price",
            "Great for my son school work",
            "The whole family have a Huawei tablet",
            "Needed a new tablet very simple to use and works well",
            "Had one of these before, does most things and it's fine for price. It does say 10inch but it's not.",
            "recomend for all ages",
            "Love the product really intuitive lots of app amazing quality and i'm finally be able to read again...",
            "Bought for my husband, good sized very clear screen. Happy with purchase",
            "It fits the purpose for remote learning but been unable to use YouTube is crazy",
            "Got as a gift and the recipient is very pleased. Impressive speed of loading apps. Good app selection. And a huge improvement over the old Ipad. \nI'd be happy to recommend this item.",
            "Got this for my nephew for Christmas, it’s the perfect size and works great, my nephew likes it.",
            "For my kid. Nice metal case and fast.",
            "Bought this to replace old 7inch tablet and as a techno novice was a little concerned may not be suitable for me but am thrilled with it easy to set up brilliant colour battery life excellent",
            "Bought two of these as I’m a childminder. The older children use them after school and love them.",
            "This tablet was a present for my mums birthday, really good design and portable to use from going to different houses etc. \nhowever I got this as our computer is really slow and needed something faster and portable. This tablet isn’t as fast as they said and sometimes lags. \n\nOther than that it’s really good size and Design.",
            "Really great value for money",
            "Compared to previous types this far outshines the others and at a great affordable price.",
            "Easy to use and clear bright screen",
            "My son loves his new tablet \nThis is a replacement for a tablet we only had for a couple of months \nThis one is so much better than the previous one",
            "This tablet is so easy to use, yet its like a mini fab computer that does everything.takes clear crisp pictures too.",
            "Needed a new tablet so looked at reviews there’s always bad ones I think some people just like a rant sometimes , good picture fairly quick and looks stylish maybe battery could be a bit more powerful but it suits what I need it for and good price and I’m pleased with it certainly better than spending £400 in something not that much better!",
            "Brought this tablet for my daughter the colours are beautiful the battery last about 6 hours but she is on it all day long so really happy with my tablet definitely buy again .",
            "Sleek and stylish and is very light.\nEasy to use and haven't come across any issues so far. Very happy with my purchase and my daughter loves it.",
            "The tablet does the job well. Our daughter is able to watch movies in the car and it is easy to use for us. Great kids Corner, very good value for money",
            "Cracking tablet and great value for money, good prices from Argos as always",
            "Is very slow continuously crashed and froze while doing basic tasks such as scrolling through Facebook. I downloaded pubg and other games was extremely slow and laggy I love huawei products but this was a huge disappointment. I would not recommend this product even for a child my niece age 11 got very frustrated trying to complete her school work ect returned for refund",
            "Bought as a gift for my son from his grandparents as reward for working hard on schoolwork during lockdown. It replaces his now obselete tablet. He is delighted with it and can now play all his favourite games on it which wouldn't update on old tech. Bought this one as it is the same as mine but slightly bigger. No problems encountered so far.",
            "Excellent product would highly recommend",
            "Its not a bad tablet but its being let down by a couple of things.\nFirstly, the volume is total rubbish. You have to turn the volume to maximum to hear it. Seen couple of others reviewers are having same prob. It wants a update if its possible to fix it that way.\nSecondly, battery life is garbage. Dont believe their specs for battery usage. I'm not getting 3.5 out of it.",
            "Is working very well.",
            "It’s very good for kids to watch the program",
            "nice product for kids",
            "Do clean regular and dont charge near water or any liquid.",
            "My friend got one of those and I loved it from start so I've got this one to put away for Xmas for my daughter",
            "The price is worth the money ☺️",
            "Battery life over 8 hours, which is great. 32gb works really fast and do not need charging every few hours.",
            "My kids love this tablet",
            "Was looking for a replacement for an outdated tablet, wasn't sure if this would be any good, but I must say I have found it to be very easy to use nice and light, good keyboard and it also looks more expensive than it is. All together I'm very happy with this.",
            "Highly recommend tablet, its fast great quality with long battery life. Only small issue is the weight but for the price I wouldn't be that bothered as it's well made",
            "Looks nice.easily set up ready to start straight away .",
            "Lovely tablet does same as expensive models but for a fraction of the price. Good display, quick to load. All round good quality tablet. Would recommend",
            "I am not at all happy with the product. It keeps getting stuck and the charging time take a lot to charge the tablet. Not the worth to buy as I had bought it for my son lockdown online classes and it does not stays battery life as says.",
            "Mainly bought for Google Classrooms and other Google apps used for home schooling. Easy to set up and use. The screen resolution isnt the best but still useable and the volume is quite low but apart from that great for the price.",
            "To actually be able to start using this thing you will need to give Huawei access to your google account and email account?. To do this you have to register with Huawei, to do this you need a registration code, to get this you will need access to another device. This doesn't work at all well and I ended up phoning the help line. That was no help what so ever.\nYou are probably getting the picture by now. I wouldn't recommend it.",
            "I would recommend this tablet to anyone it's better than any other tablets my daughter has had she loves it it's very fast loading and very good for the price",
            "don't accept all of the apps you don't need them.\ndo take care of it as it is easy to slip out of your hand if not careful",
            "bought for my wife, she found it very easy to use, and soon watching tv in bed, and downloading books to read.  So I can quietly get on with my iPad  reading my books in bed, with out getting asked if I had finished on it.  So wife happy, and I can carry on reading as long as I want.  Excellent buy for both of us highly recommend",
            "Nice tablet brought one for my dad in lock down to keep him occupied and to stay in the house. His getting old now portable and easy to use for him. He loves it he watches you tube regular shares the screen with his 4k TV an he don't come off it. Nice tidy unit would recommend this unit young and old.",
            "Battery does not last all day have to charge it regularly but I have been on s lot due to boredom being stuck at home.  Picture quality good and sounds okay.",
            "Upgraded my daughters tablet for her birthday so she's not had this yet although I have had a play around and set it up ready for her. Great on storage to accommodate all her games, screen size is perfect. Sound, picture quality and battery life is fab! She can also video call family on here which I didnt realise you could do with wifi only tablets so this is a bonus! Would definitely recommend :)",
            "Tablet very fast and good battery life",
            "Does exactly what is described, battery life is a little short but for the price of the tablet that’s a small negative, easy collection,",
            "Good storage space for apps and downloads. Quick responsive use, easy to navigate. Screen size is ideal for games and watching movies. Does take time to charge but battery lasts well.",
            "It's ok, it's very good condition and speed is very good",
            "As a birthday present for my daughter she lives it.",
            "Brought this a good alternative to assist my daughter with home schooling, it is great battery, good quality graphics and easy to setup, navigate and use. Would highly recommend.",
            "Great tablet. Had a 16 gb version before I dropped it. I would recommend 32gb or more as 16gb would not download much stuff. This tablet does what you need. Good battery life, great picture, not the best sound.",
            "Very slow cut down version of android not worth the money at all",
            "A clear winner in my view. Clear and good size screen, easily portable. Easy to use and excellent value for money.",
            "After being emotionally blackmailed by my 3 year olds cute face asking for a new tablet to watch on a boring road trip, this tablet fitted the bill perfectly.. decent storage to download plenty of peppa pig and other kiddy type programmes and big enough screen so her 8 year old brother can sneak a peek from his seat without looking too uncool :)",
            "Brilliant modern smart tv. Clear pictures and good sound.",
            "Love the shape and bettered life is very good",
            "Only had for a few days and seems to work well",
            "Faultless product that was straight forward to set up and it was easy on my pocket too.",
            "I bought this for my daughter for her birthday as she is always stealing my iPad. I had recently bought a Huawei phone for my son and was really impressed. So I decided rather than buy a Samsung tablet that was comparatively priced I would get the MediaPad. I find that it isn't very responsive and there is a delay when you touch an app. It does the job I guess for her but I wish I had compared them in a shop to decide.",
            "Its good and easy to use. my son is love it for school use",
            "Love my new Huawei mediapad tablet.its great so easy to work too. I would recommend this product.",
            "No too bad this Item is great is very good to us in family.",
            "Great for the money.",
            "Bought as Christmas present, so far no issues ,good performance, good battery .I wouĺd recommend this tablet",
            "Good tablet for my children to use.\nRespectanle battery life and memory and performance is fair.",
            "The tablet has a long battery good camera works fast  not too heavy to hold looks nice too great screen and a good memory capacity.\nI would definitely recommend it good on wife.",
            "Fantastic price of kit, really good value and serious brand. You won’t go wrong with this’s",
            "Affordable.slick.light weight.",
            "Cheap tablet well worth the money good all round performance,easy to use",
            "Easy to use and understand",
            "This is a brilliant tablet and so much memore for price. You will find it hard to beat for price.",
            "Great item .lovely camera.. easy to use. Fair price."
        ]
    }
}